{"relation":[["Editor\u0027s Pick","2","1","2","1","1","1","1","1","1","2","1","1","1","2","1","1","2","2","1","1","2","2","2","1","2","2","1","1","2","1","1","1","1","2","2","1","1","1","1","1","1","2","2","2","1","1","2","1","1","1","2","2","2","1","2","1","1","1","1","1","1","1","1","2","1","1","1","1","1","1","1","2","1","1","1","1","1","2","1","1","1","1","1","1","1","1","1","1","1","1","2","1","1","1","1","2","1","1","1","1","1","2","2","1","1","2","1","2","1","1"],["Caption","C3P0: Holy Sarlacc, who\u0027s this? Boba: I\u0027m Boba Fett, tinnie. C3P0: That is highly unlikely seeing as how Boba has green armor. Boba: Yeah well it\u0027s at the wash.","I don\u0027t see why I don\u0027t get my own series.","C-3PO: Boba, I\u0027d like you to meet your real father. Boba:... What?","C3P0:I heard you got the results back from the clinic. BOBBA FETT:Yep...not good..not good at all...phew,yep.","Boba: Hmm. Han Solo is taking a long time in that shower. C-3PO: Oh i understand Sir.","\"Take a holo, it\u0027ll last longer, Goldie.\"","C-3PO: Is he awake? I can\u0027t tell. R2-D2: *Beep* C-3PO: You want me to do what to him? Boba fett: Yeah, want do you want him to do to me?","Boba:I swear to God, If you don\u0027t stop starring at me I\u0027ll blow your freaking head off. C-3PO:Somebody forgot their coffee this morning... Boba:(Muffled agreement)","I cross my arms every change I get, it makes me look more baaaaaad","Fett: Okay, which one of you flatfoots stole my candybar?","c3po-oh my goodness i cant believe we are in the presence of THE BOBA FETT r2d2-(in human voice cuzz we cant understand robot)be quite c3po im trying to get my recording system to work so i can video tape this amazing moment Boba Fett-would you tou stop talking maybe youll be easier too fool then i thought stupid droids no wheres luke? my flamethrowers getting cold ha ha haaa","Boba: Does this out outfit make my butt look big?","Boba: I\u0027m a barbie girl, in a barbie world, life in plastic, it\u0027s fantastic! 3PO: I prefer life in metal myself.","Hmph. My first impression on the world of Star Wars, and I look like I\u0027ve been colored in with the last five crayons that nobody wanted to use.","3PO: please daddy, can i keep him please? I promise to take care of him this time! Fett: Son raising a Wookie is a big responsibility and i just don\u0027t know if your ready.","jeeesh! and I thought football uniforms were bad...","Boba: Face it, guys. I\u0027m the only good thing that\u0027s coming out of this Holiday Special.","Boba: I ordered these Wookie braids three months ago! I\u0027m glad they\u0027re finally here! C-3PO: Actually, Sir. That is Chewbacca.","Boba:What are you stareing at metalhead? C-3PO:A grown man wearing his underwear on the outside of his pants.","CPO: Oops? R2-D2: beeps Fett: Oops is right, I told you to always Walk the wookie after every meal!","C3PO: No Boba, the sign clearly says \"please don\u0027t feed the animals\"","Boba: *sigh* I\u0027m Boba Fett and I have a gambling problem. Everyone: Hi Boba.","C3PO: Chewbacca, I don\u0027t believe this starring contest is going to work.","C3PO: I suggest a new strategy, Master Fett. Let the Wookiee win. Boba Fett: *Incoherent mumbling*","After finally apprehending the one responsible for releasing his private dance video-gone-wrong all over the HoloNet, Boba contemplates how a couple new Wookiee-hair braids would complement his armor.","C-3PO: Boba, I\u0027m sorry, I just dont see how your still single. Boba: Just go away...","3PO: Sir, I can\u0027t help but notice that your balls are on your hip? Boba: Zip it 3PO, have you ever been dry humped by a wookie?","Fett: I hate fans. They always draw me so CRAPPY! Look at the the details I\u0027m missing! I\u0027m not even coloured right! C3PO: I look like a cheap bendy-toy thats unauthorized.... R2D2: Beep bloop (Hey, at least you guys don\u0027t only have the top of your head in this!)","Boba Fett resents the implication that he is a two-dimensional character.","Boba:I hate this 70\u0027S look. C3P0:Quit whining Fett! Boba:Shut up Goldylocks!!!","\"Turn, turn...*tsk* No, that fur and bandolier combo is just not working for me.\"","the wookie strippers are only here on thursdays my friend","Fett: You call this a CLEAN floor?! I\u0027ve seen better in Hutt palaces!","Boba was never quite the same after working for an afternoon on the Miami Vice set...","Introducing Boba Fett, winner of this year\u0027s Miss Mandalore\u0027s Beauty Pagent!","Fett. It means looking cool... even when you get caught in your underarmour.","\"No 3po, I will NOT grease up your crevasses!\"","Boba:I hate this look...Its so 70\u0027S.","3P0: \"Congratulations, Mr. Fett! You\u0027re a father now!\" Boba (thinking): \"Damn! I knew that Aurra Sing was trouble! Okay... Try to look cool for the camera...\" 3P0: \"It\u0027s a boy!\" Boba: \"He\u0027s worth a lot to me...\"","Boba, thinking: \"Man, even in this crappy, washed-out, 1970\u0027s holiday special I still am one bad@$$ bounty hunter...\"","C3PO: Why so angery? Fett: Damn Lucas said he\u0027d only give me better colored armor if he wrote a stupid death scene for me......","Fett: I don\u0027t know why Jabba gave him to me.","Boba Fett\u0027s armor proved that Sarlacc stomach acid can be used as a bleach.","No, YOU put Captain Solo in the cargo hold!","Just look at our colors....honestly, have ANY of these guys heard of reference photos? This is as bad as bringing in the wrong person for a bounty....","Boba: Crap, someone spilled coffee on my frame. Threepio, clean it up! C-3PO: Sir, I\u0027m only an interpreter! Besides, it\u0027s in pretty deep! Boba: Do it or I\u0027ll feed you to Chewbacca. C-3PO: But...uhhh, I\u0027ll give you the address of who spilled the coffee. Boba: I\u0027m going to another frame. If you get it out tell me. Chewie, look hungry.","Fett: Y\u0027know, I may be a badass bounty hunter who doesn\u0027t fear death or a Sarlaac Pit, but even I can\u0027t stand this awful 1970\u0027s animation special.","c3po:Hello but aren\u0027t yu a bad guy yu know shooting good dudes with the rifle boba:no i just came here to use the computer c3po:why? boba:because i love WORLD OF WRACRAFT when jabbas gone i can hunt guys on there with player versus player","c3po:What are yuo doing on are millenium falcon boba:i lost the slave 1 to greedo it was horrible so i need a home c3po:Just take your shoes off i just waxed the floor.","C3PO: Get in the corner for a time out MR. You know the rule, no bounty hunting after bed time! Boba: You suck.","C-3PO: for some reason, when I look at Boba, I feel like i should be telling him to \"release my people\" like in that movie with Charlton Heston...","Fett: Hold it right there, everyone. I have an important announcement to make. C-3P0: What\u0027s that? Chewbacca: Ruuuur? Fett: I only have three fingers on each hand.","Fett: Now, Chewbacca, repeat after me. IN BASIC: I love Boba Fett. Chewie: Ruur uuuuur rrur urur. Fett: Damn, this is hard!","Fett: OMG, Wrath of the Mandalorian was better animated than this, and it was fan-made!","CP30: Is it me or do my sensors detect burnt womp rat? Boba: One of the benefits of a flamethrower: BBQ anytime.","Boba: And there you have it, kids. Now you see what can happen to you when you do drugs.","Boba: \"...and You\u0027re both getting paid how much!.., hmm..I\u0027d better look for another agent.\"","C3P0: What\u0027s the matter Fett, cat got your mask? BOBA: Damn droids.","Fett: What? Don\u0027t look at me, I didn\u0027t steal his Wookiee braids","Do I look even more bad ass folding my arms or not?","C-3PO: Oh, hello master Boba, i am C-3PO, human cyb-- Luke: There\u0027s no one in it... It is just a costume, Boba\u0027s getting a new outfit. C-3PO: Oh..","Fett: Your going to wear that?","Throw a pink highlight here and there and you will be all set","I am not the Mandalore you are looking for.","Boba: If you continue to piss me off, I\u0027ll have to take extreme measures......... C-3P0: What?! How can you? You\u0027re a cartoon! Boba: Oh, I thought I was the real Boba. Walks away..... C-3P0: And those weapons are too! Boba: Blah! Blah! Blah!","my god, look at the quality of my shading. some artists just don\u0027t care do they?","boba-Ill give you 5 seconds to give me back my doll. chew-translated-o no boba its my turn to play. 3po-no its my turn. boba-give it before i disintegrate you.","Boba: Heyyyyyyyyy! Nice ammo belt, Chewie! Damn it! I wish I were a wookie, then again, I have my honour, dignity and reputation.......unlike you!","\"Alright you punks, where\u0027s the bathroom?\"","3po:hello Iam c-3p0 human cyborg relations. boba: I don`t care you stupid droid lookin` for solo seen em` ? 3p0:no sir I hav...(solo walks in ) boba:why it`s solo \u0026 the walking carpet chewbacca. chewy:errrrrrrrggggggggggooooottt boba:die (fires wrist rocket)shoooomm blam!!!!!!!!!!!!!!!!!!!!!!!","\"Yup, that\u0027s a--that\u0027s a Wookiee alright. But, I asked for an Ewok.\"","*Sigh* \"Yeah, the Wookiee will bring a high enough bounty, but...the value of gold metal, particularly for droids, has gone up lately.\"","BOBA~So I told him \"of course I have priviledges above others, Im Figgin BOBA FETT. C3PO~ So what did he say to that...? BOBA~ Uh...I don\u0027t know... I kinda vaporized him before that... C3PO~oh...","fett:*mutters*yeah, its gonna b a gig at a club, yeah, stupid vader \u0026 his little security jobs... HEY! WHAT\u0027RE U LOOKIN\u0027 AT???","*Begins to breakdance and sing, \"Cant\u0027t touch this! Da dadda doo. Da doo, can\u0027t touch this!\"","boba-thats right 3po Im dating britney spears and its awesome. 3po-so im dating jabba. boba-what your gay? 3po-maybe...","does this look infected to you?","I\u0027m sorry. If you don\u0027t have a backstage pass you can\u0027t come in to see AC/Wookiee...","No, just because my junk looks strappingly huge the way I accentuate it, doesn\u0027t mean I am into gay golden robots. Who\u0027s your little friend?","\"3PO! what did I tould you about teasing your brother R2?\"","Bobafett: Im going to kill you! Luke: No please don\u0027t! Bobafett: But I really want to! Luke:No please don\u0027t you don\u0027t need to anyway! Bobafett: Yeah I know but im going to anyway. Luke:No please don\u0027t Bobafett:Bye luke just letyou know I didn\u0027t get ordered to do this I just was bored and your not evil so I have to kill you bye.","3po:hello. im c3po, and id love to help u in any way possible... fett:uh, ok fruitcake, how \u0027bout u leave me alone? 3po:if i could cry i would be bawling right now! (runs off) fett:oh thank God","Vador: Bobafett I need you to go kill Luke Skywalker! Bobafett: Why vador? Vador: Bobafett I want you to kill him just because he\u0027s not evil! Bobafett: I don\u0027t really feel like it right now. Vador: I comand you to do it this instant!!!! Bobafett: NO I DON\u0027T FEEL LIKE IT !!!!!!!! Vador: If you do it I will let you destroy what ever you want............ Bobafett: Ok I will do it. Vador: Ok now heres your carbon rifle and now go kill Luke!!!!! Bobafett: Oh .......... Yeah its killin time now.","C-3PO \u003d\u003e Thats some mighty big cans of deodorant you have for the wookie mister Fett sir.","3po:my sensors indicate that u r very depressed. Boba:WHAT DO U THINK? I LOST MY GIRLFRIEND, I\u0027M HAVIN\u0027 TROUBLE W/ THE RENT, \u0026 NOW THIS WOOKIE IS SHAKING IT \u0027S FRICKEN BUTT AT ME!","Boba:look at that city slicker with his fur coat and big black shades. 3po:that\u0027s a tawn-tawn... Boba:i still don\u0027t like him!","C3P0:u know u don\u0027t look cool doing that Boba: yes, well... SHUT UP!","Sorry, no oversized, hairy, stinky flea-bitten, retarded bears allowed.","Yipes!!! You are bigger in Person","Boba is playing rock paper scissors with chewie........ Boba: Rock..paper..scissors! Chewie: Euueeerr? Boba: You know.....we were playing rock paper scissors? Chewie: Urrrrrrrgh!! Boba: Fine then! I\u0027ll play on my own, you furry gasket! Chewie: Ur-ROARGH!!! Boba: shut up!............ Stonps angrily away.","3PO: Excuse me, but are you the Maker? I can\u0027t seem to remember... Boba: Deal with it. We all have father issues.","Boba, the idol of cool.","Bobafett:you know guys, i really appreciate the fact that you trust me. C-3po:we dont, your just some mandalorian working for the empire persuading luke to trust you, we hate you. Bobafett: so in a sense, im lame? C-3po: no, just because i dont trust doesnt mean i dont look up to you. Fett: Sweet! i knew i was the baddest of bad!","I could have swore that last time I checked my armor was more of a green..Must be going color blind...","boba-hmph its not fair u won at monopoly 3po. 3po-i cheated boba-what you say pervert! 3po-yo mama so stupid she fell in the sarlacc! boba-i never had a mother you $#@! c-3po- rite back at ya!!!!!!!!!!!! boba thinking- i wonder if i could...nah but still...","C-3PO: Is that you my love? Fett: Don\u0027t bother me. It\u0027s Vader you want.","To the editor of the show ) Boba: Ummmmm, excuse me? Where\u0027s my jetpack? I need it for drastic measures and YOU FORGOT IT! Runs away crying....","Boba: it seems my schedule for this clip has already been taken.. Others: ???? Boba: I\u0027ll see you at KFC, Luke. Flys off..........","Boba: \"What are you looking at, fuzzball?\"","C3PO: Are you accusing me of tampering with the methane tanks? Fett: You sure don\u0027t smell like roses. R2D2: Beep beep bop beep C3PO: How dare you accuse me of practical jokes, I\u0027m not programmed for that sort of thing.","Boba: \"Ok. Seriously, whoever took a bite out of the last doughnut and put it back is going to deal with me.\"","Boba: See if i fold my arms like so, I look cool. C-3PO: I\u0027m a walking piece of bling is that enough?","Boba: Aargh! I hate it when I\u0027m poorly animated. C-3PO: Well at least they didn\u0027t put some weird nose thing on you and give you giant hips!","Jango: Hey, what the - Is that small droid looking at my groin?","Jongo - Yeah, i\u0027m cool, and you know it. Thats right, admire the armour...","C3PO: Hello, my name is C3PO. I am a protocol droid, and I speak over 7 million--- Fett: Shut it before I fry your circuits.","*Boba thinking* I wonder how much the fans would pay me to take that annoying droid out...","I clearly called dibbs first for the Wookiee\u0027s piggy back ride.","\"Arrrrrrrgh.\" \"Chewbacca! That\u0027s nothing nice to say about our guest!\" \"Shut up, droid.\"","BOBA FETT: your Jealous because im a fn hard ass who can whip cord u in a second . C3PO: WEll u know ive never though of it that way BOBA FETT: And just out of curiosity do u ever blink"],["Author","Bn Moss","Frank","Fett II","Darran Fett","Bobafett","virulent_messiah","The_Fett","Clone Commander Tyler","Jeremy Schultz","Merf","vinny","ittwooyoyuknow","Ittwooyouknow","Jeezus","Luc","Tohmia","Bryan Thompson","Woton","Clone Commander Tyler","Tshanna Fett","Gustavo_Perez (Ova Frett)","GearFett","fairyblood","Slovok","FettFan","adam","Wass","Cecilia","samyania","GLOPINO","FettFan","dntshoot","Neomeris Fett","Hav.","Fett II","Havlock","Robert","GLOPINO","Jodo Kast of Keystone City","Jodo Kast of Keystone City","Ralin Drakus of Keldabe, Mandalore","judi johns of victoria","Adeptus Astartes of Denial","Slovok of McAllen, TX","Pheonix","The Fettinator of Jango\u0027s house on Kamino","Felina of Gaithersburg, MD","travis of columbus,ohio","Travis of columbus,Ohio","Ethan of Michigan","Mando Girl","Fett II of Tatooine","Marcus Starwind of Mandalore","Chibisnake of Parkland, FL","Frankie of Waterloo NY","Zack of Oregon","jeffjester of Victoria, Australia","GLOPINO of Wilkes Barre/PA","Slovok of McAllen/TX","imkrk of EG","Masterchief of UK","Anonymous","Sam Lennon of South Portland ME","Tracyn of norwich","Masterchief of UK","anon","","Masterchief of UK","Fett II of Kashyyyk","Hayden lewicki of bay city,michigan","FettFan of Pana, IL","FettFan of Pana, IL","KetForFett","Bambi of Philly","A Ninjatrooper of Imperial Ninja Academy, CA","george bjon","matt of palmyra, NY","Sev Fett of Canada","Grim Raven of Delaware, OH","DanDBC","Alyse of Florida","glutius maximus of uranus","Alyse Kennedy of Florida","Karnorjax of Corsham UK","Bambi of Philly","Zee of Philly","glutius maximus of uranus","Jack Lively of Kent","bats of soth West rocks","Masterchief of UK","helas of riverside, california","Fett II of Pwnsville","Antonio Rocha of Olathe,Kansas","Adeptus Astartes of BFFC message boards","Anonymous","Enforcer of California","Masterchief of UK","Masterchief of UK","Fett II of Pwnsville","Fett Claw","Mikhail","Cujo of Twilight Zone, CA","Mordred of Oklahoma","Hellknight","Anonymous","Venku of Keldabe, Mandalore","amanda of corusant","Brent of Lincoln/Nebraska","Fett II of Pwnsville, NY","jake Crawford of kansas"],["Date","137594520008/08/2013","121964760008/25/2008","121956120008/24/2008","121956120008/24/2008","121912920008/19/2008","121887000008/16/2008","121878360008/15/2008","121878360008/15/2008","121861080008/13/2008","121809240008/07/2008","121791960008/05/2008","121791960008/05/2008","121791960008/05/2008","121774680008/03/2008","121766040008/02/2008","121731480007/29/2008","121705560007/26/2008","121679640007/23/2008","121645080007/19/2008","121610520007/15/2008","121575960007/11/2008","121567320007/10/2008","121567320007/10/2008","121567320007/10/2008","121550040007/08/2008","121472280006/29/2008","121472280006/29/2008","121463640006/28/2008","121446360006/26/2008","121446360006/26/2008","121394520006/20/2008","121385880006/19/2008","121377240006/18/2008","121368600006/17/2008","121325400006/12/2008","121316760006/11/2008","121282200006/07/2008","121221720005/31/2008","121118040005/19/2008","121118040005/19/2008","121109400005/18/2008","121109400005/18/2008","121109400005/18/2008","121023000005/08/2008","121005720005/06/2008","120997080005/05/2008","120988440005/04/2008","120971160005/02/2008","120971160005/02/2008","120936600004/28/2008","120936600004/28/2008","120910680004/25/2008","120910680004/25/2008","120902040004/24/2008","120884760004/22/2008","120858840004/19/2008","120858840004/19/2008","120858840004/19/2008","120850200004/18/2008","120824280004/15/2008","120807000004/13/2008","120789720004/11/2008","120789720004/11/2008","120781080004/10/2008","120781080004/10/2008","120781080004/10/2008","120772440004/09/2008","120755160004/07/2008","120737880004/05/2008","120737880004/05/2008","120729240004/04/2008","120729240004/04/2008","120720600004/03/2008","120720600004/03/2008","120711960004/02/2008","120711960004/02/2008","120694680003/31/2008","120677400003/29/2008","120668760003/28/2008","120660120003/27/2008","120651480003/26/2008","120651480003/26/2008","120642840003/25/2008","120642840003/25/2008","120634200003/24/2008","120634200003/24/2008","120634200003/24/2008","120625560003/23/2008","120625560003/23/2008","120616920003/22/2008","120608280003/21/2008","120608280003/21/2008","120599640003/20/2008","120591000003/19/2008","120591000003/19/2008","120591000003/19/2008","120591000003/19/2008","120591000003/19/2008","120573720003/17/2008","120573720003/17/2008","120565080003/16/2008","120565080003/16/2008","120565080003/16/2008","120565080003/16/2008","120565080003/16/2008","120565080003/16/2008","120565080003/16/2008","120565080003/16/2008","120556440003/15/2008","120556440003/15/2008"],["Fan\u0027s Choice","0 Currently 0.00/1","0 Currently 0.00/1","0 Currently 0.00/1","0 Currently 0.00/1","0 Currently 0.00/1","0 Currently 0.00/1","0 Currently 0.00/1","0 Currently 0.00/1","0 Currently 0.00/1","0 Currently 0.00/1","0 Currently 0.00/1","0 Currently 0.00/1","0 Currently 0.00/1","1 Currently 1.00/1 1 vote","0 Currently 0.00/1","0 Currently 0.00/1","0 Currently 0.00/1","0 Currently 0.00/1","0 Currently 0.00/1","0 Currently 0.00/1","0 Currently 0.00/1","0 Currently 0.00/1","0 Currently 0.00/1","0 Currently 0.00/1","0 Currently 0.00/1","0 Currently 0.00/1","0 Currently 0.00/1","0 Currently 0.00/1","0 Currently 0.00/1","0 Currently 0.00/1","0 Currently 0.00/1","0 Currently 0.00/1","0 Currently 0.00/1","0 Currently 0.00/1","0 Currently 0.00/1","0 Currently 0.00/1","0 Currently 0.00/1","0 Currently 0.00/1","0 Currently 0.00/1","0 Currently 0.00/1","0 Currently 0.00/1","0 Currently 0.00/1","1 Currently 1.00/1 1 vote","1 Currently 1.00/1 1 vote","0 Currently 0.00/1","0 Currently 0.00/1","0 Currently 0.00/1","0 Currently 0.00/1","0 Currently 0.00/1","0 Currently 0.00/1","0 Currently 0.00/1","0 Currently 0.00/1","0 Currently 0.00/1","0 Currently 0.00/1","0 Currently 0.00/1","0 Currently 0.00/1","0 Currently 0.00/1","0 Currently 0.00/1","0 Currently 0.00/1","0 Currently 0.00/1","0 Currently 0.00/1","0 Currently 0.00/1","0 Currently 0.00/1","0 Currently 0.00/1","0 Currently 0.00/1","0 Currently 0.00/1","0 Currently 0.00/1","0 Currently 0.00/1","0 Currently 0.00/1","0 Currently 0.00/1","0 Currently 0.00/1","0 Currently 0.00/1","0 Currently 0.00/1","0 Currently 0.00/1","0 Currently 0.00/1","0 Currently 0.00/1","0 Currently 0.00/1","0 Currently 0.00/1","0 Currently 0.00/1","1 Currently 1.00/1 1 vote","0 Currently 0.00/1","0 Currently 0.00/1","0 Currently 0.00/1","0 Currently 0.00/1","0 Currently 0.00/1","0 Currently 0.00/1","0 Currently 0.00/1","0 Currently 0.00/1","0 Currently 0.00/1","0 Currently 0.00/1","0 Currently 0.00/1","0 Currently 0.00/1","0 Currently 0.00/1","0 Currently 0.00/1","0 Currently 0.00/1","0 Currently 0.00/1","0 Currently 0.00/1","0 Currently 0.00/1","0 Currently 0.00/1","0 Currently 0.00/1","0 Currently 0.00/1","0 Currently 0.00/1","0 Currently 0.00/1","0 Currently 0.00/1","0 Currently 0.00/1","0 Currently 0.00/1","0 Currently 0.00/1","0 Currently 0.00/1","0 Currently 0.00/1","0 Currently 0.00/1"]],"pageTitle":"Boba Fett Caption Contest - Humor - Boba Fett Fan Club","title":"","url":"http://www.bobafettfanclub.com/humor/caption/16/page/5/id","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"RELATION","tableNum":0,"s3Link":"common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986423.95/warc/CC-MAIN-20150728002306-00006-ip-10-236-191-2.ec2.internal.warc.gz","recordEndOffset":343571623,"recordOffset":343541561,"tableOrientation":"HORIZONTAL","textBeforeTable":"--\u003e Place + Name + | Picks + | ID - | Sort: * Required Privacy: e-mail addresses are only used for optional notification and/or correspondence. Addresses are not used for any other purpose. See our Privacy Policy. Your Comment * City (optional) E-Mail * Name * Add a Caption --\u003e }); $(\"#marginForm\").validate(); // validate the comment form when it is submitted $().ready(function() { Please Note Caption contributions are subject to review or deletion without notice. Posting is moderated and therefore not in real-time for the benefit of being appropriate for our audience. Kids, all fart jokes are ignored. Creative captions get a star.","textAfterTable":"↓ BFFC Recommends ↓ Pre-Order the New Play Arts Kai Boba Fett and Other Star Wars Toys ↑ Only recommended Boba Fett and Star Wars merchant links seen here. Learn more about our ad policy. ↑ Get BobaFett.com E-mail Updates Breaking news, original content, and cool contests. Informative. Awesome. Infrequent. Data is not rented, shared, or sold. Home Already a BFFC member? Login","hasKeyColumn":true,"keyColumnIndex":2,"headerRowIndex":0}