{"relation":[["Sequence","A*0126","A*2450","A*2627","A*3117"],["Cell Identification","NT00736","BY00179","BY00173","Xian28632"],["Accession Number","EF591033","EF591031","EF591027","EF602748"],["Submitting Author","Carolyn K Hurley, Washington, USA","Carolyn K Hurley, Washington, USA","Carolyn K Hurley, Washington, USA","Mengli Liu, Xi\u0027an, China"]],"pageTitle":"HLA Nomenclature @ hla.alleles.org","title":"","url":"http://hla.alleles.org/nomenclature/updates/200705.html","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"RELATION","tableNum":1,"s3Link":"common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992543.60/warc/CC-MAIN-20150728002312-00097-ip-10-236-191-2.ec2.internal.warc.gz","recordEndOffset":110988335,"recordOffset":110980133,"tableOrientation":"HORIZONTAL","TableContextTimeStampBeforeTable":"{1442\u003dThe following sequences have been submitted to the Nomenclature Committee since the April 2007 nomenclature update and, following agreed policy, have been assigned official allele designations. Full details of all sequences will be published in a forthcoming report., 2805\u003d| Contact Us | Copyright © Anthony Nolan Research Institute | Last Updated: 4-12-2013 |}","lastModified":"Fri, 17 Jan 2014 11:10:06 GMT","textBeforeTable":"Table 1: New Sequences All new and confirmatory sequences should now be submitted directly to the WHO Nomenclature Committee for Factors of the HLA System via the IMGT/HLA Database using the sequence submission tool provided. The IMGT/HLA Database may be accessed via the world wide web at : http://www.ebi.ac.uk/imgt/hla/. Below are listed the newly assigned sequences (Table 1) and confirmations of previously reported sequences (Table 2). The accession number of each sequence is given and these can be used to retrieve the sequence files from either the EMBL, GenBank or DDBJ data libraries. Although accession numbers have been assigned by the data libraries and most sequences are already available, there is still the possibility that an author may not yet have allowed the sequence to be released, in such a case you will have to contact the submitting author directly. Additional information pertaining to new sequences is often included in the publications describing these alleles, a listing of recent publications which describe new HLA sequences is given in Table 3. The following sequences have been submitted to the Nomenclature Committee since the April 2007 nomenclature update and, following agreed policy, have been assigned official allele designations. Full details of all sequences will be published in a forthcoming report. International Journal of Immunogenetics. 2007 34:395-6 Human Immunology. 2007 68:800-1 Tissue Antigens. 2007 70:263-4 Published In: Compiled by Steven G. E. Marsh for the WHO Nomenclature Committee for Factors of the HLA System.","textAfterTable":"A*2478 2004307seq AB303946 Hidetoshi Inoko, Isehara, Japan A*3312 BY00180 EF591032 Carolyn K Hurley, Washington, USA A*9221 SCCA-1 EF534104 Maggie Sprague, Seattle, USA A*9221 B8972 EF632301 Lixing Yan, Hangzhou, China A*9222 BY00178 EF591030 Carolyn K Hurley, Washington, USA A*9223 BY00176 EF591028 Carolyn K Hurley, Washington, USA A*9224 SCU00927 EF579799 Francisco de Paula Sanchez Gordo, Malaga, Spain A*9225N 06d05372 AM711559 Jacqy Anholts, Leiden, The Netherlands A*9226 2001238PD AB303947 Hidetoshi Inoko, Isehara, Japan B*070205 D22669 AM493903 Odile Avinens, Montpellier, France B*0757 DJEGen AM689936 Anne Dormoy, Strasbourg, France B*3577 DCI-002 EF620032 Sallyanne Fossey, Nashville, USA B*4817 K13577, K13578 AB292739 Etsuko Maruya, Kyoto, Japan B*4818 2006032CB, 2006032mother AB303948 Hidetoshi Inoko, Isehara, Japan B*510203 B16573 EF611989 Lixing Yan, Hangzhou, China B*5713 MHHN-414997 AM712179 Rainer Blasczyk, Hannover, Germany B*9530 RA1242 EF622511 Min Yu, Chicago, USA B*9531 147351 AM712922 Francesca Poli, Milano, Italy B*9532 DCI-001 EF620033 Sallyanne Fossey, Nashville, USA Cw*0119 HanChineseA78 EF189140 Lin Ding, Guangzhou, China G*010111 HLAG005 EF565823 Erick Castelli, Ribeirao Preto, Sao Paulo, Brazil G*010112 JKKB-55","hasKeyColumn":true,"keyColumnIndex":3,"headerRowIndex":0}