{"relation":[["Summit","Buck Mountain","Cumberland Knob","Fisher Peak","Fulcher Mountain","Fulcher Mountain","Lens Knob","Long Branch Mountain","Pilot Mountain","Racoon Mountain","Raven Knob","Round Peak","Saddle Mountain","Skull Camp Mountain","Slate Mountain","Slate Mountain","Stott Knob","Turner Mountain","Warrior Mountain"],["Location","36°30′29″N 80°50′00″W﻿ / ﻿36.50806°N 80.83333°W﻿ / 36.50806; -80.83333","36°33′00″N 80°54′31″W﻿ / ﻿36.55000°N 80.90861°W﻿ / 36.55000; -80.90861","36°33′34″N 80°49′23″W﻿ / ﻿36.55944°N 80.82306°W﻿ / 36.55944; -80.82306","36°30′07″N 80°50′20″W﻿ / ﻿36.50194°N 80.83889°W﻿ / 36.50194; -80.83889","36°29′58″N 80°50′18″W﻿ / ﻿36.49944°N 80.83833°W﻿ / 36.49944; -80.83833","36°27′46″N 80°55′31″W﻿ / ﻿36.46278°N 80.92528°W﻿ / 36.46278; -80.92528","36°33′11″N 80°30′43″W﻿ / ﻿36.55306°N 80.51194°W﻿ / 36.55306; -80.51194","36°20′24″N 80°28′27″W﻿ / ﻿36.34000°N 80.47417°W﻿ / 36.34000; -80.47417","36°28′45″N 80°52′30″W﻿ / ﻿36.47917°N 80.87500°W﻿ / 36.47917; -80.87500","36°28′11″N 80°50′41″W﻿ / ﻿36.46972°N 80.84472°W﻿ / 36.46972; -80.84472","36°31′23″N 80°48′49″W﻿ / ﻿36.52306°N 80.81361°W﻿ / 36.52306; -80.81361","36°30′03″N 80°55′37″W﻿ / ﻿36.50083°N 80.92694°W﻿ / 36.50083; -80.92694","36°28′31″N 80°48′59″W﻿ / ﻿36.47528°N 80.81639°W﻿ / 36.47528; -80.81639","36°32′34″N 80°30′54″W﻿ / ﻿36.54278°N 80.51500°W﻿ / 36.54278; -80.51500","36°32′24″N 80°31′20″W﻿ / ﻿36.54000°N 80.52222°W﻿ / 36.54000; -80.52222","36°24′19″N 80°39′28″W﻿ / ﻿36.40528°N 80.65778°W﻿ / 36.40528; -80.65778","36°25′25″N 80°39′36″W﻿ / ﻿36.42361°N 80.66000°W﻿ / 36.42361; -80.66000","36°28′15″N 80°52′29″W﻿ / ﻿36.47083°N 80.87472°W﻿ / 36.47083; -80.87472"],["Elevation","1,768 ft (539 m).","2,858 ft (871 m).","3,570 ft (1,090 m).","1,831 ft (558 m).","1,762 ft (537 m).","2,175 ft (663 m).","1,631 ft (497 m).","2,421 ft (738 m).","2,152 ft (656 m).","1,896 ft (578 m).","2,077 ft (633 m).","3,294 ft (1,004 m).","2,044 ft (623 m).","1,988 ft (606 m).","1,952 ft (595 m).","1,552 ft (473 m).","1,601 ft (488 m).","1,958 ft (597 m)."]],"pageTitle":"Surry County, North Carolina - Wikipedia, the free encyclopedia","title":"","url":"https://en.wikipedia.org/wiki/Surry_County,_North_Carolina","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"RELATION","tableNum":2,"s3Link":"common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989043.35/warc/CC-MAIN-20150728002309-00287-ip-10-236-191-2.ec2.internal.warc.gz","recordEndOffset":875058327,"recordOffset":875026214,"tableOrientation":"HORIZONTAL","TableContextTimeStampAfterTable":"{13063\u003dIn 1777 parts of Surry County and Washington District (now Washington County, Tennessee) were combined to form Wilkes County. The first permanent courthouse was established at Richmond in 1779, what is now the modern-day Old Richmond Township in Forsyth County near Donnaha. However, in 1789 the eastern half of Surry County became Stokes County, thus making the Richmond site unusable for either county. In 1790, the county seat was moved to Rockford where it remained for over half a century. In 1850 the half of the county\u0027s remaining territory south of the Yadkin River became Yadkin County. The town of Dobson was established in 1853 to be the new county seat., 12593\u003dThe county was formed in 1771 from Rowan County. It was named for the county of Surrey in England, birthplace of William Tryon, Governor of North Carolina from 1765 to 1771., 57290\u003dSurry County is home to three local newspapers, the The Mount Airy News of Mount Airy, The Pilot in Pilot Mountain and The Tribune of Elkin. Additionally, the larger daily Winston-Salem Journal covers news and events in the county. One local newspaper, the The Messenger in Mount Airy, ceased operation in approximately 2011., 47102\u003dAs of the census[8] of 2000, there were 71,219 people, 28,408 households, and 20,482 families residing in the county. The population density was 133 people per square mile (51/km²). There were 31,033 housing units at an average density of 58 per square mile (22/km²). The racial makeup of the county was 90.40% White, 4.16% Black or African American, 0.23% Native American, 0.57% Asian, 0.04% Pacific Islander, 3.45% from other races, and 1.15% from two or more races. 6.49% of the population were Hispanic or Latino of any race., 5609\u003dSurry County is a county located in the U.S. state of North Carolina. As of the 2010 census, the population was 73,673.[1] Its county seat is Dobson,[2] and its largest city is Mount Airy., 73657\u003dThe United States Geographic Names Information System includes 68 populated places in Surry County. Four of these are the county\u0027s incorporated municipalities and seven are historical place names. Of the remaining 57, three have since been annexed by an existing city or town. Elkin Valley and North Elkin have long been part of the town of Elkin and the city of Mount Airy will complete in summer 2007 its annexation of the remaining portions of Hollyview Forest-Highland Park that remain outside of the city.[10] Additionally, the communities of Jenkinstown and Blevins Store frequently show up on county maps, although they are not officially classified as populated places by the GNIS.}","lastModified":"Thu, 30 Jul 2015 18:34:09 GMT","textBeforeTable":"Pilot Mountain Another notable peak in Surry County is Cumberland Knob, in the northwest corner of the county, which was the starting point of the construction of the Blue Ridge Parkway. The following table provides a list of some of the more prominent mountains of the county. Surry County is located both within the Piedmont region of central North Carolina and in the Appalachian Mountains region of western North Carolina. Most of the eastern two-thirds of the county lies within the Piedmont, a region of gently rolling hills and valleys. However, the Piedmont of Surry County also contains a small portion of the Sauratown Mountains; Surry County marks the western end of the Sauratown Mountain range. The western third of the county lies within the Blue Ridge Mountains, and they dominate the county\u0027s western horizon. The mountain passes (called \"gaps\" locally) are notorious for their occasional high winds, which can force automobiles and even large Eighteen wheeler trucks off the highways which lead through the passes. As a result, high wind advisories issued by the National Weather Service are not uncommon. The highest point in Surry County is Fisher Peak in","textAfterTable":"Rivers[edit] While there are many creeks and streams in Surry County, there are three recognized major rivers in the county, the Ararat, the Fisher, and the Mitchell. All three flow southward and are tributaries of the Yadkin River, which forms the southern border of Surry County. The Yadkin River is the northern component of the Pee Dee River which flows to the Atlantic Ocean near Georgetown, South Carolina. Ararat River Fisher River Mitchell River Yadkin River Adjacent counties[edit] Carroll County, Virginia - north Patrick County, Virginia - northeast Stokes County - east Forsyth County - southeast Yadkin County - south Wilkes County - southwest Alleghany County - northwest Grayson County, Virginia - north-northwest National protected area[edit] Blue Ridge Parkway (part) Demographics[edit]","hasKeyColumn":true,"keyColumnIndex":0,"headerRowIndex":0}