{"relation":[["Product","Muscle Milk RTD 17 Oz Chocolate","Muscle Milk RTD 17 Oz Strawberries \u0027n Creme","Muscle Milk RTD 17 Oz Banana Creme"],["Size","12 Pack","12 Pack","12 Pack"],["Retail","$55.95","$55.95","$55.95"],["Price","$33.95","$33.95","$33.95"],["Qty.","","",""],["","Save 39%","Save 39%","Save 39%"],["","In stock","In stock","In stock"]],"pageTitle":"CytoSport - Muscle Milk RTD 17 Oz Cookies n\u0027 Creme 12 Pack - Save 39%","title":"","url":"http://www.nutritionexpress.com/cytosport/ready-to-drinks+rtds/cytosport+muscle+milk+rtd+17+oz+cookies+n+creme+12+pack.aspx","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"RELATION","tableNum":3,"s3Link":"common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989043.35/warc/CC-MAIN-20150728002309-00206-ip-10-236-191-2.ec2.internal.warc.gz","recordEndOffset":628153799,"recordOffset":628135208,"tableOrientation":"HORIZONTAL","textBeforeTable":"All Muscle Milk RTD 17 Oz by CytoSport Write a Review 0 Reviews Customer Reviews for Muscle Milk RTD 17 Oz Contains ingredients derived from milk and soy. Warnings Gluten. Lactose. Does Not Contain Refrigerate after opening. Do not freeze. Storage Shake before using. Serve cold. Directions For Use Ingredients: Water, Calcium Sodium Caseinate, Milk Protein Isolate, Maltodextrin, Sunflower Oil, Canola Oil, Less than 1% of: Crystalline Fructose, Medium Chain Triglycerides, Dipotassium Phosphate, Natural and Artificial Flavors, Cellulose Gum and Gel, Whey Protein Concentrate, Magnesium Phosphate, Soy Lecithin, Potassium Chloride, Sodium Hexametaphosphate, Carrageenan, Tricalcium Phosphate, Acesulfame Potassium, Potassium Citrate, Ascorbic Acid, Ferric Pyrophosphate, Sodium Phosphate, Dicalcium Phosphate, Sucralose, dl-Alpha Tocopheryl Acetate, d-Calcium Pantothenate, Niacinamide, Zinc Oxide, Copper Gluconate, Vitamin A Palmitate, Pyridoxine Hydrochloride, Thiamine Mononitrate, Riboflavin, Chromium Chloride, Folic Acid, Biotin, Potassium Iodide, Cholecalciferol, Cyanocobalamin. Percent Daily Values are based on a 2,000 calorie diet. Your daily values may be higher or lower depending on your calorie needs. 80%   Chromium 35%","textAfterTable":"17 Ounces (500ml) Contains: Protein 32g Carbs 13g Fat 16g Calories 320 and more Servings: 12 Serving Price: $2.83 Protein Sources: Milk, Whey Sweeteners: Fructose, Acesulfame-k, Sucralose All flavors of Muscle Milk RTD 17 Oz 12 Pack Your Price $33.95 Chocolate Strawberries","hasKeyColumn":true,"keyColumnIndex":0,"headerRowIndex":0}