{"relation":[["Address","3000 Webster Point Rd NE","8750 Sand Point Wy NE","2369 Fairview Ave E #1","4516 55th Ave NE","302 Lakeside Ave S #301","13207 11th Place NW","920 Lakeside Ave S","2700 Boyer Ave E #B"],["City","Seattle","Seattle","Seattle","Seattle","Seattle","Seattle","Seattle","Seattle"],["Price","$3,300,000","$3,232,500","$3,000,000","$2,485,000","$2,315,000","$2,185,000","$2,138,000","$2,025,000"],["Beds","5","5","2","4","2","5","3","2"],["Baths","4.25","4.5","1.75","3.25","2.5","5.25","1.75","1.75"],["Sq Ft","5,520","6,200","2,885","3,710","2,781","8,540","3,090","2,216"]],"pageTitle":"Seattle Shorelines Rising: Waterfront Home Sales Up 28.9% For 2012 - Seattle Waterfront Homes","title":"","url":"http://blog.seattlepi.com/seattlewaterfronthomes/2013/01/02/seattle-shorelines-rising-waterfront-home-sale-up-28-9-for-2012/","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"RELATION","tableNum":0,"s3Link":"common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986423.95/warc/CC-MAIN-20150728002306-00167-ip-10-236-191-2.ec2.internal.warc.gz","recordEndOffset":33152635,"recordOffset":33130055,"tableOrientation":"HORIZONTAL","TableContextTimeStampAfterTable":"{9838\u003dThere were 863 waterfront homes sold in King County in 2012, up from 669 in 2011.  That 28.9 percent increase is an unmistakable trend in the right direction for waterfront real estate, which makes up a significant percentage of the luxury real estate in the greater Seattle area.  Waterfront homes account for 30 to 40 percent of the multi-million dollar homes sold in King County in any given year., 10900\u003dTop Waterfront Real Estate Sales in the city of Seattle, 2012, 8850\u003dHome sales in the greater Seattle market rose significantly in 2012, signalling strength in the luxury home market for the first time in over five years.  The increase in luxury sales fits well with the moderate price increases that we’ve seen across the entire market this past year.}","textBeforeTable":"Top Waterfront Real Estate Sales in the city of Seattle, 2012 The waterfront homes at the top end of the market also saw marked increases in sales.  Sales of waterfront homes over $1 million increased 6.25 percent for the year, while multi-million dollar sales were up 20.5% percent over the same period.  The top King County sale for the year was an estate known as “Harmony at Proctor Lane” in Mercer Island.  The nearly 3-acre estate has 324 feet of Lake Washington shoreline and sold for $21.625 million.  Sales in the city of Seattle topped out at $3.3 million at Webster Point in Laurelhurst. There were 863 waterfront homes sold in King County in 2012, up from 669 in 2011.  That 28.9 percent increase is an unmistakable trend in the right direction for waterfront real estate, which makes up a significant percentage of the luxury real estate in the greater Seattle area.  Waterfront homes account for 30 to 40 percent of the multi-million dollar homes sold in King County in any given year. Home sales in the greater Seattle market rose significantly in 2012, signalling strength in the luxury home market for the first time in over five years.  The increase in luxury sales fits well with the moderate price increases that we’ve seen across the","textAfterTable":"© Seattle Homes, LLC: – Sam DeBord, Managing Broker, Realtor Coldwell Banker Seattle: Coldwell Banker Danforth \u0026 Associates Twitter | Facebook | LinkedIn | Google + | Sam (at) SeattleHome.com Categories: Seattle Waterfront Homes Print —","hasKeyColumn":true,"keyColumnIndex":0,"headerRowIndex":0}