{"relation":[["Commenced","2015","2014","2014","2014","2013","2013","2011","2011","2011","2011","2010","2007"],["Research Title / Program / Supervisor Type","Genomics and Pharmacogenomics of Stroke General Medicine, Faculty of Health and Medicine Principal Supervisor","Individual Patient Profiling in Stroke Recovery: Application of Advanced Neuroimaging Radiography, Faculty of Health and Medicine Co-Supervisor","International Comparison of Transient Ischaemic Attack Management and Output - Newcastle, Auckland, Oxford General Medicine, Faculty of Health and Medicine Principal Supervisor","Recovery from Stroke and Transient Ischemic Attack: The Role of Stress in Urban China and Australia General Medicine, Faculty of Health and Medicine Principal Supervisor","The Influence of Healthcare Pathways upon the Outcomes and Experiences of People with TIA or Minor Stroke: A Mulitmethod Approach Nursing, Faculty of Health and Medicine Co-Supervisor","Economic Evaluation of Stroke Interventions in Selected Hospitals in Australia Public Health, Faculty of Health and Medicine Principal Supervisor","Concussion in Professional Rugby League. What are the Potential Long- Term Consequences of Repetitive Concussive Blows General Medicine, Faculty of Health and Medicine Principal Supervisor","Whole-Brain CTP in Acute Ischemic Stroke General Medicine, Faculty of Health and Medicine Co-Supervisor","Fitness Training in Stroke Trial General Medicine, Faculty of Health and Medicine Co-Supervisor","Impediments to the Implementation of Thrombolytic Treatment in Acute Ischaemic Stroke Behavioural Science, Faculty of Health and Medicine Co-Supervisor","Making Clots and Breaking Clots: Modelling Arterial Occlusion to Test Stroke Sonothrombolysis Human Biology, Faculty of Health and Medicine Co-Supervisor","Characteristics of Sex-specific Differences in Cardiovascular Adaptation in the First 2 Years of Life Paediatrics, Faculty of Health and Medicine Principal Supervisor"]],"pageTitle":"Conjoint Professor Chris Levi / Staff Profile / The University of Newcastle, Australia","title":"","url":"http://www.newcastle.edu.au/profile/chris-levi?group\u003dq","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"RELATION","tableNum":425,"s3Link":"common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989043.35/warc/CC-MAIN-20150728002309-00208-ip-10-236-191-2.ec2.internal.warc.gz","recordEndOffset":607164499,"recordOffset":607071114,"tableOrientation":"HORIZONTAL","TableContextTimeStampBeforeTable":"{25106\u003dThe TNK Phase 3 Trial begins in Australia and New Zealand in February 2014 and in Europe and Asia in mid-2014., 24914\u003dFollowing his arrival at the University of Newcastle in 1999 to establish the Hunter Medical Research Institute (HMRI) Stroke Research Group, Professor Levi led the group to its current position, recognised globally as one of the leading teams for stroke research in imaging, clinical trials, health systems research and stroke genetics. Professor Levi is also the Director of the University of Newcastle\u0027s Priority Research Centre for Translational Neuroscience and Mental Health., 7272\u003dHis direct leadership and research activity is focused on the areas of clinical trials in acute stroke, stroke genetics, advanced acute imaging, and cluster randomised trials focusing on implementation of evidence-based stroke care. He founded the Australian Stroke Genetics Collaborative to conduct large scale national research into candidate genes to target for stroke prevention in the thrombolytic system. This research is supported by the award of a $1.3m NHMRC project grant. He has been a chief investigator and steering committee member on six NHMRC-funded randomised trials of stroke interventions over the past 10 years. He was principal investigator on the recently completed NHMRC-funded national multicentre phase 3 clinical trial Dextran In Carotid Endarterectomy (DICE), which concluded that the drug Dextran administered intravenously reduces embolic signals within three hours of carotid surgery. He was also chief investigator and steering committee member on the National Heart Foundation and NHMRC-funded acute stroke thrombolysis trial known as EPITHET (Echoplanar Imaging Thrombolytic Evaluation Trial) which evaluated the use of MRI scanning in patient selection for acute stroke treatment. A further recent study is evaluating the efficacy of a new generation “clot-busting” drug tenecteplase or TNK which looks likely to proceed to Phase 3 clinical trials. All this research, which has resulted in over 115 peer-reviewed publications in leading international journals, reflects Professor Levi’s goal of translating results into improved clinical practice. Professor Levi’s dedication to bridging the gap between research the real world is also reflected in his heavy community commitments including a five year administrative appointment as medical director of the National Stroke Foundation (NSF) and remains a member of the NSF Clinical Council. He sat on the NHMRC Project Grant Review Panels in 2008/2009 and will again sit in 2011., 20227\u003dAt the next stage, a Pre-hospital Acute Stroke Triage (PAST) program was introduced to both metropolitan and rural regions establishing systems to improve pre-hospital care and enhance access to clot-busting drugs. Techniques included bypass of smaller hospitals, helicopter transfer where needed, ambulance guidelines and cutting red tape. The system was introduced in the Hunter Region in 2007 and in 2013 was adopted across the state of New South Wales., 23170\u003dPublished in Nature Genetics in 2012, the discovery of the signal located within a regulatory DNA on Chromosome 6 (6p21.1) is strongly associated with large artery atherosclerotic stroke, which represent one quarter of acute strokes., 9185\u003dAs a conjoint academic under a full-time Area Health Service employment contract, the encroachment of clinical management responsibilities in to research time is significant. Time has had to be devoted to establishing research infrastructure and development of capacity within the Department of Neurology to undertake and sustain research activities. It is pertinent that at the time of appointment in 1998 there was no significant research program within the Department of Neurology and no activity whatsoever in the field of stroke research. With ten years of development and growth the Stroke Research Group now attracts regular competitive grant funding. Nationally and internationally recognised senior clinical researches along with research management, brain imaging and research nurse support staff., 5292\u003dResearch Expertise Clinical research across the domains of observational epidemiology (case control studies, cohort studies, prevalence and incident studies), interventional clinical trials (trials in antithrombotic therapy in stroke prevention, acute stroke therapy trials), health services work (cluster randomised trials of health services interventions, health service redesign), brain imaging research (neurovascular ultrasound particularly transcranial Doppler embolus protection, multi-module CT imaging and MRI brain imaging). Research activities have been spread approximately equally across the above domains with an emphasis on clinical trials and stroke imaging. Teaching Expertise Undergraduate Undergraduate teaching in the form of formal lectures, small group tutorials, bedside tutorials and one on one clinical teaching on clinical wards and outpatients clinics. Postgraduate Formal lectures, small group tutorials bedside tutorials and formal mentoring of FRACP candidates. Administrative Expertise Current Administrative Appointments \" Director, Priority Research Centre for Brain and Mental Health, University of Newcastle, Hunter Medical Research Institute with responsibility for oversight of the six programs of research within the centre. \" Director, Acute Stroke Services, John Hunter Hospital with responsibility for the operational management of the Acute Stroke Service including the Stroke Unit and acute stroke interventional team. \" Member, Clinical Council, National Stroke Foundation. Responsible for medical advice, medial liaison, Board presentations, strategic planning and policy directions setting for the national peak non-government organisation for stroke. Previous Admin Expertise \" Director of Operations Acute Hospital Network, Hunter New England Health, December 2005 March 2006. Responsible for operations of all acute hospitals across the Hunter New England Area Health Service. \" Chairman, Division of Medicine, John Hunter Hospital with responsibility for operational and strategic management of eight departments of Medicine across a tertiary referral hospital \" Co-Chairman Australasian Stroke Unit Network a sub-committee of the Stroke Society of Australasia. Responsible for coordination, policy and strategic planning for this national multidisciplinary professional grouping. Involved in the organisation of stroke care and rollout of stroke units. Collaborations Director of the Priority Centre for Brain \u0026 Mental Health Research, overseeing the Stroke Research Program along with programs investigating Schizophrenia, Affective and Addictive disorders, Pain, Development, Aging \u0026 Cognition and Translation \u0026 Models of Care in Mental Health. Stroke researcher with principle interests in brain vascular imaging, acute stroke therapies and stroke genetics. He leads the NHMRC funded Australian Stroke Genetics Collaborative, is also Principal Investigator on the recently completed NHMRC funded national multicentre phase III clinical trial Dextran In Carotid Endarterectomy (DICE), and Chief Investigator and Steering Committee member on the recently completed NHF and NHMRC funded MRI based acute stroke thrombolysis trial EPITHET. He is Chief Investigator on two current NHMRC funded acute stroke trials (IST3, 457343; Tenecteplase in acute ischaemic stroke, 510722) and the NHF funded Cerebral Hypothermia in Ischaemic Lesion (CHIL) trial. The past five years has seen increasing involvement in implementation and health systems research in stroke where he is CI on two current NHMRC project grants (353803, 510275) investigating novel models of enhanced stroke unit care and enhanced delivery of stroke thrombolysis. He is a Honorary Senior Research Fellow for Florey Neurosciences Institute (FNI), University of Melbourne and has strong and ongoing collaborations with FNI. His leadership of statewide and national stroke health services research project have led to the formation of collaborative networks across Australian academic stroke neurology. The overarching research effort in stroke is aimed at the discovery and translation of experimental stroke therapies into the clinical domain, the discovery of new genetic variants relevant to stroke occurrence and outcome, and the implementation of effective stroke therapies.}","TableContextTimeStampAfterTable":"{91438\u003dBackground: Intracranial pressure elevation, peaking three to seven post-stroke is well recognized following large strokes. Data following small-moderate stroke are limited. Therapeutic hypothermia improves outcome after cardiac arrest, is strongly neuroprotective in experimental stroke, and is under clinical trial in stroke. Hypothermia lowers elevated intracranial pressure; however, rebound intracranial pressure elevation and neurological deterioration may occur during rewarming. Hypotheses: (1) Intracranial pressure increases 24h after moderate and small strokes. (2) Short-duration hypothermia-rewarming, instituted before intracranial pressure elevation, prevents this 24h intracranial pressure elevation. Methods: Long-Evans rats with two hour middle cerebral artery occlusion or outbred Wistar rats with three hour middle cerebral artery occlusion had intracranial pressure measured at baseline and 24h. Wistars were randomized to 2Â·5h hypothermia (32Â·5Â°C) or normothermia, commencing 1h after stroke. Results: In Long-Evans rats (n\u003d5), intracranial pressure increased from 10Â·9Â±4Â·6mmHg at baseline to 32Â·4Â±11Â·4mmHg at 24h, infarct volume was 84Â·3Â±15Â·9mm3. In normothermic Wistars (n\u003d10), intracranial pressure increased from 6Â·7Â±2Â·3mmHg to 31Â·6Â±9Â·3mmHg, infarct volume was 31Â·3Â±18Â·4mm3. In hypothermia-treated Wistars (n\u003d10), 24h intracranial pressure did not increase (7Â·0Â±2Â·8mmHg, P\u003c0Â·001 vs. normothermia), and infarct volume was smaller (15Â·4Â±11Â·8mm3, P\u003c0Â·05). Conclusions: We saw major intracranial pressure elevation 24h after stroke in two rat strains, even after small strokes. Short-duration hypothermia prevented the intracranial pressure rise, an effect sustained for at least 18h after rewarming. The findings have potentially important implications for design of future clinical trials. Â© 2013 The Authors. International Journal of Stroke Â© 2013 World Stroke Organization., 22208\u003dObjectives: Concussion remains one of the inherent risks of participation in rugby league. While other injuries incurred by rugby league players have been well studied, less focus and attention has been directed towards concussion. Review method: The current review examined all articles published in English from 1900 up to June 2013 pertaining to concussion in rugby league players. Data sources: Publications were retrieved via six databases using the key search terms: rugby league, league, football; in combination with injury terms: athletic injuries, concussion, sports concussion, sports-related concussion, brain concussion, brain injury, brain injuries, mild traumatic brain injury, mTBI, traumatic brain injury, TBI, craniocerebral trauma, head injury and brain damage. Observational, cohort, correlational, cross-sectional and longitudinal studies were all included. Results: 199 rugby league injury publications were identified. 39 (20%) were related in some way to concussion. Of the 39 identified articles, 6 (15%) had the main aim of evaluating concussion, while the other 33 reported on concussion incidence as part of overall injury data analyses. Rugby league concussion incidence rates vary widely from 0.0 to 40.0/1000 playing hours, depending on the definition of injury (time loss vs no time loss). The incidence rates vary across match play versus training session, seasons (winter vs summer) and playing position (forwards vs backs). The ball carrier has been found to be at greater risk for injury than tacklers. Concussion accounts for 29% of all injuries associated with illegal play, but only 9% of injuries sustained in legal play. Conclusions: In comparison with other collision sports, research evaluating concussion in rugby league is limited. With such limited published rugby league data, there are many aspects of concussion that require attention, and future research may be directed towards these unanswered questions., 45463\u003dRationale: No evidence-based acute therapies exist for intracerebral hemorrhage. Intracerebral hemorrhage growth is an important determinant of patient outcome. Tranexamic acid is known to reduce hemorrhage in other conditions. Aim: The study aims to test the hypothesis that intracerebral hemorrhage patients selected with computed tomography angiography contrast extravasation \u0027spot sign\u0027 will have lower rates of hematoma growth when treated with intravenous tranexamic acid within 4Â·5-hours of stroke onset compared with placebo. Design: The Spot sign and Tranexamic acid On Preventing ICH growth - AUStralasia Trial is a multicenter, prospective, 1:1 randomized, double-blind, placebo-controlled, investigator-initiated, academic Phase II trial. Intracerebral hemorrhage patients fulfilling clinical criteria (e.g. Glasgow Coma Scale \u003e7, intracerebral hemorrhage volume \u003c70ml, no identified secondary cause of intracerebral hemorrhage, no thrombotic events within the previous 12 months, no planned surgery) and demonstrating contrast extravasation on computed tomography angiography will receive either intravenous tranexamic acid 1g 10-min bolus followed by 1g eight-hour infusion or placebo. A second computed tomography will be performed at 24 Â± 3 hours to evaluate intracerebral hemorrhage growth and patients followed up for three-months. Study outcomes: The primary outcome measure is presence of intracerebral hemorrhage growth by 24 Â± 3 hours, defined as either \u003e33% or \u003e6ml increase from baseline, and will be adjusted for baseline intracerebral hemorrhage volume. Secondary outcome measures include growth as a continuous measure, thromboembolic events, and the three-month modified Rankin Scale score. Discussion: This is the first trial to evaluate the efficacy of tranexamic acid in intracerebral hemorrhage patients selected based on an imaging biomarker of high likelihood of hematoma growth. The trial is registered as NCT01702636. Â© 2013 World Stroke Organization., 95597\u003dBackground: Our randomized controlled trial of a multifaceted evidence-based intervention for improving the inpatient management of fever, hyperglycemia, and swallowing dysfunction in the first three-days following stroke improved outcomes at 90 days by 15%. We designed a quantitative process evaluation to further explain and illuminate this finding. Methods: Blinded retrospective medical record audits were undertaken for patients from 19 stroke units prior to and following the implementation of three multidisciplinary evidence-based protocols (supported by team-building workshops, and site-based education and support) for the management of fever (temperature \u003d37Â·5Â°C), hyperglycemia (glucose \u003e11mmol/l), and swallowing dysfunction in intervention stroke units. Results: Data from 1804 patients (718 preintervention; 1086 postintervention) showed that significantly more patients admitted to hospitals allocated to the intervention group received care according to the fever (n\u003d186 of 603, 31% vs. n\u003d74 of 483, 15%, P\u003c0Â·001), hyperglycemia (n\u003d22 of 603, 3Â·7% vs. n\u003d3 of 483, 0Â·6%, P\u003d0Â·01), and swallowing dysfunction protocols (n\u003d241 of 603, 40% vs. n\u003d19 of 483, 4Â·0%, P\u003d0Â·001). Significantly more patients in these intervention stroke units received four-hourly temperature monitoring (n\u003d222 of 603, 37% vs. n\u003d90 of 483, 19%, P\u003c0Â·001) and six-hourly glucose monitoring (194 of 603, 32% vs. 46 of 483, 9Â·5%, P\u003c0Â·001) within 72 hours of admission to a stroke unit, and a swallowing screen (242 of 522, 46% vs. 24 of 350, 6Â·8%, P\u003d0Â·0001) within the first 24 hours of admission to hospital. There was no difference between the groups in the treatment of patients with fever with paracetamol (22 of 105, 21% vs. 38 of 131, 29%, P\u003d0Â·78) or their hyperglycemia with insulin (40 of 100, 40% vs. 17 of 57, 30%, P\u003d0Â·49). Interpretation: Our intervention resulted in better protocol adherence in intervention stroke units, which explains our main trial findings of improved patient 90-day outcomes. Although monitoring practices significantly improved, there was no difference between the groups in the treatment of fever and hyperglycemia following acute stroke. A significant link between improved treatment practices and improved outcomes would have explained further the success of our intervention, and we are still unable to explain definitively the large improvements in death and dependency found in the main trial results. One potential explanation is that improved monitoring may have led to better overall surveillance of deteriorating patients and faster initiation of treatments not measured as part of the main trial. Â© 2013 World Stroke Organization., 117892\u003dBackground: Many aspects of CSF dynamics are poorly understood due to the difficulties involved in quantification and visualization. In particular, there is debate surrounding the route of CSF drainage. Our aim was to quantify CSF flow, volume, and drainage route dynamics in vivo in young and aged spontaneously hypertensive rats (SHR) using a novel contrast-enhanced computed tomography (CT) method.Methods: ICP was recorded in young (2-5 months) and aged (16 months) SHR. Contrast was administered into the lateral ventricles bilaterally and sequential CT imaging was used to visualize the entire intracranial CSF system and CSF drainage routes. A customized contrast decay software module was used to quantify CSF flow at multiple locations.Results: ICP was significantly higher in aged rats than in young rats (11.52 Â± 2.36 mmHg, versus 7.04 Â± 2.89 mmHg, p \u003d 0.03). Contrast was observed throughout the entire intracranial CSF system and was seen to enter the spinal canal and cross the cribriform plate into the olfactory mucosa within 9.1 Â± 6.1 and 22.2 Â± 7.1 minutes, respectively. No contrast was observed adjacent to the sagittal sinus. There were no significant differences between young and aged rats in either contrast distribution times or CSF flow rates. Mean flow rates (combined young and aged) were 3.0 Â± 1.5 ÂµL/min at the cerebral aqueduct; 3.5 Â± 1.4 ÂµL/min at the 3rd ventric\u003d and 2.8 Â± 0.9 ÂµL/min at the 4th ventricle. Intracranial CSF volumes (and as percentage total brain volume) were 204 Â± 97 ÂµL (8.8 Â± 4.3%) in the young and 275 Â± 35 ÂµL (10.8 Â± 1.9%) in the aged animals (NS).Conclusions: We have demonstrated a contrast-enhanced CT technique for measuring and visualising CSF dynamics in vivo. These results indicate substantial drainage of CSF via spinal and olfactory routes, but there was little evidence of drainage via sagittal sinus arachnoid granulations in either young or aged animals. The data suggests that spinal and olfactory routes are the primary routes of CSF drainage and that sagittal sinus arachnoid granulations play a minor role, even in aged rats with higher ICP. Â© 2014 Murtha et al.; licensee BioMed Central Ltd., 9488\u003dBackground: Trials of endovascular therapy for ischemic stroke have produced variable results. We conducted this study to test whether more advanced imaging selection, recently developed devices, and earlier intervention improve outcomes. Methods: We randomly assigned patients with ischemic stroke who were receiving 0.9 mg of alteplase per kilogram of body weight less than 4.5 hours after the onset of ischemic stroke either to undergo endovascular thrombectomy with the Solitaire FR (Flow Restoration) stent retriever or to continue receiving alteplase alone. All the patients had occlusion of the internal carotid or middle cerebral artery and evidence of salvageable brain tissue and ischemic core of less than 70 ml on computed tomographic (CT) perfusion imaging. The coprimary outcomes were reperfusion at 24 hours and early neurologic improvement (.8-point reduction on the National Institutes of Health Stroke Scale or a score of 0 or 1 at day 3). Secondary outcomes included the functional score on the modified Rankin scale at 90 days. Results: The trial was stopped early because of efficacy after 70 patients had undergone randomization (35 patients in each group). The percentage of ischemic territory that had undergone reperfusion at 24 hours was greater in the endovascular-therapy group than in the alteplase-only group (median, 100% vs. 37%; P\u003c0.001). Endovascular therapy, initiated at a median of 210 minutes after the onset of stroke, increased early neurologic improvement at 3 days (80% vs. 37%, P \u003d 0.002) and improved the functional outcome at 90 days, with more patients achieving functional independence (score of 0 to 2 on the modified Rankin scale, 71% vs. 40%; P \u003d 0.01). There were no significant differences in rates of death or symptomatic intracerebral hemorrhage. Conclusions: In patients with ischemic stroke with a proximal cerebral arterial occlusion and salvageable tissue on CT perfusion imaging, early thrombectomy with the Solitaire FR stent retriever, as compared with alteplase alone, improved reperfusion, early neurologic recovery, and functional outcome. (Funded by the Australian National Health and Medical Research Council and others; EXTEND-IA ClinicalTrials.gov number, NCT01492725, and Australian New Zealand Clinical Trials Registry number, ACTRN12611000969965.), 569507\u003dFebruary 4, 2015, 65593\u003dBackground and Purpose: Magnetic resonance perfusion (MRP) and computed tomographic perfusion (CTP) are being increasingly applied in acute stroke trials and clinical practice, yet the comparability of their perfusion values is not well validated. The aim of this study was to validate the comparability of CTP and MRP measures. METHODS-: A 3-step approach was used. Step 1 was a derivation step, where we analyzed 45 patients with acute ischemic stroke who had both CTP and MRP performed within 2 hours of each other and within 9 hours of stroke onset. In this step, we derived the optimal perfusion map with the least difference between MRP and CTP. In step 2, the optimal map was validated on whole-brain perfusion data of 15 patients. Step 3 was to apply the optimal perfusion map to define cross-modality reperfusion from acute CTP to 24-hour MRP in 45 patients and, in turn, to assess how accurately this predicted 3-month clinical outcome. RESULTS-: Among 8 different perfusion maps included in this study, time to peak of the residual function (Tmax) was the only one with a nonsignificant difference between CTP and MRP in delineating perfusion defects. This was validated on whole-brain perfusion data, showing high concordance of Tmax between the 2 modalities (concordance correlation coefficient of Lin, \u003e0.91); the best concordance was at 6 s. At T max\u003e6 s threshold, MRP and CTP reached substantial agreement in mismatch classification (Â¿ \u003e0.61). Cross-modality reperfusion calculated by Tmax\u003e6 s strongly predicted good functional outcome at 3 months (area under the curve, 0.979; P\u003c0.05). CONCLUSIONS-: MRP and CTP can be used interchangeably if one uses Tmax measurement. Â© 2014 American Heart Association, Inc., 38719\u003dBackground: Stroke is a leading cause of death and disability internationally. One of the three effective interventions in the acute phase of stroke care is thrombolytic therapy with tissue plasminogen activator (tPA), if given within 4.5 hours of onset to appropriate cases of ischaemic stroke.Objectives: To test the effectiveness of a multi-component multidisciplinary collaborative approach compared to usual care as a strategy for increasing thrombolysis rates for all stroke patients at intervention hospitals, while maintaining accepted benchmarks for low rates of intracranial haemorrhage and high rates of functional outcomes for both groups at three months.Methods and design: A cluster randomised controlled trial of 20 hospitals across 3 Australian states with 2 groups: multi- component multidisciplinary collaborative intervention as the experimental group and usual care as the control group. The intervention is based on behavioural theory and analysis of the steps, roles and barriers relating to rapid assessment for thrombolysis eligibility; it involves a comprehensive range of strategies addressing individual-level and system-level change at each site. The primary outcome is the difference in tPA rates between the two groups post-intervention. The secondary outcome is the proportion of tPA treated patients in both groups with good functional outcomes (modified Rankin Score (mRS \u003c2) and the proportion with intracranial haemorrhage (mRS \u003d2), compared to international benchmarks.Discussion: TIPS will trial a comprehensive, multi-component and multidisciplinary collaborative approach to improving thrombolysis rates at multiple sites. The trial has the potential to identify methods for optimal care which can be implemented for stroke patients during the acute phase. Study findings will include barriers and solutions to effective thrombolysis implementation and trial outcomes will be published whether significant or not.Trial registration: Australian New Zealand Clinical Trials Registry: ACTRN12613000939796. Â© 2014 Paul et al.; licensee BioMed Central Ltd., 62320\u003dBACKGROUND AND PURPOSE-: Severe atherosclerosis in the aortic arch is associated with a high risk of recurrent vascular events, but the optimal antithrombotic strategy is unclear. METHODS-: This prospective randomized controlled, open-labeled trial, with blinded end point evaluation (PROBE design) tested superiority of aspirin 75 to 150 mg/d plus clopidogrel 75 mg/d (A+C) over warfarin therapy (international normalized ratio 2-3) in patients with ischemic stroke, transient ischemic attack, or peripheral embolism with plaque in the thoracic aorta \u003e4 mm and no other identified embolic source. The primary end point included cerebral infarction, myocardial infarction, peripheral embolism, vascular death, or intracranial hemorrhage. Follow-up visits occurred at 1 month and then every 4 months post randomization. RESULTS-: The trial was stopped after 349 patients were randomized during a period of 8 years and 3 months. After a median follow-up of 3.4 years, the primary end point occurred in 7.6% (13/172) and 11.3% (20/177) of patients on A+C and on warfarin, respectively (log-rank, P\u003d0.2). The adjusted hazard ratio was 0.76 (95% confidence interval, 0.36-1.61; P\u003d0.5). Major hemorrhages including intracranial hemorrhages occurred in 4 and 6 patients in the A+C and warfarin groups, respectively. Vascular deaths occurred in 0 patients in A+C arm compared with 6 (3.4%) patients in the warfarin arm (log-rank, P\u003d0.013). Time in therapeutic range (67% of the time for international normalized ratio 2-3) analysis by tertiles showed no significant differences across groups. CONCLUSIONS-: Because of lack of power, this trial was inconclusive and results should be taken as hypothesis generating. Â© 2014 American Heart Association, Inc., 571358\u003dDecember 3, 2013, 158183\u003dBackground: Transient ischemic attacks and minor stroke entail considerable risk of completed stroke but this risk is reduced by prompt assessment and treatment. Risk can be stratified according to the ABCD2 prediction score. Current guidelines suggest specialist assessment and treatment within 24h for high-risk event (ABCD2 score 4-7) and seven-days for low-risk event (ABCD2 score \u003d3). Aims: The study aims to establish paths to care and outcomes for patients referred by general practitioners and emergency departments to an Australian acute access transient ischemic attack service. Methods: This is a prospective audit. Primary outcomes were time from event to referral, from referral to clinic appointment, and from event to appointment. ABCD2 score was calculated for each event. Time from event was modeled using Cox proportional hazards regression. Results: There were 231 clinic attendees (general practitioner: 127; emergency department: 104). Mean time from event to referral was 9Â·2 days (SD 23Â·7, median 2), from referral to being seen in the clinic was 13Â·6 days (SD 19Â·0, median 7), and from event to being seen in the clinic was 17Â·2 days (SD 27Â·1, median 10). Of low-risk patients, 38Â·5% were seen within seven-days of event. Of high-risk patients, 36Â·7% were seen within one-day. ABCD2 score was not a significant predictor of any time interval from event to clinic attendance. There were no completed strokes prior to clinic attendance. Conclusions: Times from event to clinic assessment were in excess of current recommendations and risk stratification was suboptimal, though short-term outcomes were good. Improvements in referral mechanisms may enhance risk-stratification and triage. Â© 2013 World Stroke Organization., 86190\u003dBackground and Aims: Providing evidence-based clinical care reduces disability and mortality rates following stroke. We examined if compliance with evidence-based processes of care were different for patients with intracerebral haemorrhage when compared with ischemic stroke and sought to describe differences in health outcomes during hospitalization and at time of discharge for these stroke subtypes. Methods: The New South Wales acute stroke dataset was used. This included data from 50-100 consecutively admitted patients\u0027 medical records collected from 32 New South Wales hospitals between 2003 and 2010. Multivariable logistic regression analyses were conducted taking into account patient factors and clustering of patients by hospital. Results: Ischemic stroke and intracerebral haemorrhage cases had similar demographic features (ischemic stroke n\u003d3467, mean age 74 years [standard deviation 13], 50% female; intracerebral haemorrhage n\u003d275, mean age 74 years [standard deviation 13], 48% female). Following multivariable analyses patients with intracerebral haemorrhage were less likely to be admitted to a stroke unit (adjusted odds ratio 0Â·65; 95% confidence interval 0Â·45-0Â·94) or receive an assessment from allied health (adjusted odds ratio 0Â·54; 95% confidence interval 0Â·33-0Â·89) than patients with ischemic stroke. Patients with intracerebral haemorrhage are also less likely to be independent (adjusted odds ratio 0Â·36; 95% confidence interval 0Â·3-0Â·5) at time of hospital discharge and had a greater odds of dying in hospital (adjusted odds ratio 2Â·1; 95% confidence interval 1Â·3-3Â·5). Patients that were admitted to a stroke unit had a greater odds of being independent (modified Rankin Score 0-2) at day 7-10 irrespective of stroke type or severity on admission (adjusted odds ratio 1Â·3; 95% confidence interval 1Â·01-1Â·66). Conclusions: Following intracerebral haemorrhage, patients were less likely to be admitted to an acute stroke unit and receive allied health interventions. Admission to stroke units improved the likelihood of being independent at days 7-10 and, therefore, more should be done to encourage evidence-based care for intracerebral haemorrhage. Â© 2013 World Stroke Organization., 570462\u003dApril 1, 2014, 81312\u003dBackground: The currently proven time window for thrombolysis in ischemic stroke is 4Â·5h. Beyond this, the risks and benefits of thrombolysis are uncertain. Aims: To determine whether thrombolysis and reperfusion were beneficial after 4Â·5h, we examined clinical and radiological outcomes in patients treated with tissue plasminogen activator or placebo within 4Â·5-6h, using data from the Echoplanar Imaging Thrombolytic Evaluation Trial. Methods: In the Echoplanar Imaging Thrombolytic Evaluation Trial, ischemic stroke patients presenting three to six-hours after stroke onset were randomized to tissue plasminogen activator or placebo, without knowledge of magnetic resonance imaging results. This analysis was restricted to patients treated between 4Â·5 and 6h. The effect of tissue plasminogen activator and reperfusion on infarct growth between baseline diffusion-weighted imaging and day 90 T2 imaging was assessed, along with good neurological outcome (\u003d8 point reduction or reaching 0-1 at 90 days on National Institutes of Health Stroke Scale) and functional outcome (modified Rankin scale). The effect of tissue plasminogen activator on reperfusion was also analyzed. Results: Sixty-nine patients were treated 4Â·5-6h after onset, and infarct growth was assessed in 63. Tissue plasminogen activator was associated with lower relative growth (94% vs. 168%, P\u003d0Â·03) and a trend to lower absolute growth (-0Â·17ml versus 9Â·6ml, P\u003d0Â·07). Reperfusion was increased in the tissue plasminogen activator group (58% versus 25%, P\u003d0Â·03) and was associated with increased rates of good neurological (86% versus 28% P\u003c0Â·001) and functional (modified Rankin scale 0-2 73% versus 34%, P\u003d0Â·01) outcomes. Reperfusion was strongly associated with lower relative (80% versus 189%, P\u003c0Â·001) and absolute (-2Â·5ml versus 40ml, P\u003c0Â·001) infarct growth. Conclusions: Thrombolysis 4Â·5-6h after stroke onset reduced infarct growth and increased the rate of reperfusion, which was associated with good neurological and functional outcome. Â© 2013 World Stroke Organization., 154104\u003dBackground: Perfusion computed tomography is becoming more widely used as a clinical imaging tool to predict potentially salvageable tissue (ischemic penumbra) after ischemic stroke and guide reperfusion therapies. Aims: The study aims to determine whether there are important changes in perfusion computed tomography thresholds defining ischemic penumbra and infarct core over time following stroke. Methods: Permanent middle cerebral artery occlusion was performed in adult outbred Wistar rats (n\u003d6) and serial perfusion computed tomography scans were taken every 30 mins for 2h. To define infarction thresholds at 1h and 2h post-stroke, separate groups of rats underwent 1h (n\u003d6) and 2h (n\u003d6) of middle cerebral artery occlusion followed by reperfusion. Infarct volumes were defined by histology at 24h. Co-registration with perfusion computed tomography maps (cerebral blood flow, cerebral blood volume, and mean transit time) permitted pixel-based analysis of thresholds defining infarction, using receiver operating characteristic curves. Results: Relative cerebral blood flow was the perfusion computed tomography parameter that most accurately predicted penumbra (area under the curve\u003d0Â·698) and also infarct core (area under the curve\u003d0Â·750). A relative cerebral blood flow threshold of \u003c75% of mean contralateral cerebral blood flow most accurately predicted penumbral tissue at 0Â·5h (area under the curve\u003d0Â·660), 1h (area under the curve\u003d0Â·659), 1Â·5h (area under the curve\u003d0Â·636), and 2h (area under the curve\u003d0Â·664) after stroke onset. A relative cerebral blood flow threshold of \u003c55% of mean contralateral most accurately predicted infarct core at 1h (area under the curve\u003d0Â·765) and at 2h (area under the curve\u003d0Â·689) after middle cerebral artery occlusion. Conclusions: The data provide perfusion computed tomography defined relative cerebral blood flow thresholds for infarct core and ischemic penumbra within the first two hours after experimental stroke in rats. These thresholds were shown to be stable to define the volume of infarct core and penumbra within this time window. Â© 2013 World Stroke Organization., 6048\u003dObjectives: We hypothesized that common variants in the collagen genes COL4A1/COL4A2 are associated with sporadic forms of cerebral small vessel disease. Methods: We conducted meta-analyses of existing genotype data among individuals of European ancestry to determine associations of 1,070 common single nucleotide polymorphisms (SNPs) in the COL4A1/COL4A2 genomic region with the following: intracerebral hemorrhage and its subtypes (deep, lobar) (1,545 cases, 1,485 controls); ischemic stroke and its subtypes (cardioembolic, large vessel disease, lacunar) (12,389 cases, 62,004 controls); and white matter hyperintensities (2,733 individuals with ischemic stroke and 9,361 from population-based cohorts with brain MRI data). We calculated a statistical significance threshold that accounted for multiple testing and linkage disequilibrium between SNPs (p \u003c 0.000084). Results: Three intronic SNPs in COL4A2 were significantly associated with deep intracerebral hemorrhage (lead SNP odds ratio [OR] 1.29, 95% confidence interval [CI] 1.14-1.46, p \u003d 0.00003; r2 \u003e 0.9 between SNPs). Although SNPs associated with deep intracerebral hemorrhage did not reach our significance threshold for association with lacunar ischemic stroke (lead SNP OR 1.10, 95% CI 1.03-1.18, p \u003d 0.0073), and with white matter hyperintensity volume in symptomatic ischemic stroke patients (lead SNP OR 1.07, 95% CI 1.01-1.13, p \u003d 0.016), the direction of association was the same. There was no convincing evidence of association with white matter hyperintensities in population-based studies or with non-small vessel disease cerebrovascular phenotypes. Conclusions: Our results indicate an association between common variation in the COL4A2 gene and symptomatic small vessel disease, particularly deep intracerebral hemorrhage. These findings merit replication studies, including in ethnic groups of non-European ancestry., 53823\u003dBackground and Purpose-Ischemic stroke (IS) and coronary artery disease (CAD) share several risk factors and each has a substantial heritability. We conducted a genome-wide analysis to evaluate the extent of shared genetic determination of the two diseases. Methods-Genome-wide association data were obtained from the METASTROKE, Coronary Artery Disease Genomewide Replication and Meta-analysis (CARDIoGRAM), and Coronary Artery Disease (C4D) Genetics consortia. We first analyzed common variants reaching a nominal threshold of significance (P\u003c0.01) for CAD for their association with IS and vice versa. We then examined specific overlap across phenotypes for variants that reached a high threshold of significance. Finally, we conducted a joint meta-analysis on the combined phenotype of IS or CAD. Corresponding analyses were performed restricted to the 2167 individuals with the ischemic large artery stroke (LAS) subtype. Results-Common variants associated with CAD at P\u003c0.01 were associated with a significant excess risk for IS and for LAS and vice versa. Among the 42 known genome-wide significant loci for CAD, 3 and 5 loci were significantly associated with IS and LAS, respectively. In the joint meta-analyses, 15 loci passed genome-wide significance (P\u003c5Ã10-8) for the combined phenotype of IS or CAD and 17 loci passed genome-wide significance for LAS or CAD. Because these loci had prior evidence for genome-wide significance for CAD, we specifically analyzed the respective signals for IS and LAS and found evidence for association at chr12q24/SH2B3 (PIS\u003d1.62Ã10-7) and ABO (PIS\u003d2.6Ã10-4), as well as at HDAC9 (PLAS\u003d2.32Ã10-12), 9p21 (PLAS\u003d3.70Ã10-6), RAI1-PEMT-RASD1 (PLAS\u003d2.69Ã10-5), EDNRA (PLAS\u003d7.29Ã10-4), and CYP17A1-CNNM2-NT5C2 (PLAS\u003d4.9Ã10-4). Conclusions-Our results demonstrate substantial overlap in the genetic risk of IS and particularly the LAS subtype with CAD. Â© 2013 American Heart Association, Inc., 57397\u003dBackground and Purpose - Genome-wide association studies have revealed multiple common variants associated with known risk factors for ischemic stroke (IS). However, their aggregate effect on risk is uncertain. We aimed to generate a multilocus genetic risk score (GRS) for IS based on genome-wide association studies data from clinical-based samples and to establish its external validity in prospective population-based cohorts. Methods - Three thousand five hundred forty-eight clinic-based IS cases and 6399 controls from the Wellcome Trust Case Control Consortium 2 were used for derivation of the GRS. Subjects from the METASTROKE consortium served as a replication sample. The validation sample consisted of 22 751 participants from the Cohorts for Heart and Aging Research in Genomic Epidemiology consortium. We selected variants that had reached genome-wide significance in previous association studies on established risk factors for IS. Results - A combined GRS for atrial fibrillation, coronary artery disease, hypertension, and systolic blood pressure significantly associated with IS both in the case-control samples and in the prospective population-based studies. Subjects in the top quintile of the combined GRS had \u003e2-fold increased risk of IS compared with subjects in the lowest quintile. Addition of the combined GRS to a simple model based on sex significantly improved the prediction of IS in the combined clinic-based samples but not in the population-based studies, and there was no significant improvement in net reclassification. Conclusions - A multilocus GRS based on common variants for established cardiovascular risk factors was significantly associated with IS both in clinic-based samples and in the general population. However, the improvement in clinical risk prediction was found to be small. Â© 2014 American Heart Association, Inc., 108162\u003dObjectives Concussion remains one of the inherent risks of participation in rugby league. While other injuries incurred by rugby league players have been well studied, less focus and attention has been directed towards concussion. Review method The current review examined all articles published in English from 1900 up to June 2013 pertaining to concussion in rugby league players. Data sources Publications were retrieved via six databases using the key search terms: rugby league, league, football; in combination with injury terms: athletic injuries, concussion, sports concussion, sports-related concussion, brain concussion, brain injury, brain injuries, mild traumatic brain injury, mTBI, traumatic brain injury, TBI, craniocerebral trauma, head injury and brain damage. Observational, cohort, correlational, cross-sectional and longitudinal studies were all included. Results 199 rugby league injury publications were identified. 39 (20%) were related in some way to concussion. Of the 39 identified articles, 6 (15%) had the main aim of evaluating concussion, while the other 33 reported on concussion incidence as part of overall injury data analyses. Rugby league concussion incidence rates vary widely from 0.0 to 40.0/1000 playing hours, depending on the definition of injury (time loss vs no time loss). The incidence rates vary across match play versus training session, seasons (winter vs summer) and playing position (forwards vs backs). The ball carrier has been found to be at greater risk for injury than tacklers. Concussion accounts for 29% of all injuries associated with illegal play, but only 9% of injuries sustained in legal play. Conclusions In comparison with other collision sports, research evaluating concussion in rugby league is limited. With such limited published rugby league data, there are many aspects of concussion that require attention, and future research may be directed towards these unanswered questions. Â© 2014 BMJ Publishing Group Ltd \u0026 British Association of Sport and Exercise Medicine., 582413\u003dCopyright 2015 CRICOS Provider Number 00109J The University of Newcastle, Australia, 104528\u003dBACKGROUND AND PURPOSE - : Studies in rodent models suggest that upregulating angiopoietin-1 (Angpt1) improves stroke outcomes. The aims of this study were to assess the association of plasma Angpt1 with stroke occurrence and outcome. METHODS - : Plasma Angpt1 was measured in 336 patients who had experienced a recent stroke and 321 healthy controls with no stroke history. Patients with stroke (n\u003d285) were reassessed at 3 months and plasma Angpt1 concentration on admission compared between those with severe and minor disability as assessed by the modified Rankin scale. In a separate cohort of 4032 community-acquired older men prospectively followed for a minimum of 6 years, the association of plasma Angpt1 with stroke incidence was examined. RESULTS - : Median plasma Angpt1 was 3-fold lower in patients who had experienced a recent stroke (6.42, interquartile range, 4.26-9.53 compared with 17.36; interquartile range, 14.01-22.46 ng/mL; P\u003c0.001) and remained associated with stroke after adjustment for other risk factors. Plasma Angpt1 concentrations on admission were lower in patients who had severe disability or died at 3 months (median, 5.52; interquartile range, 3.81-8.75 ng/mL for modified Rankin scale 3-6; n\u003d91) compared with those with minor disability (median, 7.04; interquartile range, 4.75-9.92 ng/mL for modified Rankin scale 0-2; n\u003d194), P\u003d0.012, and remained negatively associated with severe disability or death after adjusting for other risk factors. Plasma Angpt1 was not predictive of stroke incidence in community-dwelling older men. CONCLUSIONS - : Plasma Angpt1 concentrations are low after ischemic stroke particularly in patients with poor stroke outcomes at 3 months. Interventions effective at upregulating Angpt1 could potentially improve stroke outcomes. Â© 2014 American Heart Association, Inc.}","textBeforeTable":"Fields of Research Transcranial Doppler Stroke genetics Stroke Neurology Hypothermia Brain imaging Basic Neurosciences Acute stroke therapies Keywords Bachelor of Medical Science, University of New South Wales Bachelor of Medicine, Bachelor of Surgery (Hons), University of New South Wales Qualifications Research Expertise Clinical research across the domains of observational epidemiology (case control studies, cohort studies, prevalence and incident studies), interventional clinical trials (trials in antithrombotic therapy in stroke prevention, acute stroke therapy trials), health services work (cluster randomised trials of health services interventions, health service redesign), brain imaging research (neurovascular ultrasound particularly transcranial Doppler embolus protection, multi-module CT imaging and MRI brain imaging). Research activities have been spread approximately equally across the above domains with an emphasis on clinical trials and stroke imaging. Teaching Expertise Undergraduate Undergraduate teaching in the form of formal lectures, small group tutorials, bedside tutorials and one on one clinical teaching on clinical wards and outpatients clinics. Postgraduate Formal lectures, small group tutorials bedside tutorials and formal mentoring of FRACP candidates. Administrative Expertise Current Administrative Appointments \" Director, Priority Research Centre for Brain and Mental Health, University of Newcastle, Hunter Medical Research Institute with responsibility for oversight of the six programs of research within the centre. \" Director, Acute Stroke Services, John Hunter Hospital with responsibility for the operational management of the Acute Stroke Service including the Stroke Unit and acute stroke interventional","textAfterTable":"Neurology University of Newcastle School of Medicine and Public Health Australia 1/01/1999 - 1/12/2002 Member Hunter Area Research Ethics Committee Australia Membership Dates Title Organisation / Department Member - Stroke Society of Australasia Stroke Society of Australasia Australia Expert Advisory Sub-committee Member to the Federal Health Minister Australian Population Health Development Principle Committee (APHDPC) Australia Awards Research Award Year Award 2005 Dudley Homer Vose Research Award Heart Foundation Invitations Participant Year Title / Rationale 2005 Cholesterol and Stroke Organisation: World Congress of Neurology Edit Publications Journal article217 Conference169 For publications that are currently unpublished or in-press, details are shown in italics. Journal article (217 outputs) Year Citation Altmetrics Link 2015 RannikmÃ¤e K, Davies G, Thomson PA, Bevan S, Devan WJ, Falcone GJ, et al., \u0027Common variation in COL4A1/COL4A2 is associated with sporadic cerebral small vessel disease\u0027, Neurology, 84 918-926 (2015) Objectives: We","hasKeyColumn":false,"keyColumnIndex":-1,"headerRowIndex":0}