{"relation":[["Citing Patent","US5608196 *","US5659151 *","US5753983 *","US6483031 *","US6657144 *","US6774308 *","US6929140","US6940016","US6951983 *","US7019211","US7179993","US7238882","US7375951","US7499261 *","US8569619 *","US8598993 *","US20110232957 *"],["Filing date","Sep 8, 1995","Sep 9, 1994","Aug 9, 1995","Feb 23, 2001","Dec 28, 2001","Mar 17, 2003","Sep 9, 2002","Aug 6, 2003","Jun 30, 2004","May 27, 2005","Feb 24, 2006","Jan 20, 2004","Jul 7, 2006","Mar 13, 2008","Jun 6, 2011","Aug 15, 2008",""],["Publication date","Mar 4, 1997","Aug 19, 1997","May 19, 1998","Nov 19, 2002","Dec 2, 2003","Aug 10, 2004","Aug 16, 2005","Sep 6, 2005","Oct 4, 2005","Mar 28, 2006","Feb 20, 2007","Jul 3, 2007","May 20, 2008","Mar 3, 2009","Oct 29, 2013","Dec 3, 2013","Sep 29, 2011"],["Applicant","The Whitaker Corporation","The Whitaker Corporation","1012384 Ontario, Inc.","Patrick O\u0027Donnell","Pass \u0026 Seymour, Inc.","Steven Troyen","Frank P. Rose","Desa Ip, Llc","Arlington Industries, Inc.","Rose Frank P","Rose Frank P","Charles B. Perkins","Lutron Electronics Co., Inc.","Lutron Electronics Co., Inc.","Arlington Industries, Inc.","Homerun Holdings Corporation","Gretz Thomas J"],["Title","Normally closed dimmer switch contact assembly separated by rocker actuator interposed insulation plate","Wire management knockout closure for electrical boxes","Multi-function control switch for electrically operating devices","Mounting bracket and extra-low voltage control device for installation with an electrical outlet box","Through strap for switch","Wire termination box assembly and associated method of installation","Universal junction box","Electrical rough-in box for low voltage transformer","Outlet box assembly","Universal junction box","Universal junction box with mounting aperture","Low voltage door switch","Load control device having a split enclosure","Load control device having a split enclosure","Electrical box assembly for angled recessed mounting of high and low voltage components","Method for wiring devices in a structure using a wireless network","Electrical box assembly for angled recessed mounting of high and low voltage components"]],"pageTitle":"Patent US5445539 - Electrical wiring device for power control with low voltage input - Google Patents","title":"","url":"http://www.google.com/patents/US5445539?dq\u003d5,072,412","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"RELATION","tableNum":7,"s3Link":"common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986423.95/warc/CC-MAIN-20150728002306-00336-ip-10-236-191-2.ec2.internal.warc.gz","recordEndOffset":477700831,"recordOffset":477675685,"tableOrientation":"HORIZONTAL","textBeforeTable":"Patent Citations It is thought that the wiring device of the present invention and many of its attendant advantages will be understood from the foregoing description. It is apparent that various changes may be made in the form, construction, and arrangement of parts thereof without departing from the spirit or scope of the invention, or sacrificing all of its material advantages. As can be seen from the foregoing description the present invention provides a means whereby a housing can be prewired and then upgraded at a later time to provide greater capability wherein the low voltage and power wires remain isolated from on another. FIG. 9 shows an alternative embodiment of the conventional device wherein the low voltage wires are individual twisted pairs 176 rather than a cable. FIG. 8 shows a representative wire management knockout closure in accordance with the invention used to secure the low voltage or class 2 or class 3 wires at the rear of the conventional box when the initial building wiring is done and the box 84 is used with a conventional device. The details of the wire management knockout closure are more fully described in U.S. patent application Ser. No. 08/303,984, filed in the name of inventor James L. Dale filed concommently herewith. The wire management knockout closure 92 includes a body 94 having a portion 96 for gripping the wire management knockout closure from the interior of the box to","textAfterTable":"Citing Patent Filing date Publication date Applicant Title US5608196 * Sep 8, 1995 Mar 4, 1997 The Whitaker Corporation Normally closed dimmer switch contact assembly separated by rocker actuator interposed insulation plate US5659151 * Sep 9, 1994 Aug 19, 1997 The Whitaker Corporation Wire management knockout closure for electrical boxes US5753983 * Aug 9, 1995 May 19, 1998 1012384 Ontario, Inc. Multi-function control switch for electrically operating devices US6483031 * Feb 23, 2001 Nov 19, 2002 Patrick O\u0027Donnell Mounting bracket and extra-low voltage control device for installation with an electrical outlet box US6657144 * Dec 28, 2001 Dec 2, 2003 Pass \u0026 Seymour, Inc. Through strap for switch US6774308 * Mar 17, 2003 Aug 10, 2004 Steven Troyen Wire termination box assembly and associated method of installation US6929140","hasKeyColumn":true,"keyColumnIndex":3,"headerRowIndex":0}