{"relation":[["","One Time Setup Fee One Time Setup Fee","Annual Payment Annual Payment","Beautiful Templates Beautiful Templates","Choose your colors \u0026 logo font Choose your colors \u0026 logo font","Homepage with announcements [ ? ] Homepage with announcementsOn your home page you will have a section for Highlights or Announcements. You will have room for 3 items with an optional thumbnail photo. Each item is designed to use introductory text that will link to a full page about your topic. Use this section for the latest news, a featured horse for sale, or a special service. This is the place to showcase what you feel is very important. You can change the items out as you choose.","News page with expanded stories [ ? ] News page with expanded storiesThe news page consists of a series of items listed on a page. Each item includes introductory text and optional thumbnail photo. Every item can open up to a full page about the story with additional images that are full size and click to enlarge.","Photo Galleries with \"click to expand\" [ ? ] Photo Galleries with \"click to expand\"All photos that you place on the site are automatically sized and placed. The click to enlarge feature works throughout your site, including your photo gallery. Each photo can have a caption. Multiple Galleries allow you to showcase horses, events, your farm or services.","Contact page with map [ ? ] Contact page with mapEvery contact page will include a snapshot map with your location.","Document vault [ ? ] Document vaultEach site has a limit of PDF\u0027s or Word documents that they can link to for download.","Email forwards [ ? ] Email forwardsIf you have an email address such as info@yourfarmname.com and you would like to forward to yourname@aol.com, that is considered an email forward.","Your own domain registered by you or us [ ? ] Your own domain registered by you or usYou may use your own domain name for you site with the Standard and Premium packages. We encourage you to do so. If you would like us to register your domain name, the cost is $15 per year.","Slide show on your homepage [ ? ] Slide show on your homepageYou can choose up to 6 photos to be used in a slide show on your home page with the STandard and Premium.","Links [ ? ] LinksLink to FHANA and other associations or services. A standard links list page.","Our horses page [ ? ] Our horses pageA list page, similar in layout to the News page. You place introductory text, an optional photo, that will link to a full page. You can add up to 5 photos for each horse listed and all photos will be click-to-enlarge. Use this for your broodmares, stallions or show horses. You could use this for horses for sale if you have the Standard Package.","Blog Page [ ? ] Blog PageIf you write your news in a story, you may want to create a blog, If you have expertise in a particular field or service, you may want to share your knowledge and grow your business with a blog. The layout is similar to the News page with introductory text and optional photo that links to a full page.","Email capture \u0026 marketing [ ? ] Email capture \u0026 marketingStandard and Premium packages offer optional email capture. This means a place for visitors to enter their email address to receive news from your farm via email or newsletter. The names will be stored in your own database for use with Constant Contact or our own bulk email system [coming soon]. We will provide instructions and will be available to help you with your email campaigns. This is the most important marketing tool you can have at a remarkably affordable cost","Your news featured on the portal homepage [ ? ] Your news featured on the portal homepageWe will randomly pull and rotate news items from within the site to be on the portal home page.","Auto-reminder to update your site [ ? ] Auto-reminder to update your siteOptional, automated email reminder to update your site with news, results, breeding updates.","Your logo integrated into your banner [ ? ] Your logo integrated into your bannerIf you have a logo youâd like to have included in the banner design of your site, we will add it for you. This is available with the Premium package.","Sales Horses page [ ? ] Sales Horses pageA separate page for sales horses, the same layout as Our Horses. 5 click-to-enlarge photos per horse.","Calendar page with \"Remind Me\" feature [ ? ] Calendar page with \"Remind Me\" featureIf you have events or a breeding schedule clients need to know about, youâll want to use the Calendar page. Each event has an optional Remind Me feature that sends an email or text message to a phone.","\"Quick Links\" on every page [ ? ] \"Quick Links\" on every pageThis feature puts important links within your site, or on another site, in front of your site visitors on every page. If your main site is not on FHANAMembers.com, you can drive traffic to it through these links. Or highlight an important news item, gallery, or horse with the link on every page. You can link to other sites within articles, but the Quick Links are always visible on every page.","No outside ads [ ? ] No outside adsEnergize.info has the option to place Google Ads or relevant ads from service providers and farms in the right column on pages throughout the site. Premium subscribers do not have ads displayed on their site.","Your site featured on portal home page [ ? ] Your site featured on portal home pagePremium package subscribers will automatically be included in a random rotation of farms featured on the FHANAMembers.com home page. This will give you added exposure to visitors who come directly to the sites home page.","Site statistics reports [ ? ] Site statistics reportsWe will connect your site to Google Analytics if you have your own domain name. You will be able to track the traffic on your site and make adjustments to increase your effectiveness."],["BASIC","$50","$200","X","X","X","X","1 Gallery 20 photos","X","5 docs","0","","","","","","","","","","","","","","",""],["STANDARD","$50","$300","X","X","X","X","4 Galleries 96 photos","X","10 docs","3","X","X","X","X","X","X","X","X","","","","","","","X"],["PREMIUM","$50","$400","X","X","X","X","12 Galleries 432 photos","X","20 docs","8","X","X","X","X","X","X","X","X","X","X","X","X","X","X","X"]],"pageTitle":"Features \u0026 Pricing - Mpower by energize.info","title":"","url":"http://mpowersites.com/mpower/pricing/","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"RELATION","tableNum":4,"s3Link":"common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989043.35/warc/CC-MAIN-20150728002309-00217-ip-10-236-191-2.ec2.internal.warc.gz","recordEndOffset":167844472,"recordOffset":167836270,"tableOrientation":"HORIZONTAL","textBeforeTable":"Subscription Levels - Pricing and Features The Stables at Frederica Crown Friesians Rose Hill Friesians Our Newest Members   South Central Friesian Horse Association   Interested in getting a site?   Forgotten password?     Remember me on this computer. Password: Username:  ","textAfterTable":"    Find by Name Find by State Select... Alabama Alaska Alberta Arizona Arkansas British Columbia California Colorado Connecticut Delaware District Of Columbia Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Manitoba Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Brunswick New Hampshire New Jersey New Mexico New York Newfoundland North Carolina North Dakota Northwest Territories Nova Scotia Ohio Oklahoma Ontario Oregon Pennsylvania Prince Edward Island Province du Quebec Rhode Island Saskatchewan South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington West Virginia Wisconsin Wyoming Yukon Territory     All Member Sites","hasKeyColumn":false,"keyColumnIndex":-1,"headerRowIndex":0}