{"relation":[["Categories","What to do for fun","Food and Dining","Dorm Life","Academic Rigor","Tips for prospective students","In three sentences"],["Comments","Lots of sporting events to attend, if that\u0027s your thing! Dawgs After Dark is especially fun and they do it a few times each semester. $1 movies at the student center every weekend lots of free things to do, like play with the puppies at the animal shelter or visit the botanical gardens on campus!","The meal plan is top-notch and is all-you-can-eat! (Just don\u0027t eat too much... it makes the freshman 15 all too easy!) There\u0027s also plenty of awesome places to eat around campus and in Downtown Athens.","The residence advisors are awesome - extremely friendly and very helpful! You will meet some of your best friends in your dorm if you are open minded and step out of your comfort zone a little bit. Community bathrooms are not that bad, I promise!","Doing the work and doing it well is key. If you study hard and use all the resources you can, you will succeed! Don\u0027t be afraid to get help in as many places as possible!","Be open minded - take a class you might not be all that interested in, and be open to advice from others! Think about the big picture when choosing a major - what exactly do you plan on doing with your degree? Time management is KEY!","There is never a dull moment at UGA! There is always something fun going on no matter what it is you\u0027re interested in. It\u0027s a very diverse student body with opportunities for everyone."]],"pageTitle":"University of Georgia (UGA) Reviews: Student Reviews and Ratings | Cappex","title":"","url":"https://www.cappex.com/colleges/University-of-Georgia/reviews?_escaped_fragment_\u003d/show/69560","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"RELATION","tableNum":216,"s3Link":"common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986423.95/warc/CC-MAIN-20150728002306-00275-ip-10-236-191-2.ec2.internal.warc.gz","recordEndOffset":908757615,"recordOffset":908552551,"tableOrientation":"HORIZONTAL","TableContextTimeStampAfterTable":"{671347\u003dGo to football games, attend University concerts presented by the Hugh Hodgeson School of music, check out the art in the Lamar Dodd school of art and attend some exit shows, go downtown and check out the sunshine and live music, Hit up Cine, the independent arthouse downtown, or lay out in north campus and soak in some peace., 496392\u003dI have walked and rode bikes many a time past 12:00 at night around campus and have seen campus police around and have not ran into any trouble thus far. Be sure to travel in groups if you go downtown or off campus. and LOCK YOUR BIKES., 968417\u003dThis is what I explained to my family when they asked me how the food was: it is the best cafeteria food I have ever had, but it is still cafeteria food. If you have allergies you might have a tough time, but they are pretty sensitive to people with special food needs, including vegetarians. One thing I don\u0027t like is that if you choose the 7-day meal plan, you can\u0027t downgrade it to the 5-day meal plan, even if you realize that you don\u0027t really need it. I ended up going out to eat or ordering pizza or Chinese with friends on many Friday nights and Saturdays. And on Sunday, the dining halls close at 2:00., 68331\u003dUGA offers an ivy league education, for a public school price. Situated in Athens, GA: ranked the #1 College Town that Rocks by Rolling Stones magazine in 2007 and one of 29 Must Visit places by LA Times magazine in 2009, there are plenty of things to do here. Definitely a great place to spend some great 4 (maybe 5) years., 1096\u003dTake the SAT and ACT as many times as possible, sign up for as many APs as YOU CAN HANDLE. Georgia is extremely selective these days. The average GPA for incoming freshman in 2009 is 3.9 with a 1300 SAT and 30 ACT score. It is important to take the standardized tests as much as possible to get the best score you can. Also, UGA wants to see that you are challenging yourself. APs are the best way to do so. And the more hours you have coming in as a freshman, the easier your life will be. You can sign up for classes earlier, change majors and still have lots of wiggle room, and even get better dibs on football tickets., 196631\u003dParty type students (obviously. But I am NOT the party type). Music majors, journalism majors, food science majors (that program is really really good), anyone doing an agriculture related major (the advisers there are helpful and personable), and in general students who know how to balance fun with school because their WILL BE lots of opportunities to slack off but their are also LOTS of opportunities to succeed. : ) -Vanessa M. Class of 2014, 322412\u003duga has a very wide variety of dorm life. there are freshman high rises that hold up to a 1000 people all the way to small, cozy dorms that hold no more than 200. each dorm breeds a different kind of atmosphere from family-like to wild and busy. so at the university of georgia, you are bound to find the dorm lifestyle you seek., 63852\u003dSnellebrating is a tradition that involves going to our 24 hr dining hall: Snelling after the hours of 12:00 midnight. You see all kinds of people and have some of the best conversations. Celebrate a great day, maybe a great grade or maybe you\u0027re just an insomniac. Either way, good food, good people: let the good times roll., 1038980\u003dThere is a dining hall called Snelling and it is a tradition to Snellebrate meaning late night dining at this 24 hour dining hall. You can literally come and eat at 3:00 in the morning. Its an awesome thing to do., 223852\u003dI am applying to this school for the fall of 2012 and i\u0027m wondering if they accept people based on the GPA or SAT score., 1089590\u003dUGA provides 4 dining commons with a new one being introduced in the fall of 2013. The food is good, and meal plans offer students all you can eat. Everything is relatively fresh and the Hibachi grill and Philly Cheesesteaks are pretty popular. Also, the smoothies at the Joe Frank Harris Dining Commons are good., 38443\u003dIF IT DOES NOT APPLY TO YOUR MAJOR TO NOT TAKE!!! For example if science is not your major and you don\u0027t have to take a science don\u0027t! If you do don\u0027t feel you have to take the most difficult science class to prove something, just take ecology and get it over with. Also do your homework research your professors on the uga key and rate your professor, there\u0027s no need to take a class with a professor thats just going to aggravate you. You will also need to learn the bus schedule it\u0027ll make getting around so much easier and quicker especially in august when its WAY TOO HOT to walk anywhere. For those who are concerned about keeping HOPE, I would suggest taking the easiest load of classes you know you can get As in your first semester. Its better to start off with that 4.0 so even if you screw up you\u0027ll still be good. There are some classes that are easy A\u0027s like ECHD and while they may not do anything for your major they rarely take up any of your free time outside of class. Oh and don\u0027t go out and buy your books as soon as school starts because some professors will tell you you can a get a cheaper version or that you don\u0027t even need the book for class. One more thing Do not deprive yourself of sleep during finals I\u0027ve seen people pass out on the floor in the dining halls because they\u0027ve pushed them selves too hard. A good nights sleep will help you better than eight hours of studying with no break., 900884\u003dWhen I\u0027m in Atlanta, I\u0027m a little shaky when it come to walking alone. But at UGA, I don\u0027t have any problem walking from East Campus to North Campus alone at night :)...bottom point, I feel very safe at UGA. But at the same time, I did hear some scary stories that happened since Aug 2012..that\u0027s why I gave 4 stars., 204728\u003dCollege is what you make it; if it\u0027s boring, that is because you\u0027ve never tried anything. If it\u0027s so exciting that you can\u0027t get your work done, you might want to relax a little. Being here at the university is so much fun and at the same time challenging. For most of us, we are traveling from different states or this is our first time being away from home for an extended period of time. Don\u0027t let that scare you, though. Everyone has experienced that and can tell you how they dealt with it. For me, I was excited to come here. This was my first time moving, so it was a new life for me. Being here allots you so many opportunities. Besides it being the #1 party school in America, there are many productive clubs and organizations that are involved in the Athens community such as UGA Heroes, UGA Miracle and UGA Relay For Life. These organizations help specifically with children with any ailment. If you\u0027re looking for fun in in the arts, there\u0027s a dance group PUMOJA that puts on shows all the time. Hugh Hodgson School of Music has many ensembles to choose from like Concert Choir, Opera Ensemble, AACE, and more. If you\u0027re more instrumental, they have marching band or symphonic band and orchestra. Lamar Dodd School of the Arts is next door as well as the Georgia Museum of Art. The dining food is a must have! There are four to choose from- Bolton, O\u0027House, Snelling, and ECV. With your meal plan, you can go in as ever many time you want and dine with your friends, even if it\u0027s just to get ice cream. The school is AWESOME and has endless opportunities! Take advantage of them! And don\u0027t forget about the sports! GOOOOOOOOOO DAWGS!!!, 266633\u003ddo well on your acts and sats. i got a 1990 on my sat and a 32 on my act and got in early and recieved the charter scholarship. my gpa was about a 3.4 unweighted and a 3.7 weighted. i will have taken 4 aps by the end of my senior year., 94948\u003dUGA is actually not as competitive as many say, but apply early and take as many AP classes as possible. These will help distinguish you from other students with similar grades. Also, take the SAT/ACT at least twice. The average GPA of incoming freshmen in 2009 was a 3.8 and the average SAT score was a 1263 without the writing part. Finally, extracurricular activities are important, but not entirely. I\u0027ll give my situation as an example. I had an unweighted GPA of 3.93 and an SAT of 1260. I played football for one year and didn\u0027t do much else extracurricular. I also applied the day of the deadline. Somehow, I still got in. The admissions board is somewhat random with who they admit and deny, but doing what I said above helps your chances., 548035\u003dTake the SAT and ACT with the intent of getting over a 1700 and above. Make sure your work ethic is up to par for a lot of work., 61124\u003dCampus is extremely safe! There are two different police forces that have jurisdiction on campus: Athens Clark County police and UGA police which is nice to have. UGA is a public campus which means that anyone can come on and go off at any time which is why, even though campus has many different safety features in place, use common sense and don\u0027t walk alone at 3:00 in the morning. But if you are burning the midnight oil late into the night, you can ask a police officer or security guard to escort you to your car--they are all really great people. There\u0027s also a system called UGA Alert that students sign up for at the beginning of the year. Should there be any danger, students get a phone call, text and email letting us know what we should do. The only time we get these are during scheduled tests of the system or for tornado warnings (that have never touched UGA). Plus, your parents get the alert before you do most of the time so you can tell them to rest easy., 118926\u003dYou’ve probably heard this a million and a half times, but seriously, take AP classes, as many as you can handle. Not only will they look promising on your admission application, they also knock out general requirement hours, which means you can get right to major-specific classes. Apply early—it’s a lot less work on your part, and it’s a relief to already know by December whether you’ve been accepted or not. If you want to apply for Honors, do that early as well; it’s much harder keeping the required GPA for first-year Honors admission. Also, work on time management in high school. And when you get to college, don’t risk cramming all the information in the night before an exam. It usually works in high school, but when there are only three or four exams in a college class, there’s a lot more material on tests, and it’s not a good idea to risk it. Work on getting involved! UGA has activity fairs, where clubs set up stands outside—go check them out. There are career fairs, too—even if you’re not looking for a career now, it’s a good idea to check those out, too, so when you are looking for a job, you’ve had plenty of experience selling yourself., 594198\u003dMost of my classmates from HS who were accepted into UGA had GPA\u0027s above 4.0, SATs above 2000, ACT\u0027s above 29, and 8 - 14 AP classes. UGA turned away some other classmates who graduated in the top of our class. The academic rigor needed to get in and continue at UGA is high., 633162\u003dUGA is getting difficult to get into with all the competition. To be completely safe with the odds, I would recommend at least an 1800 SAT or 30 ACT. At least 5 AP classes. Not to say that you have no hope if you don\u0027t have these credentials because you absolutely still have a chance if you don\u0027t., 970478\u003dIf your GPA and SAT/ACT scores are reasonably high, I would recommend applying during the early action period. You find out if you got in or not in November (which is awesome) and you don\u0027t have to write any essays or get teacher recs! Unlike early admission, if you apply early action you aren\u0027t required to attend if you do get in., 1090187\u003dExcellent. The 3 high-rise dorms each house nearly 1000 students, providing a community within the building. There are also several events that dorms hold for residents to engage in. From water sports in the summer to grilling out late in the fall, dorm life is very fun.}","textBeforeTable":"06/06/2009 Reviewer is A current student here. 87 out of 90 people found this review useful. 1 person found it offensive. 6 people found this inaccurate. 1 of 338 Robert from Norcross, GA Check out reviews left by other students or leave your own review. You could win a free scholarship. University of Georgia Reviews University of Georgia › Georgia › By State › Colleges › } } } xmlhttp \u003d new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp \u003d new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state \u003d\u003d \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp \u003d new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp \u003d new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe(\u0027edge.remove\u0027, }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp \u003d new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp \u003d new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe(\u0027edge.create\u0027,","textAfterTable":"Tips for prospective students The number one tip I would like to give to prospective UGA students is to really take advantage of the opportunities that UGA has to offer. UGA is a great school with an amazing campus and student life and Athens is a fabulous city. I really encourage all students to get out there and see what UGA and Athens has to offer! Also, I reccommend Dawg Camp to any students who have been accepted. It\u0027s just so much fun! You meet a lot of people and have the time of your life learning about all that UGA has to offer! Bang for the buck If you are a student from the state of Georgia and you are HOPE scholarship eligible, you definitely get the most bang for your buck because you don\u0027t pay tuition! It\u0027s really a great deal! It gives you plenty of incentive to keep your grades up and maintain your 3.0, or as my friends and I like to say, Keep HOPE alive! If you are a student coming to UGA from a state other than Georgia, it is definitely more expensive for you than it is for students who receive HOPE, but I do think it is a lot cheaper than a lot of other schools. Also, according to me, being a student at UGA is so great, a price can\u0027t even be","hasKeyColumn":true,"keyColumnIndex":0,"headerRowIndex":0}