{"relation":[["Date","Sep 10, 1992","Mar 16, 1999","Apr 1, 1999","Apr 1, 1999","Apr 25, 2003","Apr 25, 2003","Dec 15, 2006"],["Code","AS","REMI","SULP","FPAY","FPAY","SULP","FPAY"],["Event","Assignment","Maintenance fee reminder mailed","Surcharge for late payment","Fee payment","Fee payment","Surcharge for late payment","Fee payment"],["Description","Owner name: UNIVERSITE DE SHERBROOKE, CANADA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:ADOUL, JEAN-PIERRE;LAFLAMME, CLAUDE;REEL/FRAME:007467/0385;SIGNING DATES FROM 19920817 TO 19920821","","","Year of fee payment: 4","Year of fee payment: 8","Year of fee payment: 7","Year of fee payment: 12"]],"pageTitle":"Patent US5444816 - Dynamic codebook for efficient speech coding based on algebraic codes - Google Patents","title":"","url":"http://www.google.com/patents/US5444816?dq\u003dU.S.+Patent+","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"RELATION","tableNum":9,"s3Link":"common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989043.35/warc/CC-MAIN-20150728002309-00013-ip-10-236-191-2.ec2.internal.warc.gz","recordEndOffset":483312607,"recordOffset":483280652,"tableOrientation":"HORIZONTAL","TableContextTimeStampAfterTable":"{43173\u003dReturning to the encoding procedure, it is useful to discuss briefly the criterion used to select the best excitation signal Ck. This signal must be chosen to minimize, in some ways, the difference S-S between the synthesized and original speech signals. In original CELP formulation, the excitation signal Ck is based on a Mean Squared Error (MSE) criteria applied to the error Δ\u003dS\u0027-S\u0027, where S\u0027, respectively S\u0027, is S, respectively S, processed by a perceptual weighting filter of the form A(z)/A(zγ-1) where γ\u003d0.8 is the perceptual constant. In the present invention, the same criterion is used but the computations are preformed in accordance with a backward filtering procedure which is now briefly recalled. One can refer to the article by J. P. Adoul, P. Mabilleau, M. Delprat, \u0026 S. Morissette: \"Fast CELP coding based on algebraic codes\", Proc. IEEE INT\u0027l conference on acoustics speech and signal processing, pp 1957-1960 (April 1987), for more details on this procedure. Backward filtering brings the search back to the Ck-space. The present invention brings the search further back to the Ak-space. This improvement together with the very efficient search method used by controller 109 (FIG. 1) and discussed hereinafter enables a tremendous reduction in computation complexity with regard to the conventional approaches.}","textBeforeTable":"Patent Citations Although a preferred embodiment of the present invention has been described in detail hereinabove, this embodiment can be modified at will, within the scope of the appended claims, without departing from the nature and spirit of the invention. As an example, many types of algebraic codes can be chosen to achieve the same goal of reducing the search complexity while many types of adaptive prefilters can be used. Also the invention is not limited to the treatment of a speech signal; other types of sound signal can be processed. Such modifications, which retain the basic principle of combining an algebraic code generator with a adaptive prefilters, are obviously within the scope of the subject invention. The drastic complexity reduction that the present invention offers when compared to the prior art techniques comes from the fact that the search procedure can be brought back to Ak-code space by a modification of the so called backward filtering formulation. In this approach the search reduces to finding the index k for which the ratio |DAk.sup.τ |/αk is the largest. In this ratio, Ak is a fixed target signal and αk is an energy term the computation of which can be done with very few operations by codeword when N, the number of non zero components of the codeword Ak, is small. Accordingly, the present invention provides a fully quantized Algebraic Code Excited Linear Prediction (ACELP) vocoder giving near toll","textAfterTable":"Jan 19, 1988 Itt Defense Communications A Division Of Itt Corporation Digital speech coding circuit US4724535 * Apr 16, 1985 Feb 9, 1988 Nec Corporation Low bit-rate pattern coding with recursive orthogonal decision of parameters US4742550 * Sep 17, 1984 May 3, 1988 Motorola, Inc. 4800 BPS interoperable relp system US4764963 * Jan 12, 1987 Aug 16, 1988 American Telephone And Telegraph Company, At\u0026T Bell Laboratories Speech pattern compression arrangement utilizing speech event identification US4771465 * Sep 11, 1986 Sep 13, 1988 American Telephone And Telegraph Company, At\u0026T Bell Laboratories Digital speech sinusoidal vocoder with transmission of only subset of harmonics US4797925 * Sep 26, 1986 Jan 10, 1989 Bell Communications Research, Inc. Method for coding speech at low bit rates US4797926 * Sep 11, 1986 Jan 10, 1989 American Telephone And Telegraph Company, At\u0026T Bell Laboratories Digital speech vocoder","hasKeyColumn":true,"keyColumnIndex":1,"headerRowIndex":0}