{"relation":[["Code","401100","401106","401107","401108","401110","401111","401112","401130","401131","401132","401133","401134","401140","401150","401160","401165","401170","401300","401310","401311","401312","401340","401350","401400","402100","402110","402111","402112","402130","402131","402132","402150","402160","402165","402170","402300","402310","402311","402312","403100","403110","403120","403130","403140","403150","403199","403300","403310","403320","403330","403350","404100","404300","405100","405110","405120","405130","405300","405310","405320","405330","406100","406110","406120","406130","406300","406310","406320","406330","407100","407110","407120","407130","407300","407310","407320","407330","407400","408100","408110","408120","408130","408300","408310","408320","408330","408340","408350","408360","408370","408380","408400","408405","408410","408420","408430","408440","408450","408460","408470","408480","408505","408510","409100","409101","409200","409210","409220","409230","409300","409303","409305","409400","409500","409520","409600","409700","409815","409830","409900","409901","409902","409903","409905","409907","409908","409909","409910","409911","409912","409913","409914","409915","409916","409917","409918","409919","409920","409921","409922","409923","409924","409927","409928","409929","409930","409934","409935","409940","409941","409942","409943","409944","409945","409946","409947","409948","409950","409951","409952","409953","409954","409955","409956","409957","409960","409965","409970","409971","409972","409973","409974","409983","409985","409987","409998","409999"],["Description","Resident Tuition Includes charges as approved by the Board of Regents that are assessed to all regularly enrolled students.","Federal SMART Grants-Non Operating","Federal TEACH Grants-Non Operating","Undergraduate Matriculation-Prior Year","In State Tuition","Undergraduate In State Tuition","Graduate In State Tuition","Franchise Middle Grades In State Tuition Consortial Program Tuition. (See account 409923 to book other revenue generated by the program.)","Franchise ESOL In State Tuition Consortial Program Tuition. (See account 409924 to book other revenue generated by the program.)","Franchise International Affairs In State Tuition Consortial Program Revenue. (See account 409945 to book other revenue generated by the program.)","Resident Tuition-Consortium","Resident Tuition-WebBSIT","Tuition-eCore","Resident Tuition-Off Campus","Studies Abroad In State","Studies Abroad Undergraduate In State","Studies Abroad Graduate In State","Fee Waivers - Resident Tuition Includes the cost of fees waived for Resident Tuition. Fee Waivers functions as a contra-revenue account, with the normal fee amount being booked into Resident Tuition as a credit and the fee waiver amount booked into Fee Waivers as a debit.","Fee Waiver In State Tuition","Fee Waiver Undergraduate In State Tuition","Fee Wavier Graduate In State Tuition","Fee Waiver eCore","Fee Waiver Resident Tuition-Off Campus","Distance Learning Resident Tuition Includes charges as approved by the Board of Regents that are assessed to all regularly enrolled students participating in Distance Learning classes.","Non-Resident Tuition Includes amounts charged to non-resident students for instruction. All such tuition charges are to be approved by the Board of Regents.","Out of State Tuition","Undergraduate Out of State Tuition","Graduate Out of State Tuition","Franchise Middle Graduate Out of State Consortial Program Tuition. (See account 409923 to book other revenue generated by the program.)","Franchise ESOL Out of State Consortial Program Tuition. (See account 409924 to book other revenue generated by the program.)","International Affairs Franchise Out of State Consortial Program Revenue. (See account 409945 to book other revenue generated by the program.)","Non-Resident Tuition-Off Campus","Studies Abroad Out of State","Studies Abroad Undergraduate Out of State","Studies Abroad Graduate Out of State","Fee Waivers - Non-Resident Tuition Includes the cost of fees waived for Non-Resident Tuition. This is a contra-revenue account.","Fee Waiver Tuition","Fee Waiver Undergraduate Out of State Tuition","Fee Waiver Graduate Out of State Tuition","Technology Fees Includes fees charged to students to supported advanced technology programs at the institution.","Student Technology Fee Fall","Student Technology Fee Spring","Student Technology Fee Summer","Technology Fee Consortium","Technology Fee Off Campus","Allowance Doubtful Revenue-Technology Fee","Fee Waivers – Technology Fees Includes the cost of fees waived for Technology Fees. This is a contra-revenue account.","Fee Waiver-Technology Fee Fall","Fee Waiver-Technology Fee Spring","Fee Waiver-Technology Fee Summer","Fee Waiver-Technology Fee Off Campus","Student Transportation Fees Includes fees charged to students to support campus-based transportation systems.","Fee Waivers - Student Transportation Fees Includes the cost of fees waived for Student Transportation Fees. This is a contra-revenue account.","Parking/Vehicle Registration Includes fees charged to students for Parking Services and/or Vehicle Registration purpose.","Parking/Vehicle Registration Fall","Parking/Vehicle Registration Spring","Parking/Vehicle Registration Summer","Fee Waivers – Parking/Vehicle Registration Includes the cost of fees waived for Parking/Vehicle Registration. This is a contra-revenue account.","Fee Waiver-Parking Fall","Fee Waiver-Parking Spring","Fee Waiver-Parking Summer","Student Health Fees Includes fees charged to students to support campus-based health services.","Student Health Fees Fall","Student Health Fees Spring","Student Health Fees Summer","Fee Waivers – Student Health Fees Includes the cost of fees waived for Student Health Fees. This is a contra-revenue account.","Fee Waivers-Student Health Fee Fall","Fee Waivers-Student Health Fee Spring","Fee Waivers-Student Health Fee Summer","Student Athletic Fees Includes the cost of fees charged to students to support athletic programs.","Student Athletic Fees Fall","Student Athletic Fees Spring","Student Athletic Fees Summer","Fee Waivers – Student Athletic Fees Includes the cost of fees waived for Student Athletic Fees. This is a contra-revenue account.","Fee Waivers-Student Athletics Fees Fall","Fee Waivers-Student Athletics Fees Spring","Fee Waivers-Student Athletics Fees Summer","Other Student Athletic Fees Includes all Student Athletic Fees not defined in the accounts above.","Student Activity Fees Includes fees charged to students used to support the institution’s Student Activities programs.","Student Activity Fees Fall","Student Activity Fees Spring","Student Activity Fees Summer","Fee Waivers – Student Activity Fees/Recreation Fees Includes the cost of fees waived for Student Activity Fees. This is a contra-revenue account.","Fee Waivers-Student Activity Fees Fall","Fee Waivers-Student Activity Fees Spring","Fee Waivers-Student Activity Fees Summer","Fee Waivers-Student Activity Fees","Fee Waivers-Recreation Fees Fall","Fee Waivers-Recreation Fees Spring","Fee Waivers-Recreation Fees Summer","Fee Waivers-Recreation Fees","Other Student Activity Fees Includes all Student Activity Fees not defined in the accounts above.","Recreations Center and Wellness Fee","Recreation Center Fall","Recreation Center Spring","Recreation Center Summer","Recreation Center Fee","Fee Waiver-Recreation Center Fee","Wellness Fee","Fee Waiver-Wellness Fee","Fee Waiver-Recreation Center and Wellness Fee","Mandatory International/Global Fee (Only Georgia State University, Kennesaw State University, Columbus State University, Georgia Gwinnett College and the University of West Georgia)","Fee Waiver-Mandatory International/Global Fee (Only Georgia State University, Kennesaw State University, Columbus State University, Georgia Gwinnett College and the University of West Georgia)","Late Registration Fees Fees charged to students for registration accomplished after the normal registration period has been closed.","Fee Waiver-Late Fees","Distance Education Fee Fees charged to students participating in a Distance Education Program. These fees help offset the additional costs involved in providing Distance Education.","Distance Education Fee Fall","Distance Education Fee Spring","Distance Education Fee Summer","Application Fees Fees charged to students at the time of application for acceptance into the institution. Although these fees produce revenue, one of their purposes is to ensure that the applicant is serious about attending the institution.","Application Fees-Housing","Forfeited Housing Deposit","Applied Music Fees Fees charged to students receiving individual music instruction.","Applied Instruction – Other Fees charged to students receiving individual or special types of instruction. This includes lab fees.","Studio Fee","Transcript Fee A fee charged to students for providing copies of transcripts.","Student Returned Checks Fee A fee charged to students who have sent checks to the institution that are returned unpaid from the bank.","Institutional Fee A mandatory student fee applicable to all institutions that was first mandated by the Board of Regents in FY2009 as a response to state budget cuts.","Fee Waiver-Institutional Fee","Student Fees – Other Any other student fee not properly classified in a previous account.","Greens/Golf Fees","Geology Fees","Lab Fees (409983 \u003d Waiver-Lab Fees)","Campus Card Fees (409985 \u003d Waiver-Campus Card Fees)","Nursing Program Testing Fees (409987 \u003d Waiver-Nursing Testing Fees)","Student Fees-Science Lab","Compass Retesting Fees","Test Fees","Flight Fees","Simulator Fees","PE Lab Fees","Student Center Fees","Drug Testing Fees","Portfolio Assessment Fees","Biology Field Studies Fees","Photography Fees","Georgia History Fees","Graduation Fees","Aviation Lab/Program Fees","Education Program Fees","Franchise Middle Grades-Other Revenue Revenue, other than tuition, generated by the Consortial Program.","Franchise ESOL-Other Revenue Revenue, other than tuition, generated by the Consortial Program.","Inactive 3/30/2015 – Use ACCT 494500 - VA Reporting Fee","HSDA Service Leaning Course","Life Guard Training Fees","Field Placement","Modern Language Fees","Foundations of Leadership Fees","Art Fees","Art Fees Tier Two","Natural Science Lab Fees","Health Science Lab Fees","Gross Anatomy Fees","Franchise International Affairs In State-Other Revenue Revenue, other than tuition, generated by the Consortial Program.","Non Mandatory – International Student Fees","Human Services Delivery","Social Sciences-P-5 Fees","Bowling Fees","CPR-First Aid Fees","Horseback Riding Fees","Karate Fees","Rock Climbing-Rappelling Fees","Scuba Fees","Wilderness Survival Fees","Yoga Fees","Campus Infrastructure and Improvement Fees","Late Payment Fees","Fees-Orientation","Fee Waiver-Orientation Fees","GAMES Orientation Fees","Online IT Fees","Field Internship Fees","Waiver-Lab Fees","Waiver-Campus Card Fees","Waiver-Nursing Testing Fees","Allowance for Doubtful Revenue – Tuition and Fees The funding source (contra-revenue) used to fund the reserve for uncollectible accounts associated with Tuition and Fees. See section 10.4.1 for further information.","Sponsored and Unsponsored Scholarships A contra account used to post a “scholarship allowance” amount that eliminates the double counting of certain revenues. Public institutions, after adoption of GASB Statements 34 and 35, should report tuition discounts and allowances and scholarships generally as reductions of tuition and fees revenues. See NACUBO Advisory Report 2000-5 and the BOR spreadsheet for “Sponsored and Unsponsored Scholarships” for calculation information."]],"pageTitle":"Business Procedures Manual - University System of Georgia","title":"","url":"http://www.usg.edu/business_procedures_manual/section2/manual/2.2_fund_group","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"RELATION","tableNum":47,"s3Link":"common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986423.95/warc/CC-MAIN-20150728002306-00297-ip-10-236-191-2.ec2.internal.warc.gz","recordEndOffset":810062811,"recordOffset":809993533,"tableOrientation":"HORIZONTAL","TableContextTimeStampAfterTable":"{96196\u003dThis source of funding will be used for all Federal Stimulus funds received through the State Appropriation process, as well as Federal Stimulus funds received as Restricted Funds/Grants, starting in FY 2010., 36435\u003dGeorgia Code 20-3-86 allows for Technology Fee year-end fund balances to be exempt from state law concerning lapsable funds. Technology Fee Revenues and Expenditures shall be contained in Fund Group 16000*., 34004\u003dGeorgia Code 20-3-86 allows for indirect cost recovery year-end fund balances to be exempt from state law concerning lapsable funds. Indirect Cost Recovery Revenues and Expenditures shall be contained in Fund Group 15000.* Indirect Cost Recovery Revenues that are contained in Fund 10000 are subject to lapsing., 96454\u003dThis source of funding will be used for all Federal Stimulus funds received through the State Appropriation process, as well as Federal Stimulus funds received as Restricted Funds/Grants, starting in FY 2011., 31070\u003dGeorgia Code 20-3-86 allows for Departmental Sales and Services (DSS) year-end fund balances to be exempt from state law concerning lapsable funds. DSS Revenues and Expenditures shall be contained in Fund Group 14000.*, 43931\u003dAn accounting entity in which the funds derived from internal and external sources are to be used for construction, maintenance, and/or acquisition of Capital Assets. The intended use of fund 50000 is to allow construction funds to be set aside for future use. When assets are purchased, the money should be transferred to the appropriate fund (i.e. fund 10000 for Educational and General assets, 12000 for Auxiliary assets, etc.) and the assets should be purchased from that fund. An alternative is to transfer assets to the appropriate fund when placed in service.}","lastModified":"Wed, 29 Jul 2015 11:30:17 GMT","textBeforeTable":"An accounting entity in which are recorded revenues, expenditures, and balances of funds earmarked for current operations of the educational program of the college or university. Restricted revenues and expenditures are to be recorded in Fund Group 20000, separately identified and matched in amount with restricted revenues. 10xxx EDUCATION and GENERAL 2.2.1 Current Funds The Fund Group numbering scheme is standard, and must be used by all USG institutions. If large research institutions need additional fund groups to accomplish internal reporting, approval must be obtained from the Vice Chancellor for Fiscal Affairs at the University System Office (USO) for use of non-standard fund groups. These non-standard fund groups must be mapped into and reported consistent with the standard fund groups. Budget Period is the budget year in which revenues, expenses, and encumbrances originate. Budget period coincides with the State of Georgia fiscal year for budget basis accounting. Note that this is not the same as GAAP basis fiscal year. 2.1.7 Budget Period * Note 2: Institutions using the GeorgiaFIRST model of the PeopleSoft Financials software should refer to the Chart of Accounts section on the Documentation page of the GeorgiaFIRST Financials web site for additional information about the Chart of Accounts for the GeorgiaFIRST implementation. * Note 1: The PeopleSoft Financials software defines account codes to a lower level than this manual. 112003 Petty Cash – Plant Operations 112002","textAfterTable":"21100 Student Housing This sub-function includes expenditures of funds for providing housing for students. 21199 Student Housing (R \u0026 R) This sub-function is used to classify renovation and repair projects within the Student Housing function. 21200 Faculty and Staff Housing This sub-function includes expenditures of funds for providing housing for Faculty and Staff. 21299 Faculty and Staff Housing (R \u0026 R) This sub-function is used to classify renovation and repair projects within the Faculty and Staff Housing function. 22xxx FOOD SERVICES This function shall include those funds expended to provide food service to students, faculty, and staff. Code Description 22100 Cafeteria This sub-function shall include those funds expended to provide cafeteria food service to students, faculty, and staff. 22199 Cafeteria (R \u0026 R) This sub-function is used to classify renovation and repair projects within the Cafeteria function. 22200 Snack Bars This sub-function shall include those funds expended to provide snack bar food service to students, faculty, and staff. 22299 Snack Bars (R \u0026 R) This sub-function is used to classify renovation and repair projects within the Snack Bar function. 23xxx STORES AND SHOPS Code Description 23100 Stores and Shops This sub-function shall include those funds expended to provide for the operation stores and shops such as bookstores, gift","hasKeyColumn":false,"keyColumnIndex":-1,"headerRowIndex":0}