{"relation":[["Order Total","Under $50","Over $50","Over $75","Over $100","Over $125","Over $150","Over $175","Over $200","Over $225","Over $250","Over $300"],["FedEx 2 Day Express","$12.99","$14.99","$16.99","$19.99","$21.99","$23.99","$25.99","$28.99","$30.99","$32.99","$37.99"],["FedEx Overnight","$19.99","$23.99","$25.99","$28.99","$31.99","$34.99","$36.99","$38.99","$41.99","$44.99","$44.99"]],"pageTitle":"Crocs Girls’ Basic Socks 3-pack | Girls’ Socks | Crocs Official Site","title":"","url":"http://www.crocs.com/p/crocs-girls-basic-socks-3-pack/31013.html?cgid\u003dnew-kids-arrivals\u0026cid\u003d518","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"RELATION","tableNum":3,"s3Link":"common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988310.3/warc/CC-MAIN-20150728002308-00100-ip-10-236-191-2.ec2.internal.warc.gz","recordEndOffset":389875355,"recordOffset":389827534,"tableOrientation":"HORIZONTAL","TableContextTimeStampAfterTable":"{127518\u003dEffective Date of this version: May 1, 2013}","textBeforeTable":"U.S. Shipping Rates \u0026 Delivery Estimates* No price adjustments given on \"Final Sale\" items. No exchanges or returns on items marked as \"Final Sale.\" Final Sale Paypal Note: If you made a purchase on crocs.com using Paypal, price adjustments will be processed in the form of a crocs gift card in the amount of the price difference. Prices are guaranteed for 14 days. If an item you buy goes on sale within 14 days of purchase, we’ll honor the new price at your requestin the form of a Crocs gift card with a valid receipt, except as stated below for \"Final Sale\" items. The price adjustment policy applies to price changes that occur within the 14-day period following your purchase only. Price Adjustment Policy See return instructions. Paypal Note: At this time we are unable to credit Paypal orders when items are returned to a crocs owned store. If you made a purchase online using Paypal and are returning your item(s) to a crocs owned store, you will receive a crocs gift card in the amount of the return refund, redeemable at Crocs owned stores or at crocs.com. Retail partners such as sporting goods stores and department stores will not accept Crocs.com purchases for return. Please note: We do not cover shipping and handling costs for returns. We","textAfterTable":"$14.99 $23.99 Over $75 $16.99 $25.99 Over $100 $19.99 $28.99 Over $125 $21.99 $31.99 Over $150 $23.99 $34.99 Over $175 $25.99 $36.99 Over $200 $28.99 $38.99 Over $225 $30.99 $41.99 Over $250 $32.99 $44.99 Over $300 $37.99 $44.99 Shipping notes: • Crocs.com ships to addresses within the U.S., U.S. Territories, and APO/FPO/DPO addresses. For International deliveries please see below • Expedited shipping methods are not available for PO Boxes. • Delivery estimates apply to orders shipped within the lower 48 United States. • Delivery to Alaska, Hawaii, Puerto Rico and Virgin Islands may take 3-4 weeks via Economy delivery. • APO/FPO deliveries may take 4-6 weeks via Economy delivery. • Orders are not shipped or delivered on weekends or holidays. International Orders For International deliveries please shop the crocs site that serves your destination country. To see a full list of crocs online properties in Europe, Asia and the Americas, click here. Crocs.com Privacy Policy Effective Date of this version: May 1, 2013 Thank you for visiting crocs.com, including the Crocs online store. This Website is operated by Crocs Retail, LLC., located at 7477 East Dry Creek Parkway, Niwot,","hasKeyColumn":false,"keyColumnIndex":-1,"headerRowIndex":0}