{"relation":[["Country","Albania","Algeria","Angola","Argentina","Australia","Austria","Bahamas","Bangladesh","Belgium","Belize","Bhutan","Bolivia","Bosnia and Herzegovina","Brazil","Bulgaria","Burma","Canada","Chile","China, People\u0027s Republic of","Croatia","Cuba","Cyprus","Denmark","Djibouti","Ecuador","Egypt","El Salvador","Finland","France","Gambia, The","Germany","Greece","Grenada","Hungary","India","Indonesia","Iran","Israel","Jamaica","Japan","Jordan","Korea, North","Korea, South","Kuwait","Lebanon","Libya","Lithuania","Luxembourg","Macedonia, Republic of","Malaysia","Maldives","Malta","Mexico","Moldova","Nepal","Netherlands","New Zealand","Norway","Pakistan","Philippines","Poland","Qatar","Romania","Russia","Rwanda","Saudi Arabia","Seychelles","Singapore","Slovenia","South Africa","Spain","Swaziland","Switzerland","Syria","Taiwan (Republic of China) [102]","Thailand","Tonga","Trinidad and Tobago","Turkey","United Kingdom","United States","Vanuatu","Venezuela"],["Land area (km2) [49]","27,398","2,381,740","1,246,700","2,736,690","7,617,930","82,444","10,070","133,910","30,278","22,806","47,000","1,084,390","51,197","8,456,510","110,550","657,740","9,984,670","748,800","9,326,410","56,414","110,860","9,240","42,394","22,980","276,840","995,450","20,720","304,473","640,053[76]","10,000","349,223","130,800","344","92,340","2,973,190","1,826,440","1,636,000","20,330","10,831","374,744","91,971","120,538[85]","98,190","17,820","10,230","1,759,540","65,300[91]","2,586","24,856","328,550","300","316","1,923,040","33,371","143,181","33,883","268,021","307,442","778,720","298,170","304,459","11,437","230,340","16,995,800","24,948","2,149,690","455","682.7","20,151","1,219,912","499,542","17,203","39,770","184,050","32,260","511,770","718","5,128","770,760","241,590","9,161,923","12,200","882,050"],["GDP nominal (US$M)[50]","$11,800","$159,000","$85,810","$351,000","$1,220,000","$366,300","$7,538","$100,100","$461,300","$1,431","$1,397","$19,180","$16,320","$2,024,000","$44,840","$35,650","$1,334,140","$199,200","$5,745,000","$59,920","$57,490","$22,750","$311,900","$1,139","$56,500","$127,900","$21,800","$238,000","$2,555,000","$1,040","$3,306,000","$302,000","$645","$132,300","$1,099,000","$695,100","$337,900","$201,300","$13,740","$5,391,000","$27,130","$28,000[85]","$986,300","$117,300","$39,150","$77,910","$35,730","$52,430","$9,170","$219,000","$1,433","$7,801","$1,004,000","$5,357","$15,110","$770,300","$138,000","$413,500","$174,800","$188,700","$470,000","$126,500","$158,400","$1,290,000","$5,693","$434,400","$919","$233,900","$46,440","$354,400","$1,375,000","$3,165","$522,400","$59,630","$427,000","$312,600","$301","$21,200","$729,100","$2,259,000","$14,620,000","$721","$285,200"],["Per capita GDP (US$)[51]","$2,949.57","$3,948.01","$5,003.43","$8,662.99[56]","$44,474.51","$45,598.77","$21,547.17","$481.36","$43,648.01","$4,327.67","$561.89","$1,446.41","$3,246.78","$6,915.40","$5,409.09","$285.60","$40,457","$10,058.50","$2,459.43","$11,430.32","$4,000.34","$27,014.79","$57,039.71","$1,694.29","$3,211.76","$1,592.08","$2,931.75","$46,769.47","$35,240.62","$386.77","$40,315.05","$29,384.60","$6,557.67","$13,901.01","$972.68","$1,844.53","$4,497.11","$25,191.86","$4,032.18","$34,402.26","$2,644.89","$1,800.00[85]","$19,514.81","$44,421.22","$6,276.90","$9,451.85","$10,725.96","$104,451.69","$3,646.55","$7,513.71","$2,842.58","$18,460.73","$8,218.88","$978.36","$333.09","$46,389.35","$31,124.18","$84,595","$872.88","$1,582.17","$10,911.71","$74,688.97","$7,451.95","$9,124.49","$335.10","$13,622.68","$8,669.64","$35,427.12","$22,933.99","$6,423.04","$35,576.37","$2,591.20","$56,111.06","$1,954.98","$16,768.11","$3,776.0","$1,873.06","$19,590.99","$9,322.83","$45,626.38","$45,958.70","$2,146.52","$9,084.09"],["Population[52]","2,994,667","34,994,937","13,338,541","41,769,726","21,766,711","8,217,280","313,312","158,570,535","10,431,477","321,115","708,427","10,118,683","4,622,163","203,429,773","7,093,635","53,999,804","34,733,000","16,888,760","1,336,718,015","4,483,804","11,087,330?","1,120,489","5,529,888","757,074","15,007,343","81,713,520","6,071,774","5,259,250","65,102,719","1,797,860","81,471,834","10,760,136","108,419","9,976,062","1,147,995,904","245,613,043","77,891,220","7,473,052","2,868,380","126,475,664","6,508,271","24,457,492[85]","48,754,657","2,595,628","4,143,101","6,597,960","3,535,547","503,302","2,077,328","28,728,607","394,999","408,333","113,724,226","4,314,377","29,391,883","16,847,007","4,290,347","4,691,849","187,342,721","101,833,938","38,441,588","848,016","21,904,551","140,702,096","10,186,063","26,131,703","89,188","4,740,737","2,000,092","49,004,031","46,754,784","1,370,424","7,639,961","19,747,586","23,071,779","66,720,153","105,916","1,227,505","78,785,548","62,698,362","313,232,044","224,564","27,635,743"],["Government[53]","Parliamentary Democracy","Republic","Republic; Multiparty Presidential Regime","Republic","Federal Parliamentary Democracy","Federal Republic","Constitutional Monarchy with a parliamentary system of government","Parliamentary Democracy","Federal Parliamentary Democracy under Constitutional Monarchy","Parliamentary Democracy","Constitutional Monarchy","Republic","Emerging Federal Democratic Republic","Federal Republic","Parliamentary Democracy","Military Junta","Federal Parliamentary Democracy","republic","Communist State","presidential/parliamentary democracy","Communist state","republic[71]","constitutional monarchy","republic","republic","republic","republic","republic","republic","republic","federal parliamentary republic","parliamentary republic","parliamentary democracy","parliamentary democracy","federal republic","republic","theocratic republic","parliamentary democracy","constitutional parliamentary democracy","constitutional monarchy with a parliamentary government","constitutional monarchy","Communist state one-man dictatorship[85]","republic","constitutional emirate","Sources differ[89]","Caretaker government as of October 2011[update][90]","parliamentary democracy","constitutional monarchy","parliamentary democracy","constitutional monarchy","republic","republic","federal republic","republic","democratic republic","constitutional monarchy","parliamentary democracy","constitutional monarchy","federal republic","republic","republic","emirate","republic","federation","republic; presidential","monarchy","republic","parliamentary republic","parliamentary republic","republic","parliamentary monarchy","monarchy","a confederation only in name, legally and structurally a federal republic","republic under an authoritarian military-dominated regime","multiparty democracy","constitutional monarchy","constitutional monarchy","parliamentary democracy","republican parliamentary democracy","constitutional monarchy and Commonwealth realm","federal republic","parliamentary republic","federal republic"],["Conscription[54]","No (abolished in 2010[55])","Yes","Yes","No. Voluntary; conscription may be ordered for specified reasons; per Public Law No.24.429 promulgated on 5 January 1995.","No (abolished by parliament in 1972[57])","Yes (Alternative service available)[58]","No","No","Conscription was abolished as of 1 January 1994 under the so-called Delacroix Bill of 6 July 1993[59]) Suspended (conscription suspended as of 1 January 1994)[citation needed]","No. Military service is voluntary.","No[60]","Yes (when annual number of volunteers falls short of goal[61])","No (Abolished on January 1, 2006.[62])","Yes","No (abolished by law on January 1, 2008[63])","sources differ Yes but not enforced as of January 2011[update].[64][65][66][67][68] No (FWCC[69])","No","Yes","No, Legal under Constitution but has not yet been practiced in history","No (abolished by law in 2008[70])","Yes","Yes (Alternative service available[72][73][74])","Yes (Alternative service available[72][73][75])","No","Yes","Yes","No. Legal, not practiced.","Yes (Alternative service available)","No (suspended in 2001[77])","No","No (abolished for peacetime by federal legislature effective from 1 July 2011[78])","Yes","No (no military service)","No (Peacetime conscription abolished in 2004[79])","No","sources differ Yes, selective conscription (FWCC[69]) No[80][81][82]","Yes","Yes","No","No","sources differ Yes. The government decided in 2007 to reintroduce conscription, which had been suspended in 1999.[83] No. Suspended indefinitely in 1992 and all members of the armed forces are regular volunteers.[54] No. Conscription at age 18 was suspended in 1999, although all males under age 37 are required to register.[84]","Yes[85][86]","Yes","Yes","No (abolished in 2007)[88])","Yes","No (Suspended on September 15, 2008[92])","No","No (abolished in 2006)[93]","No","No","No","Yes","Yes","No","No. Legal, suspended since 1997 (except for Cura?ao and Aruba[citation needed]). [94] See also: Conscription in the Netherlands","No, Conscription Abolished in December 1972.","Yes","No","Yes. Legal.[95] Practiced selectively and only rarely.[96] However, military training (known as Citizenship Advancement Training or CAT, formerly known as Citizen\u0027s Army Training) is required as a prerequisite for graduation from high school. CAT is considered a subject in high school that lasts up to 2 hours per week.","No[97]","No","No (ended in 2007[98])","Yes (Alternative service available[citation needed])","No","No","Yes","Yes","No[99]","No (ended in 1994, formalized in 2002)[100]","No (abolished by law on December 31, 2001[101])","No","Yes","Yes","Yes (alternative service available[103]) An all-volunteer force is planned by the end of 2014, but conscription will remain in practice thereafter.[104]","Yes","No","No","Yes","No (except Bermuda Regiment[105])","No[106] Draft abolished in 1975 by President Gerald Ford; however Males between 18-25 need to register with the U.S. Selective Service System.","No","Yes[107][108]"]],"pageTitle":"Conscription - Wikipedia, the free encyclopedia","title":"Conscription by country ? Examples","url":"http://en.wikipedia.org/wiki/Conscript","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"RELATION","tableNum":3,"s3Link":"","recordEndOffset":0,"recordOffset":0,"tableOrientation":"HORIZONTAL","TableContextTimeStampBeforeTable":"{1146\u003dAs of the early 21st century, many states no longer conscript soldiers, relying instead upon professional militaries with volunteers enlisted to meet the demand for troops. The ability to rely on such an arrangement, however, presupposes some degree of predictability with regard to both war-fighting requirements and the scope of hostilities. Many states that have abolished conscription therefore still reserve the power to resume it during wartime or times of crisis.[4] In the United States, conscription, also called \"the draft\", ended in 1973, but males between 18 and 25 are required to register with the Selective Service System to enable a reintroduction of conscription if necessary., 2601\u003dIn China, the State of Qin instituted universal military service following the registration of every household.[2] This allowed huge armies to be levied, and was instrumental in the creation of the Qin Empire that conquered the whole of China in 221BC.}","TableContextTimeStampAfterTable":"{15726\u003dIn later years, Sultans turned to the Barbary Pirates to supply their Jannissaries corps. Their attacks on ships off the coast of Africa or in the Mediterranean, and subsequent capture of able bodied men for ransom or sale provided some captives for the Sultan\u0027s system. Starting in the 17th century, Christian families living under the Ottoman rule began to submit their sons into the Kapikulu system willingly, as they saw this as a potentially invaluable career opportunity for their children. Eventually the Sultan turned to foreign volunteers from the warrior clans of Circassians in southern Russia to fill his Janissary armies. As a whole the system began to break down, the loyalty of the Jannissaries became increasingly suspect. Mahmud II forcibly disbanded the Janissary corps in 1826.[11][12], 32716\u003dAlthough both North and South resorted to conscription during the Civil War, in neither nation did the system work effectively. The Confederate congress on April 16, 1862, passed an act requiring military service for three years from all males aged eighteen to thirty-five not legally exempt, and it later extended the obligation. The U.S. Congress followed on July 17, 1862, with an act authorizing a militia draft within a state when it could not meet its quota with volunteers. This state-administered system failed in practice and on March 3, 1863, Congress passed the first genuine national conscription law, setting up under the Union army an elaborate machinery for enrolling and drafting men between twenty and forty-five years of age., 16943\u003dSimilar to the Janissaries in origin and means of development were the Mamluks of Egypt in the Middle Ages. The Mamluks were usually captive non-Muslim Iranian and Turkish children who had been kidnapped or bought as slaves from the Barbary coasts. The Egyptians assimilated and trained the boys and young men to become Islamic soldiers who served the Muslim caliphs and the Ayyubid sultans during the Middle Ages. The first mamluks served the Abbasid caliphs in 9th century Baghdad. Over time they became a powerful military caste. On more than one occasion, they seized power, for example, ruling Egypt from 1250?1517., 28903\u003dIn all, 8,000,000 men were drafted, as well as several hundred thousand women.[22] The introduction of conscription in May 1939, before the war began, was largely due to pressure from the French, who emphasized the need for a large British army to oppose the Germans.[23] Starting in early 1942 unmarried women age 19-30 were conscripted. Most were sent to the factories, but they could volunteer for the Auxiliary Territorial Service (ATS) and other women\u0027s services. None were assigned to combat roles unless they volunteered. By 1943 women were liable to some form of directed labour up to age 51. During the Second World War, 1.4 million British men volunteered for service and 3.2 million were conscripted. Volunteers comprised 20% of the Army, 40% of the Royal Navy, and 50% of the Royal Air Force.[24], 26960\u003dIn the European part of Netherlands, compulsory attendance has been officially suspended since 1 May 1997. Between 1991 and 1996, the Dutch armed forces phased out their conscript personnel and converted to an all-volunteer force. The last conscript troops were inducted in 1995 and demobilized in 1996. The suspension means that citizens are no longer forced to serve in the armed forces, as long as it is not required for the safety of the country. Since then, the Dutch army is an all-volunteer force. However, to this day every male citizen aged 17 gets a letter in which he is told that he has been registered, but he does not have to present himself for service. The Dutch army allowed its male soldiers to have long hair from the early 1970s to the end of conscription in the mid 1990s., 23597\u003dThe range of eligible ages for conscripting was expanded to meet national demand during the World Wars. In the United States, the Selective Service System drafted men for World War I initially in an age range from 21 to 30 but expanded its eligibility in 1918 to an age range of 18 to 45.[19] In the case of a widespread mobilization of forces where service includes homefront defense, ages of conscripts may range much higher, with the oldest conscripts serving in roles requiring lesser mobility. Expanded-age conscription was common during the Second World War: in Britain, it was commonly known as \"call-up\" and extended to age 51. Nazi Germany termed it Volkssturm (\"People\u0027s Storm\") and included men as young as 16 and as old as 60.[20] During the Second World War, both Britain and the Soviet Union conscripted women. The United States was on the verge of drafting women into the Nurse Corps because it anticipated it would need the extra personnel for its planned invasion of Japan. However the Japanese surrendered and the idea was abandoned.[21], 30112\u003dThe abolition of conscription in Britain was announced on 4 April 1957 by recently elected prime minister Harold Macmillan, with the last conscripts being recruited three years later.[25], 18038\u003dFrom 1250 Egypt had been ruled by the Bahri dynasty of Kipchak origin. Slaves from the Caucasus served in the army and formed an elite corp of troops. They eventually revolted in Egypt to form the Burgi dynasty. The Mamluks\u0027 excellent fighting abilities, massed Islamic armies, and overwhelming numbers succeeded in overcoming the Christian Crusader fortresses in the Holy Land. The Mamluks were the most successful defense against the Mongol Ilkhanate of Persia and Iraq from entering Egypt.[13], 45107\u003dIn 2002, Sweden considered female conscription on the grounds that excluding them goes against the ideology of equality., 46563\u003dIn 1981 in the United States, several men filed lawsuit in the case Rostker v. Goldberg, alleging that the Selective Service Act of 1948 violates the Due Process Clause of the Fifth Amendment by only requiring that men register with the Selective Service System (SSS). The Supreme Court eventually upheld the Act, stating that \"the argument for registering women was based on considerations of equity, but Congress was entitled, in the exercise of its constitutional powers, to focus on the question of military need, rather than \u0027equity.\u0027\"[44], 38498\u003dIn 1940 Congress passed the first peace-time draft legislation, which was led by Grenville Clark. It was renewed (by one vote) in summer 1941. It involved questions as to who should control the draft, the size of the army, and the need for deferments. The system worked through local draft boards comprising community leaders who were given quotas and then decided how to fill them. There was very little draft resistance.[29], 54414\u003dIn the USA and some other countries, the Vietnam War saw new levels of opposition to conscription and the Selective Service System. Many people opposed to and facing conscription chose to either apply for classification and assignment to civilian alternative service or noncombatant service within the military as conscientious objectors, or to evade the draft by fleeing to a neutral country. A small proportion, like Muhammad Ali, chose to resist the draft by publicly and politically fighting conscription. Some people resist at the point of registration for the draft. In the USA around 1970, for example, the draft resistance movement has focused on mandatory draft registration. Others resist at the point of induction, when they are ordered to put on a uniform, when they are ordered to carry or use a weapon, or when they are ordered into combat., 40939\u003dAs of 2010[update], countries that were drafting women into military service included Benin,[31] Chad[32] China,[33] Cuba,[34] Eritrea,[33][35][36] Israel,[33][35][37] Libya,[33][38] Malaysia,[33][35] North Korea,[33][35][39] Peru,[33][35] Taiwan,[33][35][(see discussion) verification needed] and Tunisia.[35] In the United Kingdom during World War II, beginning in 1941, women were brought into the scope of conscription but, as all women with dependent children were exempt and many women were informally left in occupations such as nursing or teaching, the number conscripted was relatively few.[40], 22515\u003dIn the Russian Empire, the military service time \"owed\" by serfs was 25 years at the beginning of the 19th century. In 1834 it was decreased to 20 years. The recruits were to be not younger than 17 and not older than 35.[17] In 1874 Russia introduced universal conscription in the modern pattern, an innovation only made possible by the abolition of serfdom in 1861. New military law decreed that all male Russian subjects, when they reached the age of 20, were eligible to serve in the military for six years.[18], 53132\u003dThe New York Draft Riots (July 11 to July 16, 1863; known at the time as Draft Week), were violent disturbances in New York City that were the culmination of discontent with new laws passed by Congress to draft men to fight in the ongoing American Civil War. The Central Asian Revolt started in the summer of 1916, when the Russian Empire government ended its exemption of Muslims from military service. The conscription also became unpopular in Grand Duchy of Finland during the reign of Nicholas II and was suspended; instead Finland paid a levy tax, \"military millions\" as compensation for abolition of conscription., 57653\u003dToward the end of the US draft, an attempt was made to make the system somewhat fairer by turning it into a lottery, with each of the year\u0027s calendar dates randomly assigned a number. Men born on lower numbered dates were called up for review. For the reasons given above, this did not make the system any fairer, and the entire system ended in 1973. By 1975, the draft was no longer mandatory. Today, American men aged 18?25 are encouraged to sign up for the Military, but there has not been a call-up since the Vietnam Era., 14132\u003dIn the middle of the 14th century, Ottoman Sultan Murad I developed personal troops to be loyal to him, with a slave army called the Kap?kulu. The new force was built by taking Christian children from newly conquered lands, especially from the far areas of his empire, in a system known as the dev?irme (translated \"gathering\" or \"converting\"). The captive children were persuaded to convert to Islam. The Sultans had the young boys trained over several years. Those who showed special promise in fighting skills were trained in advanced warrior skills, put into the sultan\u0027s personal service, and turned into the Janissaries, the elite branch of the Kap?kulu. A number of distinguished military commanders of the Ottomans, and most of the imperial administrators and upper-level officials of the Empire, such as Pargal? ?brahim Pasha and Sokollu Mehmet Pa?a, were recruited in this way.[9] By 1609 the Sultan\u0027s Kap?kulu forces increased to about 100,000.[10], 98594\u003dIn 1917, a number of radicals and anarchists, including Emma Goldman, challenged the new draft law in federal court arguing that it was a direct violation of the Thirteenth Amendment\u0027s prohibition against slavery and involuntary servitude. However the Supreme Court unanimously upheld the constitutionality of the draft act in the case of Arver v. United States on January 7, 1918. The decision said the Constitution gave Congress the power to declare war and to raise and support armies. The Court emphasized the principle of the reciprocal rights and duties of citizens:, 25701\u003dConscription, which was called \"Service Duty\"(Dutch: dienstplicht) in the Netherlands, was first employed in 1810 by French occupying forces. Napoleon\u0027s brother Louis Bonaparte, who was King of Holland from 1806 to 1810, had tried to introduce conscription a few years earlier, unsuccessfully. Every man aged 20 years or older had to enlist. By means of drawing lots it was decided who had to undertake service in the French army. It was possible to arrange a substitute against payment., 5666\u003dAround the reign of Hammurabi (1792-1750 BCE), the Babylonian Empire used a system of conscription called Ilkum. Under the system those eligible were required to serve in the royal army in time of war.[5] During times of peace they were instead required to provide labour for other activities of the state.[5] In return for this service, those subject to it gained the right to hold land.[5] It is possible that this right was not to hold land per se but specific land supplied by the state.[5], 8116\u003dUniversal conscription in China dates back to the State of Qin, which eventually became the Qin Empire of 221BC. Following unification, historical records show that a total of 300,000 conscript soldiers and 500,000 conscript labourers constructed the Great Wall of China[7], 39193\u003dThe nation went from a surplus manpower pool with high unemployment and relief in 1940 to a severe manpower shortage by 1943. Industry realized that the Army urgently desired production of essential war materials and foodstuffs more than soldiers. (Large numbers of soldiers were not used until the invasion of Europe in summer 1944.) In 1940-43 the Army often transferred soldiers to civilian status in the Enlisted Reserve Corps in order to increase production. Those transferred would return to work in essential industry, although they could be called back to active duty if the Army needed them. Others were discharged if their civilian work was deemed absolutely essential. There were instances of mass releases of men to increase production in various industries. Blacks and Asians were drafted under the same terms as whites., 47783\u003dOn October 1, 1999 in the Taiwan Area, the Judicial Yuan of the Republic of China in its Interpretation 490 considered that the physical differences between males and females and the derived role differentiation in their respective social functions and lives would not make drafting males only violating the Constitution of the Republic of China.[45][(see discussion) verification needed] Though women are conscripted in Taiwan, transsexual persons are exempt.[46], 20041\u003dModern conscription, the massed military enlistment of national citizens, was devised during the French Revolution, to enable the Republic to defend itself from the attacks of European monarchies. Deputy Jean-Baptiste Jourdan gave its name to the 5 September 1798 Act, whose first article stated: \"Any Frenchman is a soldier and owes himself to the defense of the nation.\" It enabled the creation of the Grande Arm?e, what Napoleon Bonaparte called \"the nation in arms,\" which overwhelmed European professional armies that often numbered only into the low tens of thousands. More than 2.6 million men were inducted into the French military in this way between the years 1800 and 1813.[15], 32094\u003dIn 1814, President James Madison proposed conscription of 40,000 men for the army, but the War of 1812 ended before Congress took any action. An 1840 proposal for a standing army of 200,000 men included conscription, but it never passed and military service was voluntary before 1862.[26], 36210\u003dIn 1917 the administration of Woodrow Wilson decided to rely primarily on conscription, rather than voluntary enlistment, to raise military manpower for World War I. The Selective Service Act of 1917 was carefully drawn to remedy the defects in the Civil War system and?by allowing exemptions for dependency, essential occupations, and religious scruples?to place each man in his proper niche in a national war effort. The act established a \"liability for military service of all male citizens\"; authorized a selective draft of all those between twenty-one and thirty-one years of age (later from eighteen to forty-five); and prohibited all forms of bounties, substitutions, or purchase of exemptions. Administration was entrusted to local boards composed of leading civilians in each community. These boards issued draft calls in order of numbers drawn in a national lottery and determined exemptions. In 1917 and 1918 some 24 million men were registered and nearly 3 million inducted into the military services, with little of the resistance that characterized the Civil War.[28], 31198\u003dIn America before 1862, combat duty was always voluntary, but white men aged 18 to 45 were usually required to join local militia units. Colonial militia laws?and after 1776 those of the states?required able-bodied white men to enroll in the militia and to undergo a minimum of military training, all without pay. Colonial Pennsylvania (controlled by Quakers) did not have such laws. Members of pacifist religious denominations were exempt. When combat troops were needed some of the militiamen volunteered for short terms of service, for which they were paid. Following this system in its essentials, the Continental Congress in 1778 recommended that the states draft men from their militias for one year\u0027s service in the Continental army; this first national conscription was irregularly applied and failed to fill the Continental ranks., 28570\u003dBritain introduced conscription for the first time in 1916 (halfway through World War I) and abolished it in 1920, and reintroduced it again in 1939 on the outbreak of World War II. It remained in force until 1960., 33538\u003dQuotas were assigned in each state, the deficiencies in volunteers to be met by conscription. But men drafted could provide substitutes or, until mid-1864, avoid service by paying commutation money. Many eligibles pooled their money to cover the cost of anyone drafted. Families used the substitute provision to select which man should go into the army and which should stay home. There was much evasion and overt resistance to the draft, especially in Catholic areas. The great draft riot in New York City in July 1863 involved Irish immigrants who had been signed up as citizens to swell the machine vote, not realizing it made them liable for the draft. Of the 168,649 men procured for the Union through the draft, 117,986 were substitutes, leaving only 50,663 who had their personal services conscripted., 90272\u003dAn all-volunteer force is planned by the end of 2014, but conscription will remain in practice thereafter.[104]}","lastModified":"","textBeforeTable":"Military service Main article: [edit] Countries with and without mandatory military service In Israel, the Muslim and Christian Arab minority are exempt from mandatory service, as are permanent residents such as the Druze of the Golan Heights. Male Ultra-Orthodox Jews may apply for a deferment of draft to study in Yeshiva, and the deferment tends to become an exemption, while female religious Jews can be exempted after presenting \"religious declaration\" to the IDF authorities, and some (primarily National Religious or Modern Orthodox) choose to volunteer for national service instead. Male Druze and Circassian Israeli citizens are liable, by agreement with their community leaders (Female Druze and Circassian are exempt from service). Members of the exempted groups can still volunteer, but very few do, except for the Bedouin where a relatively large number have tended to volunteer (usually for financial reasons). Toward the end of the US draft, an attempt was made to make the system somewhat fairer by turning it into a lottery, with each of the year\u0027s calendar dates randomly assigned a number. Men born on lower numbered dates were called up for review. For the reasons given above, this did not make the system any fairer, and the entire system ended in 1973. By 1975, the draft was no longer mandatory. Today, American men aged 18?25 are encouraged","textAfterTable":"[edit] Conscription by jurisdiction Conscription in Australia Conscription in Cyprus Conscription in Canada Conscription in Egypt Conscription in Finland Conscription in Germany Conscription in Gibraltar Conscription in Greece Conscription in Israel Conscription in Malaysia Conscription in Mexico Conscription in New Zealand Conscription in Russia Conscription in Serbia Conscription in Singapore Conscription in South Korea Conscription in Switzerland Conscription in the Netherlands Conscription in the Ottoman Empire Conscription in the Republic of China(Taiwan) Conscription in the Russian Empire Conscription in the United Kingdom Conscription in the United States Conscription in Turkey Conscription in Western Sahara Taliban conscription [edit]","hasKeyColumn":true,"keyColumnIndex":0,"headerRowIndex":0}