{"relation":[["Publication","Daily Mail","Sunday People","Daily Mirror","Mail on Sunday","News of the World","Sunday Mirror","Best Magazine","Evening Standard","The Observer","Daily Sport","Sunday Times","The People","Daily Express","Weekend Magazine (Daily Mail)","Sunday Express","The Sun","Closer Magazine","Sunday Sport","Night and Day (Mail on Sunday)","Sunday Business News","Daily Record","Saturday (Express)","Sunday Mirror Magazine","Real Magazine","Woman?s Own","Daily Mirror Magazine","Mail in Ireland","Daily Star","Marie Claire","Personal Magazine","Sunday World"],["Number of transactions","952","802","681","266","182","143","134","130","103","62","52","37","36","30","29","24","22","15","9","8","7","7","6","4","4","3","3","2","2","1","1"],["Number of journalists / clients positively identified using services","58","50","45","33","19","25","20","1","4","4","7","19","7","4","8","4","5","1","2","1","2","1","1","1","2","2","1","4","1","1","1"]],"pageTitle":"Obsolete: Revealed: press buying and selling private information on a grand scale follow-up.","title":"","url":"http://www.septicisle.info/2006/12/revealed-press-buying-and-selling_14.html","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"RELATION","tableNum":0,"s3Link":"","recordEndOffset":0,"recordOffset":0,"tableOrientation":"HORIZONTAL","TableContextTimeStampBeforeTable":"{1\u003d12/14/2006 11:23:00 PM | Permalink | | links to this post}","lastModified":"","textBeforeTable":"I intended to write so much today, but as usual the best laid plans are the ones that get binned. While today has proved that this is the most disgusting, despicable and reprehensible government that this country has suffered since the last one, the overwhelming torrent of planned news to overshadow the prime minister\u0027s questioning by police has also obliterated the information commissioner\u0027s publishing of the report (PDF) into how the nation\u0027s newspapers (and magazines) are buying and selling personal and private information from government databases on a grand scale. As expected, his full listing was if anything more damning of the press in this country than the condensed one: Revealed: press buying and selling private information on a grand scale follow-up. Thursday, December 14, 2006  « Home | All that\u0027s fizzy is not explosive... » | Revealed: press buying and selling private informa... » | Scum-watch: So why isn\u0027t the tinsel up on MySpace?... » | Scum-watch: How pathetic can you get? » | Manufacturing hysteria. » | Tolerance for some, not so much for others. » | Unmistakable greed. » | Get in or get out. » | Joy to the world. » | Bringing it home. » ","textAfterTable":"(Many thanks to Spy Blog for the table.) The scale, through just this one private detective, is astounding. Best magazine, published by Hearst, had 20 different employees buying information from Stephen Whittamore, who himself was receiving the information from at least 3 others; one another private investigator, one a retired cop and the other an \"civilian communications officer\", whatever that is, who was based at Tooting police station. The information sold came at a price of at least ?75 a time; if all of Best magazine\u0027s queries cost that amount, then they alone had provided Whittamore and his associates with ?10,050. The Daily Mail\u0027s costs alone, not considering the other requests handled for other Rothermere publications, on that same equation, would have come to ?71,400. Best magazine, for those of you who like me had never heard of it, is according to the Grauniad aimed at middle-aged women. The only website I could find that\u0027s vaguely associated with it is this one here, which has the above logo with a link below to a survey which is no longer open. No doubt all of its transactions into investigating \"real","hasKeyColumn":true,"keyColumnIndex":0,"headerRowIndex":0}