{"relation":[["Call letters","KNBR","KNBR","KSAN","KTHU","KATA","KNCO","KEZK","KMFB","KESP","KPRL","KJFK","KCTC","KKJL","KION","KUIK","KJDX","KPUA","KRKC","KBLF","KFIG","KKXS"],["Frequency","680 AM","1050 AM","107.7 FM","100.7 FM","1340 AM","830 AM","730 AM","96.7 FM","970 AM","1230 AM","1230 AM","1320 AM","1400 AM","1460 AM","1360 AM","93.3 FM","670 AM","1490 AM","1490 AM","1430 AM","96.1 FM"],["City","San Francisco, San Jose, Oakland, CA","San Francisco, San Jose, Oakland, CA","San Francisco, San Jose, Oakland, CA","Chico","Eureka, CA","Grass Valley, CA","Medford, OR","Mendocino, CA","Modesto","Paso Robles, CA","Reno","Sacramento","San Luis Obispo","Salinas","Hillsboro/Portland, OR","Susanville","Hilo","King City","Red Bluff","Fresno","Redding, CA"]],"pageTitle":"49ers.com | On the Radio","title":"","url":"http://www.49ers.com/media-gallery/on-the-radio.html","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"RELATION","tableNum":0,"s3Link":"","recordEndOffset":0,"recordOffset":0,"tableOrientation":"HORIZONTAL","TableContextTimeStampBeforeTable":"{4464\u003dIn addition to full game day coverage that includes a comprehensive live three-hour pre-game show each week and full post game coverage following each game broadcast, KNBR 680, KNBR 1050 and KSAN 107.7 The Bone will air unprecedented week-long coverage of the 49ers from training camp through the NFL playoffs to provide the most extensive up-to-the-minute coverage in the area., 4793\u003dThe 49ers flagship stations include KNBR 680/1050 and KSAN 107.7 The Bone. KNBR 680 and 1050 are the undisputed sports leaders in Northern California. With its dominant 50,000-watt non-directional signal, KNBR 680 reaches all of Northern California during the day and eleven western states at night., 4056\u003dThe 49ers have also signed a multi-year agreement with Marcos Gutierrez Productions (MGP) to broadcast 49ers games in Spanish in the San Francisco Bay Area and in Sacramento. The 49ers will broadcast games on two Spanish language stations KIQI Radio 1010 in San Francisco and KATD 990 in Sacramento. Broadcast duties will be held by Spanish sports announcers Fernando Arias and Ambrosio Rico. Arias will be calling play by plays with Rico adding color commentary.}","TableContextTimeStampAfterTable":"{6070\u003dThe game can also be heard on 49ers Hispanic Radio Network Affiliates, KIQI (1010-AM) and KATD (990-AM), through a partnership with Marcos Gutierrez Productions. Handling broadcast duties will be Spanish sports announcers from the Bay Area, Melvin Moran, Mathias Godinez and Marcos Gutierrez., 8453\u003d© 2011 San Francisco Forty Niners, Ltd.}","lastModified":"","textBeforeTable":"49ers Radio Affiliate Network   A familiar voice in Bay Area radio, Rod Brooks joined the 49ers radio broadcast team as the sideline reporter in 2006. Brooks is in his eleventh year with KNBR and currently co-hosts KNBR 680\u0027s Midday Show: Fitz and Brooks. Brooks mixes knowledge of sports with a hip, down-to-earth perspective of a true sports fan. His style is serious, aggressive, slightly sarcastic and is characterized by his conversationalist approach and constant interactivity with listeners. Rod graduated from LSU with a degree in Broadcast Journalism. Rod Brooks   Davis is the new color analyst for the U.S. Bank 49ers Radio Network. The former 49ers Pro Bowler will team with accomplished play-by-play man Ted Robinson to call the action for all 49ers games. The 13-year NFL veteran (six years with the 49ers) served the past three seasons as the  color analyst for 49ers preseason television broadcasts and co-hosted 49ers Preview, a weekly 49ers program, both on CBS-5 in the Bay Area. For the past two seasons, Davis also served as an analyst for Comcast SportsNet Bay Area?s weekly magazine program, 49ers Central, and a co-host of CSNBA?s 49ers Post Game Live, the ?official? Post Game Show of the 49ers. Eric Davis   In 2009, Ted Robinson became the fifth play-by-play voice in the 63-year history of the organization. Robinson joins a prestigious group of","textAfterTable":"  Spanish Radio The game can also be heard on 49ers Hispanic Radio Network Affiliates, KIQI (1010-AM) and KATD (990-AM), through a partnership with Marcos Gutierrez Productions. Handling broadcast duties will be Spanish sports announcers from the Bay Area, Melvin Moran, Mathias Godinez and Marcos Gutierrez. Melvin Moran (Play-by-play) Dynamic well known radio personality, 20 years experience calling soccer games professionally now contributes his ample talents to the 49er Spanish Broadcast. Matias Godinez (Color commentary) Many years of following the 49ers has made Mathias an expert on the subject. He is also well versed in all the teams and each team\u0027s individual players. Marcos Gutierrez (Sideline) Marcos\u0027s has 30 years of experience in television and radio brodcasting and is an expert on the 49ers team.   © 2011 San Francisco Forty Niners, Ltd. 49ers Site: Team News \u0026 Events Buy Tickets Media Gallery Fans Only Community","hasKeyColumn":true,"keyColumnIndex":0,"headerRowIndex":0}