{"relation":[["Emperor","Augustus","Tiberius","Caligula","Claudius","Nero","Galba","Otho","Vitellius","Vespasian","Titus","Domitian","Nerva","Trajan","Hadrian","Antoninus Pius","Lucius Verus","Marcus Aurelius","Commodus","Pertinax","Didius Julianus","Septimius Severus","Caracalla","Geta","Macrinus with Diadumenian","Elagabalus","Alexander Severus","Maximinus Thrax","Gordian I","Gordian II","Pupienus Maximus","Balbinus","Gordian III","Philip the Arab","Decius with Herennius Etruscus","Hostilian","Trebonianus Gallus with Volusianus","Aemilianus","Valerian","Gallienus","Claudius Gothicus","Quintilus","Aurelian","Tacitus","Florianus","Probus","Carus","Numerian","Carinus","Diocletian","Maximian","Constantius I Chlorus","Galerius","Severus S","Constantine I","Maxentius","Maximinus Daia","Licinius with Valerius Valens Martinianus","Constantine II","Constantius II","Constans","Julian","Jovian","Valentinian I","Valens","Gratian","Valentinian II","Theodosius I","Arcadius","Honorius","Theodosius II","Consantius III","Joannes","Valentinian III","Marcian","Petronius Maximus","Avitus","Majorian","Libius Severus","Anthemius","Olybrius","Glycerius","Julius Nepos","Romulus Augustus","Leo I","Leo II","Zeno","Basiliscus","Anastasius I","Justin I","Justinian I","Justin II"],["Born - Died","63 BC - 14 AD","42 BC - 37AD","12 AD - 41 AD","10 BC - 54 AD","37 AD - 68 AD","3 BC - 69 AD","32 AD - 69 AD","15 AD - 69 AD","9 AD - 79 AD","39 AD - 81 AD","51 AD - 96 AD","30 AD","53 AD - 117 AD","76 AD - 138 AD","86 AD - 161 AD","130 AD - 169 AD","121 AD - 180 AD","161 AD - 192 AD","126 AD - 193 AD","133 or 137 AD - 193 AD","145 AD - 211 AD","188 AD - 217 AD","189 AD - 211 AD","c. 165 AD - 218 AD","c. 203 AD - 222 AD","08 AD - 235 AD","c.173 AD - 238 AD","c.159 AD - 238 AD","c.192 AD, ? - 238 AD","c. 178 AD, ?","? - 238 AD","225 AD - 244 AD","c. 204 AD - 249 AD","c. 201 AD - 251 AD","unknown - 251 AD","206 AD - 253 AD","c. 207 AD - 253 AD","c. 200 AD - 260 AD","? - 268 AD","213 AD/214 AD - 270 AD","? - 270 AD","214 AD/215 AD - 275 AD","? - 276 AD","? - 276 AD","232 AD - 282 AD","c. 230 AD - 283 AD","? - 284 AD","? - 285 AD","244 AD - 311 AD","c. 250 AD - 310 AD","c. 250 AD - 306 AD","c. 260 AD - 311 AD","? - 307 AD","c. 272 AD - 337 AD","c. 278 AD",". 270 AD","c. 250 AD - 325 AD","316 AD","317 AD","320 AD - 350 AD","331 AD/332 AD","331 AD","321 AD","328 AD","359 AD","371 AD","347 AD","c. 377 AD - 408 AD","384 AD - 423 AD","401 AD - 450 AD","? - 421 AD","? - 425 AD","419 AD - 455 AD","396 AD - 457 AD","c. 396 AD - 455 AD","c. 385 AD - 456 AD","420 AD, ?","? - 465 AD","c. 420 AD - 472 AD","c. 420 AD - 472 AD","? - 480 AD","c. 430 AD - 480 AD","? - 480 AD","401 AD - 474 AD","467 AD - 474 AD","425 AD - 491 AD","? - 476 AD","c. 430 AD - 518 AD","c. 450 AD - 527 AD","c. 482 AD - 565 AD","c. 520 AD - 578 AD"],["Reign as Emperor","27 BC - 14 AD","14 AD - 37 AD","37 AD - 41 AD","41 AD - 54 AD","54 AD - 68 AD","68 AD - 69 AD","69 AD - 69 AD","69 AD - 69 AD","69 AD - 79 AD","79 AD - 81 AD","81 AD - 96 AD","96 AD - 98 AD","98 AD - 117 AD","117 AD - 138 AD","138 AD - 161 AD","161 AD - 169 AD","161 AD - 180 AD","177 AD - 192 AD","193 AD - 193 AD","193 AD - 193 AD","193 AD - 211 AD","198 AD - 217 AD","209 AD - 211 AD","217 AD - 218 AD","218 AD - 222 AD","222 AD - 235 AD","235 AD - 238 AD","238 AD - 238 AD","238 AD - 238 AD","238 AD - 238 AD","238 AD - 238 AD","238 AD - 244 AD","244 AD - 249 AD","249 AD - 251 AD","251 AD - late 251 AD","251 AD - 253 AD","253 AD - 253 AD","253 AD - 260 AD","253 AD - 268 AD","268 AD - 270 AD","270 AD - 270 AD","(?) 270 AD - 275 AD","275 AD - 276 AD","AD - 276 AD","276 AD - r 282 AD","282 AD - 283 AD","283 AD - 284 AD?","283 AD - 285 AD","284 AD - 305 AD","286 AD - 305 AD","305 AD - 306 AD","305 AD - 311 AD","306 AD - 307 AD","306 AD - 337 AD","306 AD - 312 AD","311 AD - 313 AD","308 AD - 324 AD","337 AD - 340 AD","337 AD - 361 AD","337 AD - 350 AD","360 AD - 363 AD","363 AD - 364 AD","364 AD - 375 AD","364 AD - 378 AD","367 AD - 383 AD","375 AD - 392 AD","379 AD - 395 AD","383 AD - 408 AD","393 AD - 423 AD","408 AD - 450 AD","421 AD - , 421 AD","423 AD - 425 AD","424 AD - 455 AD","450 AD - 457 AD","455 AD - 455 AD","455 AD - 456 AD","457 AD - 461 AD","461 AD - 465 AD","467 AD -472 AD","472 AD - 472 AD","473 AD - 474 AD","474 AD - 475 AD (in Italy); - Spring 480 AD (in Gaul and Dalmatia)","475 AD - 476 AD","457 AD - 474 AD","474 AD - 474 AD","474 AD - 475 AD \u0026 476 AD - 491 AD","475 AD - 476 AD","491 AD - 518 AD","518 AD - 527 AD","527 AD - 565 AD","565 AD - 578 AD"],["Succession","Became de facto emperor as a result of the \u0027first settlement\u0027 between himself and the Roman Senate.","Son of Augustus\u0027s wife Liia by a previous marriage; adopted son of Augustus.","Son of Tiberius\u0027s nephew Germanicus.","Nephew of Tiberius, brother of Germanicus and uncle of Caligula; proclaimed emperor by the Praetorian Guard.","Grandson of Germanicus, step and adopted son of Claudius.","Seized power after Nero\u0027s suicide, with support of the Spanish legions","Appointed by Praetorian Guard","Seized power with support of German Legions (in opposition to Galba/Otho)","Seized power with the support of the eastern Legions (in opposition to Vitellius)","Son of Vespasian","Son of Vespasian","Appointed by the Senate","Adopted son and heir of Nerva","Adopted son and heir of Trajan","Adopted son and heir of Hadrian","Adopted son and heir of Antoninus Pius; Co-emperor with Marcus Aurelius until death","Adopted son and heir of Antoninus Pius; Co-emperor with Lcius Verus until 169 AD","Natural son of Marcus Aurelius; joint emperor from 177 AD","Proclaimed emperor by Praetorian Guard","Won auction held by the Praetorian Guard for the position of emperor","Seized power with support of Pannonian legionsa","Son of Septimius Severus; co-emperor with Severus from 198 AD; with Severus and Geta from 209 AD until February 211 AD; co-emperor with Geta until December 211 AD","Son of Septimius Severus; co-emperor with Severus and Caracalla from 209 AD until February 211 AD; co-emperor with Caracalla until December 211 AD","Praetorian Prefect to Caracalla, probably conspired to have Caracalla murdered and proclaimed himself emperor after Caracalla\u0027s death; appointed his son Diadumenian junior emperor in May 217","Grandson of Septimius Severus\u0027s sister-in-law, alleged illegitimate son of Caracalla; proclaimed emperor by Syrian legions","Grandson of Septimius Severus\u0027s sister-in-law, cousin and adoptive heir of Elagabalus","Proclaimed emperor by German legions after the murder of Alexander Severus","Proclaimed emperor, whilst Pro-consul in Africa, during a revolt against Maximinus. Ruled jointly with his son Gordian II, and in opposition to Maximinus. Technically a usurper, but retrospectively legitimised by the accession of Gordian III","Proclaimed emperor, alongside father Gordian I, in opposition to Maximinus. Technically a usurper, but retrospectively legitimised by the accession of Gordian III","Proclaimed joint emperor with Balbinus by the Senate in opposition to Maximinus; later co-emperor with Balbinus and Gordian III","Proclaimed joint emperor with Pupienus by the Senate after death of Gordian I \u0026 II, in opposition to Maximinus; later co-emperor with Pupienus and Gordian III","Proclaimed emperor by supporters of Gordian I \u0026 II, then by the Senate; joint-emperor with Pupienus and Balbinus until July 238 AD.","Praetorian Prefect to Gordian III, took power after his death","Governor under Philip the Arab; proclaimed emperor by Danubian legions and defeated Philip in battle; made his son Herennius Etruscus co-emperor in early 251 AD","Son of Decius, accepted as heir by the Senate","Governor of Moesia Superior, proclaimed emperor by Danubian legions after Decius\u0027s death (and in opposition to Hostilian); made his son Volusianus co-emperor in late 251 AD.","Governor of Moesia Superior, proclaimed emperor by Danubian legions after defeating the Goths; accepted as emperor after death of Gallus","Governor of Noricum and Raetia, proclaimed emperor by Rhine legions after death of Gallus; accepted as emperor after death of Aemilianus","Son of Valerian, made co-emperor in 253 AD","Victorious general at Battle of Naissus, seized power after Gallienus\u0027s death","Brother of Claudius Gothicus, seized power after his death","Proclaimed emperor by Danubian legions after Claudius Gothicus\u0027s death, in opposition to Quintillus","Elected by the Senate to replace Aurelian, after a short interregnum","Possibly half-brother of Tacitus, elected by the army in the west to replace him","Governor of the eastern provinces, proclaimed emperor by Danubian legions in opposition to Florianus","Praetorian Prefect to Probus; seized power either before or after Probus was murdered","Son of Carus, succeeded him jointly with his brother Carinus","Son of Carus, succeeded him jointly with his brother Numerian","Proclaimed emperor by army after death of Numerian, and in opposition to Carinus; adopted Maximian as senior co-emperor in 286 AD","Adopted as senior co-emperor (\u0027Augustus\u0027) in the west by Diocletian in 286 AD","Adopted as junior co-emperor (\u0027Caesar\u0027) and heir by Maximian in 293 AD","Adopted as junior co-emperor (\u0027Caesar\u0027) and heir by Diocletian in 293 AD","Adopted as junior co-emperor (\u0027Caesar\u0027) and heir by Constantius Chlorus in 305 AD; succeeded as Augustus in 306; opposed by Maxentius and Constantine I","Son of Constantius Chlorus, proclaimed emperor by his father\u0027s troops; accepted as Caesar (west) by Galerius in 306 AD; promoted to Augustus (west) in 307 AD by Maximian after death of Severus; refused relegation to Caesar in 309 AD","Son of Maximian, seized power in 306 after death of Constantius Chlorus, in opposition to Severus and Constantine I; made Caesar (west) by Maximian in 307 AD after the death of Severus","Nephew of Galerius, adopted as Caesar and his heir in 305 AD; succeeded as Augustus (shared with Licinius) in 311 AD","Appointed Augustus in the west by Galerius in 308 BC, in opposition to Maxentius; became Augustus in the east in 311 AD after the death of Galerius (shared with Maximinus); defeated Maximinus in civil war to become sole eastern Augustus in 313 BC; appointed Valerius Valens in 317 AD, and Martinianus in 324 AD as western Augustus, in opposition to Constantine, both nominally ruled for a few months before being executed","Son of Constantine I; appointed Caesar in 317 AD, succeeded as joint Augustus with his brothers Constantius II and Constans","Son of Constantine I; succeeded as joint Augustus with his brothers Constantine II and Constans; sole emperor from 350 AD","Son of Constantine I; succeeded as joint Augustus with his brothers Constantine II and Constantius II","Cousin of Constantius II; made Caesar of the west in 355 AD; proclaimed Augustus by his troops in 360; sole emperor after the death of Constantius","General of Julian\u0027s army; proclaimed emperor by the troops on Julian\u0027s death","Elected to replace Jovian by the army","Brother of Valentinian I, appointed co-augustus (for the east) by him","Son of Valentinian I, appointed \u0027junior\u0027 Augustus by him in 367, became \u0027senior\u0027 augustus (for the west) after Valentinian\u0027s death.","Son of Valentinian I, proclaimed emperor by Pannonian army after Valentinian\u0027s death; accepted as co-Augustus for the west by Gratian","Appointed as Augustus for the east by Gratian after the death of Valens; became sole \u0027senior\u0027 Augustus after death of Valentinian II","Son of Theodosius I; appointed as \u0027junior\u0027 Augustus for the east by Theodosius in 383 (after the death of Gratian); became \u0027senior\u0027 Augustus for the east after his father\u0027s death","Son of Theodosius I; appointed as \u0027junior\u0027 Augustus for the west by Theodosius in 393 (after the death of Valentinian II); became \u0027senior\u0027 Augustus for the west after his father\u0027s death","Son of Arcadius, succeeded to the throne after his father\u0027s death","Married to Theodosius I\u0027s daughter Galla Placidia, elevated to co-Augustus for the west by Honorius","A senior civil servant under Honorius, proclaimed emperor by Castinus; initially undisputed","Son of Constantius III, appointed Caesar for the west by Theodosius II after the death of Honorius, in opposition to the Joannes; became Augustus for the west after the defeat of Joannes","Nominated as successor (and husband) by Pulcheria, sister of Theodosius II","Proclaimed himself emperor with the support of the army, after the death of Valentinian III","Magister militum under Petronius Maximus, proclaimed emperor by the Visigoth king Theoderic II after Petronius\u0027s death","Appointed emperor by Ricimer","Appointed emperor by Ricimer","Appointed emperor by Ricimer, with the backing of the eastern emperor Leo I","Son-in-law of Valentinian III; appointed emperor by Ricimer","Appointed emperor by Gundobad (Ricimer\u0027s successor)","Nephew-in-law of the eastern emperor Leo I, appointed emperor in opposition to Glycerius","Appointed by his father, Flavius Orestes","Proclaimed emperor by the Magister militum Aspar after Marcian\u0027s death","Grandson of Leo I by his daughter Ariadne (empress)","Father of Leo II","Brother-in-law of Leo I, seized power during a plot against Zeno by Verina (Leo I\u0027s widow and Basiliscus\u0027s sister)","Selected by Ariadne as successor to Zeno (as both emperor and husband)","Commander of the palace guard under Anastasius I); elected as emperor with support of army","Nephew and nominated heir of Justin I","Nephew of Justinian I"],["Cause of Death","Natural causes.","Probably old age, possibly assassinated","Assassinated in a conspiracy involving senators and Praetorian Guards.","Probably poisoned by his wife Agrippina the Younger, in favour of her son Nero.","Committed suicide after being declared a public enemy by the Senate.","Murdered by Praetorian Guard","Committed suicide after losing Battle of Bedriacum to Vitellius","Murdered by Vespasian\u0027s troops","Natural causes","Natural causes (Plague)","Assassinated by court officials","Natural causes","Natural causes","Natural causes","Natural causes","Natural causes (Plague)","Natural causes","Assassinated in palace, strangled to death","Murdered by Praetorian Guard","Executed on orders of the Senate","Natural causes","Murdered by a soldier; probably as part of a conspiracy involving Macrinus","Murdered on the orders of Caracalla","Both executed in favour of Elagabalus","Murdered by Praetorian Guard","Murdered by the army","Assassinated by Praetorian Guard","Committed suicide upon hearing of the death of Gordian II.","Killed during the Battle of Carthage, fighting a pro-Maximinus army","Assassinated by the Praetorian Guard","Assassinated by Praetorian Guard","Unknown; possibly murdered on orders of Philip the Arab","Killed in battle against Decius, near Verona","Both killed in the Battle of Abrittus fighting against the Goths","Natural causes (Plague)","Assassinated by their own troops, in favour of Aemilianus","Assassinated by his own troops, in favour of Valerian","Captured in Battle of Edessa against Persians, died in captivity","Murdered in unclear circumstances","Natural causes (Plague)","Unclear; possibly suicide or murder","Assassinated by Praetorian Guard","Natural causes (possibly assassinated)","Assassinated by his own troops, in favour of Probus","Assassinated by his own troops, in favour of Carus","Natural causes? (Possibly killed by lightning)","Unclear; possibly assassinated","Died in battle against Diocletian?","Abdicated; died of natural causes","Abdicated with Diocletian; twice tried to regain throne with, and then from Maxentius; captured by Constantine I and committed suicide at his behest","Natural causes","Natural causes","Captured by Maxentius and forced to commit suicide (or murdered)","Natural causes","312 AD Died at the Battle of the Milvian Bridge, against Constantine I","313 AD Defeated in civil war against Licinius; probably committed suicide thereafter","Defeated in civil war against Constantine I in 324 AD and captured; executed on the orders of Constantine the next year","340 AD Died in battle against Constans","361 AD Natural causes","Assassinated on the orders of the usurper Magnentius","June 26, 363 AD Mortally wounded in battle","February 17, 364 AD Natural causes (Suffocated on fumes)","November 17, 375 AD Natural causes","August 9, 378 AD Killed in Battle of Adrianople against the Goths","August 25, 383 AD Murdered by rebellious army faction","May 15, 392 AD Unclear; possibly murdered or committed suicide","January 17, 395 AD Natural causes","Natural causes","Natural causes","Natural causes","Natural causes","Deafeated in battle by Theodosius II and Valentinian III, captured and executed","Assassinated, possibly at the behest of Petronius Maximus","Natural causes","Murdered, probably stoned to death by the Roman mob","Deposed by his Magister militum, Ricimer; became bishop of Placentia; murdered at some point afterwards","461 AD Deposed by his troops (probably at the behest of Ricimer); died shortly afterwards in unclear circumstances","Probably assassinated by Ricimer","Executed by Ricimer","Natural causes","Deposed by Julius Nepos, became Bishop of Salona, time and manner of death unknown","Deposed in Italy by Flavius Orestes, ruled in exile until assassination in 480","Deposed by Odoacer, who then ruled in the name of Julius Nepos until the latter\u0027s death, which formally ended the western empire; most likely lived out his life on a private villa in obscurity","Natural causes","Unclear, possibly assassinated","Natural causes","Defeated, captured and executed by Zeno","Natural causes","Natural causes","Natural causes","Became insane; Tiberius II Constantine ruled as regent from December 574 and became emperor on Justin\u0027s death in 578"]],"pageTitle":"Pub Quiz Reference - Roman Emperors Trivia \u0026 Facts","title":"","url":"http://www.pubquizreference.co.uk/specialsection/history/roman-emperors.html","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"RELATION","tableNum":0,"s3Link":"","recordEndOffset":0,"recordOffset":0,"tableOrientation":"HORIZONTAL","lastModified":"","textBeforeTable":"","textAfterTable":"   ","hasKeyColumn":true,"keyColumnIndex":0,"headerRowIndex":0}