{"relation":[["RANG","1","2","3","4","5","6","7","8","9","10","11","12","13","14","15","16","17","18","19","20"],["Museum","MoMA The Museum of Modern Art","Metropolitan Museum of Art","Acropolis Museum","Mus?e du Louvre","Guggenheim Museum","Tate Modern","Design Museum","Museo del Prado","City Museum","Centre Pompidou","Victoria \u0026 Albert Museum","Creation Museum","British Museum","Whitney Museum of American Art","The Getty Museum","New Museum","Salvador Dali Museum","Natural History Museum","American Museum of Natural History","National Museum of the American Indian"],["Stadt","New York","New York","Athen","Paris","New York","London","London","Madrid","St Louis","Paris","London","Petersburg","London","New York","Los Angeles","New York","Saint Petersburg","London","New York","Washington D.C."],["Facebook-Fans","605.792","362.548","242.105","208.070","168.125","130.878","88.174","81.678","80.285","72.599","68.085","64.608","63.234","62.875","61.899","52.376","46.610","33.477","33.060","32.206"],["Tendenz","-","-","-","-","-","-","-","+1","-1","-","+1","-1","+2","-1","-1","-","-","-","-","-"]],"pageTitle":"Social Media — PR-Kloster","title":"","url":"http://www.pr-kloster.de/tag/social-media/","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"RELATION","tableNum":9,"s3Link":"","recordEndOffset":0,"recordOffset":0,"tableOrientation":"HORIZONTAL","TableContextTimeStampBeforeTable":"{3002\u003dDer Februar war ein ruhiger Monat: Weder in unserem Museumsranking f?r Facebook-Seiten noch in dem f?r Twitter gab es in den vergangenen vier Wochen gro?e Ver?nderungen bei den Positionen. Das NRW-Forum D?sseldorf liegt mit jetzt 16.791 Fans (+ 1675 neue Likes) weiter an der Spitze der Facebook-Charts. Mit aktuell?15.605 Fans und einem Zuwachs von 666 ist die Galerie C/O Berlin immer noch auf Platz 2. Den 3. Rang nimmt mit 13.301 Fans (+ 538) weiter das Mercedes Benz Museum ein. Das MMK Museum f?r Moderne Kunst konnte sich um einen Platz verbessern und belegt mit 4.416 Fans jetzt auf Platz 10. Dagegen ist die Neue Nationalgalerie in Berlin (4.293 Fans) auf Platz 11 gefallen.}","TableContextTimeStampAfterTable":"{53654\u003dM?rz 1, 2011   1 Comment, 205062\u003dEin Blick auf das aktuelle Facebook-Ranking f?r November 2010 zeigt, dass auch diesmal wieder die “Top 3? das gesamte Feld sehr dominant beherrschen. Dabei belegt nach wie vor die Galerie c/o Berlin den ersten Platz mit nun 13.345 Fans, gefolgt vom NRW-Forum mit inzwischen 11.188 Fans. Bei beiden war das Wachstum gegen?ber dem Vormonat eher moderat, w?hrend das Mercedes Benz Museum einen go?en Schritt nach vorne gemacht hat. Es konnte im vergangenen Monat 1.530 neue Fans gewinnen? und hat nun insgesamt 9.883 Anh?nger. Damit wird das Stuttgarter Automuseum zum Jahresende h?chstwahrscheinlich ebenfalls die 10.000-Fan-H?rde ?berspringen., 200605\u003dJanuar 3, 2011   Kommentare deaktiviert, 206374\u003dBemerkenswert auch das MMK Museum f?r Moderne Kunst, das sich um vier Pl?tze verbessern konnte und sich damit nun auf Platz 11 befindet. Dagegen ist das St?del Museum um drei Pl?tze auf Platz 13 gefallen. Erneut in den Top 20 k?nnen wir im November das DDR-Museum begr??en, das mit 1.262 Fans das Schlusslicht im Ranking ist., 204550\u003dDezember 28, 2010   Kommentare deaktiviert, 234323\u003dBeim aktuellen Twitter-Ranking sind dagegen nur marginale Ver?nderungen festzustellen. Alle Museen konnten einen leichten Anstieg verzeichnen. Weiterhin auf Platz 1 ist das NRW-Forum mit 12.814 Followern, dicht gefolgt vom M?ritzeum mit 11.092 “Verfolgern”. Auch im Twitter-Ranking belegt das Mercedes-Benz-Museum den dritten Platz mit 7.360 Followern. Ob auch hier noch 2010 die 10.000-Fan-H?rde genommen wird, bleibt mit Spannung abzuwarten., 86658\u003dDas Wuppertaler Von der Heydt-Museum hat sich offensichtlich von Twitter verabschiedet: Letzten Monat wurde noch Platz 18 mit 823 Followern belegt. Bereits im Mai 2010 gab es Berichte, dass der Twitter-Account gel?scht werden soll. Denn als st?dtisches Museum w?re das Risiko zu gro? und man bef?rchte Kosten, die durch eine Nutzung entstehen k?nnten. Jetzt ist der Museumsaccount nicht mehr erreichbar: Technisches Problem oder Absicht? Wir hoffen nur, dass nicht noch andere st?dtische Museen diesem Beispiel folgen., 201186\u003dDas gerade erschienene Jahrbuch \"Annual Multimedia 2011\" dokumentiert Trends in Screendesign, Nutzerführung, multimedialer Integration, digitalem Marketing und Social Media. Im Klappentext heißt es weiter: \"Das Jahrbuch liefert wertvolle Inspiration und macht Mut, originelle Ideen in der Marketingkommunikation umzusetzen. Ausführliche Porträts stellen Agenturen und ihre Dienstleistungen vor. Darüber hinaus geben bekannte Medienjournalisten und Branchen-Insider in zehn exklusiven Fachartikeln informative sowie unterhaltsame Einblicke in die aktuellen Entwicklungen der Branche.\" Einer dieser 10 Artikel stammt von uns und beschäftigt sich mit dem Thema: \"Museen im Web 2.0-Zeitalter: Beispiele für erfolgreiches Social Media Marketing\". Leider war der Redaktionsschluß für den Beitrag schon im Sommer 2010 und dementsprechend sind die genannten Zahlen in der schnelllebigen Web 2.0-Zeit längst überholt. Aber trotzdem hilft er vielleicht dem einen oder anderen \"Neueinsteiger\" in die Social Media-Welt. Vor allem natürlich aus dem Museumsbereich, der anhand von konkreten Beispielen näher beschrieben wird:, 115690\u003dFebruar 1, 2011   1 Comment, 289683\u003dDezember 3, 2010   2 Comments}","lastModified":"","textBeforeTable":"FACEBOOK-FANSEITEN-RANKING (Stand1.3.2011) --\u003e mso-bidi-language:#0400;} mso-fareast-language:#0400; mso-ansi-language:#0400; font-family:\"Times New Roman\"; font-size:10.0pt; mso-pagination:widow-orphan; mso-para-margin-bottom:.0001pt; mso-para-margin:0cm; mso-padding-alt:0cm 5.4pt 0cm 5.4pt; mso-style-parent:\"\"; mso-style-noshow:yes; mso-tstyle-colband-size:0; mso-tstyle-rowband-size:0; {mso-style-name:\"Normale Tabelle\"; table.MsoNormalTable /* Style Definitions */ --\u003e st1\\:*{behavior:url(#ieooui) } ?hnlich das Bild bei der Twitter-Rangliste: Auch hier weiterhin auf Platz 1 das NRW-Forum mit 13.740 Followern, dicht gefolgt vom M?ritzeum mit 12.296 Kontakten. Das Mercedes Benz Museum (8.739 Follower) belegt auch im Twitter-Ranking – wie schon in den Vormonaten – den dritten Platz. Die Ver?nderungen im Rest des Feldes sind ebenfalls minimal: Das Deutsche Guggenheim konnte sich um einen Platz verbessern und belegt nun Platz 11 mit 1.341 Followern. Der Februar war ein ruhiger Monat: Weder in unserem Museumsranking f?r Facebook-Seiten noch in dem f?r Twitter gab es in den vergangenen vier Wochen gro?e Ver?nderungen bei den Positionen. Das NRW-Forum D?sseldorf liegt mit jetzt 16.791 Fans (+ 1675 neue Likes) weiter an der","textAfterTable":"TWITTER-RANKING (Stand 01.03.2011) RANG Museum Stadt Follower Tendenz 1 NRW-Forum D?sseldorf 13.740 - 2 M?ritzeum Waren","hasKeyColumn":true,"keyColumnIndex":1,"headerRowIndex":0}