{"relation":[["Company??","3M","Alcoa","American Express","AT\u0026T","Bank of America","Boeing","Caterpillar","Chevron Corporation","Citigroup","Coca-Cola","DuPont","ExxonMobil","General Electric","General Motors","Hewlett-Packard","Home Depot","Intel","IBM","Johnson \u0026 Johnson","JPMorgan Chase","Kraft Foods","McDonald\u0027s","Merck","Microsoft","Pfizer","Procter \u0026 Gamble","United Technologies Corporation","Verizon Communications","Walmart","Walt Disney"],["Symbol??","MMM","AA","AXP","T","BAC","BA","CAT","CVX","C","KO","DD","XOM","GE","GM","HPQ","HD","INTC","IBM","JNJ","JPM","KFT","MCD","MRK","MSFT","PFE","PG","UTX","VZ","WMT","DIS"],["Industry??","Diversified industrials","Aluminum","Consumer finance","Telecommunication","Institutional and retail banking","Aerospace \u0026 defense","Commercial vehicles \u0026 trucks","Oil and gas","Banking","Beverages","Commodity Chemicals","Integrated oil \u0026 gas","Diversified industrials","Automobiles","Diversified computer systems","Home improvement retailers","Semiconductors","Computer services","Pharmaceuticals","Banking","Food processing","Restaurants \u0026 bars","Pharmaceuticals","Software","Pharmaceuticals","Non-Durable household products","Aerospace, heating/cooling, elevators","Telecommunication","Broadline retailers","Broadcasting \u0026 entertainment"],["Date Added??","1976-08-09 (as Minnesota Mining and Manufacturing)","1959-06-01 (as Aluminum Company of America)","1982-08-30","1999-11-01 (as SBC Communications)","2008-02-19","1987-03-12","1991-05-06","2008-02-19","1997-03-17 (as Travelers Group)","1987-03-12","1935-11-20","1928-10-01 (as Standard Oil (N.J.))","1907-11-07","1925-08-31","1997-03-17","1999-11-01","1999-11-01","1979-06-29","1997-03-17","1991-05-06 (as J.P. Morgan \u0026 Company)","2008-09-22","1985-10-30","1979-06-29","1999-11-01","2004-04-08","1932-05-26","1939-03-14 (as United Aircraft)","2004-04-08","1997-03-17","1991-05-06"]],"pageTitle":"Financial Planning-The Dow Jones Industrial","title":"","url":"http://www.wife.org/hodge.htm","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"RELATION","tableNum":0,"s3Link":"","recordEndOffset":0,"recordOffset":0,"tableOrientation":"HORIZONTAL","TableContextTimeStampBeforeTable":"{1460\u003dOn May 26, 1896, 103 years ago, Dow produced the first index composed entirely of industrials, companies producing products such as sugar, tobacco, leather, coal and electric. At that time the Dow Jones Industrial stocks were new and speculative, not \"blue chip\" stocks as they are considered to be today., 1131\u003dThe contemporary Dow Jones Industrial was born October 1, 1928 when the list was expanded from 20 stocks to 30. Today?s Dow still uses 30 stocks to track the market, and there has been remarkably little substitution in the ensuing 71 years., 92\u003dAs of 10/01/2008 the 30 stocks in the Dow Jones Industrial Average were: , 2425\u003dWay back in 1880 a newspaper reporter named Charles Dow began writing for the New York Mail and Express. Later he and Edward Jones formed the Dow Jones News Company, the predecessor to Wall Street Journal.}","lastModified":"","textBeforeTable":"As of 10/01/2008 the 30 stocks in the Dow Jones Industrial Average were:  In fact, the day the Dow broke 10,000, on the New York Stock Exchange losing stocks outnumbered winners by a 4 to 3 ratio, and the Standard \u0026 Poor?s index of 500 major companies was down for the day. (Though the Standard \u0026 Poor?s 500 index generally is considered a more reliable market indicator than the Dow, the Dow is more widely reported.) The Dow Jones Industrial Average has historically been the average used by the masses to gauge how the Stock Market is doing. But the Dow is not always an accurate representation of the market as a whole. The Dow is no longer an average. Today the Dow is divided by a special divisor designed to avoid distortions when companies split their shares or when one stock is substituted for another. The contemporary Dow Jones Industrial was born October 1, 1928 when the list was expanded from 20 stocks to 30. Today?s Dow still uses 30 stocks to track the market, and there has been remarkably little substitution in the ensuing 71 years. On May 26, 1896, 103 years ago, Dow produced the first index composed entirely of industrials, companies producing products such as sugar, tobacco, leather, coal and electric. At that time the Dow Jones Industrial stocks were new and speculative, not \"blue chip\" stocks as they are considered to be today. The first Dow Jones average was made","textAfterTable":"Remember that investing in stocks can be risky, and the Dow Jones fluctuates widely. You and your advisor must devise strategies to help limit your exposure to dramatic swings or down markets. At WIFE we welcome your comments. Please feel free to contact us.     Help support WIFE.org and the Money Club All proceeds support the non-profit Money Club and WIFE web site and projects Free Gifts with Different Membership Levels              Bahr Investment Group (Carlsbad, CA) Understanding your deepest concerns and needs is critical as you approach this part of your life. Find out how Bahr Investment Group can help you achieve your","hasKeyColumn":true,"keyColumnIndex":0,"headerRowIndex":0}