{"relation":[["Volume","Open","High","Low","P/E Ratio","Div Yield","Market Cap"],["3.0M","$10.66","$10.72","$10.49","19.31","2.64","11.7B"]],"pageTitle":"Xerox raised to outperform by BMO Capital Markets - MarketWatch","title":"","url":"http://www.marketwatch.com/story/xerox-raised-to-outperform-by-bmo-capital-markets-2013-01-28?link\u003dMW_story_latest_news","hasHeader":false,"headerPosition":"NONE","tableType":"ENTITY","tableNum":0,"s3Link":"common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981969.11/warc/CC-MAIN-20150728002301-00077-ip-10-236-191-2.ec2.internal.warc.gz","recordEndOffset":564370551,"recordOffset":564339171,"tableOrientation":"HORIZONTAL","TableContextTimeStampAfterTable":"{48829\u003dPublished: Jan 28, 2013 10:34 a.m. ET, 92422\u003dCopyright ©2015 MarketWatch, Inc. All rights reserved., 59003\u003dNEW YORK (MarketWatch) -- Xerox Corp. XRX, -0.14% was upgraded to an outperform rating from market perform by BMO Capital Markets on Monday. Analyst Keith Bachman cited positive year-over-year growth in revenue, improving operating margins and a \"more balanced\" capital allocation that could lead to expansion in 2013. \"After several years of inconsistent results, we believe that XRX can improve execution across a variety of metrics that can move the shares higher,\" he said in a note. BMO raised its target price to $10 from $8.50. Shares were up 1.7% to $8.06 at 10:25 a.m. Eastern time.}","textBeforeTable":"(-0.14%) -0.01 10.61 $ U.S.: NYSE: XRX Xerox Corp. Advanced Search 702,14.927 410.927,306 702,600.805 690.805,612 \" /\u003e Intraday Data provided by SIX Financial Information and subject to terms of use. Historical and current end-of-day data provided by SIX Financial Information. Intraday data delayed per exchange requirements. S\u0026P/Dow Jones Indices (SM) from Dow Jones \u0026 Company, Inc. All quotes are in local exchange time. Real time last sale data provided by NASDAQ. More information on NASDAQ traded symbols and their current financial status. Intraday data delayed 15 minutes for Nasdaq, and 20 minutes for other exchanges. S\u0026P/Dow Jones Indices (SM) from Dow Jones \u0026 Company, Inc. SEHK intraday data is provided by SIX Financial Information and is at least 60-minutes delayed. All quotes are in local exchange time. By using this site you agree","textAfterTable":"LatestNews","hasKeyColumn":true,"keyColumnIndex":0,"headerRowIndex":-1}