{"relation":[["Barefoot","Beech Bottom","Beech Hill","Brattontown","Browns","Cross Lanes","Cross Roads","Days Crossroads","Drapers Crossroads","Enon","Eulia","Fairview","Frog Pond","Galen"],["Gap of the Ridge","Gibbs Crossroads","Goose Horn","Green Grove","Green Valley","Greenwood","Gum Springs","Hayesville","Haysville","Hillsdale","Horsleys","Kirby","Lafayette","Long Creek"],["Maple Grove","Meadorville","Mill Town","New Harmony","New Zion","Oakdale","Pleasant Hill","Pleasant Valley","Prosperity","Pumpkintown","Red Boiling Springs","Rocky Mound","Russell Hill","Siloam"],["Spivey","Sunrise","Sycamore Valley","Underwood","Walnut Shade","Webbtown","White Oak","Willette","Williams","Winklers Crossroads","Wixtown","","",""]],"pageTitle":"Macon County, Tennessee Genealogy | Learn | FamilySearch.org","title":"","url":"http://familysearch.org/learn/wiki/en/index.php?title\u003dMacon_County,_Tennessee\u0026diff\u003d1458509\u0026oldid\u003d1088142","hasHeader":false,"headerPosition":"NONE","tableType":"RELATION","tableNum":6,"s3Link":"common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989178.64/warc/CC-MAIN-20150728002309-00273-ip-10-236-191-2.ec2.internal.warc.gz","recordEndOffset":92992111,"recordOffset":92951910,"tableOrientation":"VERTICAL","TableContextTimeStampAfterTable":"{77421\u003d1860, 77815\u003d1870, 107784\u003dIn 1940 and 1941, W.P.A. workers pinpointed the location of Macon County divorce papers in diverse County Courthouse records, see:, 110306\u003dMacon County Public Library 311 Church St. Lafayette, TN 37083 Phone: 1-615-666-4340 Fax: 1-615-666-8932 E-mail: Julia.Marshall@state.tn.us Hours: Mon., Tues., Wed., Fri. 9 a.m.-5:45 p.m. Thurs. 12 noon-8 p.m. Sat. 8 a.m.-1:45 p.m., 109644\u003dMiddle Tennessee Genealogical Society PO Box 330948 Nashville, TN, USA 37203-7507 The society serves the 40 counties of middle Tennessee of which Macon County is one. It publishes The Middle Tennessee Journal of Genealogy and History, a quarterly containing articles of genealogical and historical interest. Little-known Tennessee records are published and indexed, along with family genealogies, Bible records and material submitted by members. There is an alphabetical Index to articles in the Journal 1988-summer 2005, 75553\u003d1850, 1860, 1870, 1880, 1900, 1910, 1920, and 1930 federal population censuses of Macon County are available online. For tips on accessing census records online, see Tennessee Census. If you\u0027re having trouble finding your ancestors in online indexes, try checking printed indexes. Created by local experts familiar with the area\u0027s families, these indexes are often transcribed more accurately than nationwide online indexes., 60829\u003dBecause of three courthouse fires, the records stored there prior to 1901 are mostly destroyed. The Macon County Historical Society is working to restore these lost records through several different means. To learn what records are now available, it is worthwhile to contact the Macon County Historical Society at P.O. Box 231, Lafayette, Tennessee 37083-0231., 76714\u003d1850, 86807\u003dAs of August 2010, a query for persons born in Macon, Tennessee at World Connect, results in more than 38,000 entries., 79015\u003d1890 - Lost, but substitutes are available:, 92727\u003dWar of 1812, 60552\u003dMacon County Circuit Court Clerk Court records 904 Highway 52 Bypass East Lafayette, TN 37083 Phone: 1-615-666-2354, 60279\u003dMacon County Register of Deeds Land records 102 County Courthouse Lafayette, TN 37083 Phone: 1-615-666-2353, 62764\u003d1842--Macon County was created 18 January 1842 from Smith and Sumner Counties. County seat: Lafayette [4], 62409\u003dThe county is named after U.S. Senator Nathaniel Macon (1758-1837).[3], 61321\u003dCourthouse hours: Mon.-Wed. 8 a.m.-4:30 p.m. Fri. 8 a.m.-5 p.m. Sat. 8 a.m.-1:30 p.m. Closed Thursday, 103156\u003dFamilySearch has placed scans of the following records online in the Tennessee, Probate Court Books, 1795-1927 collection. These are browse-only collections. Handwritten indexes may be found at the front or back of some volumes:, 105466\u003dThe original Macon County marriage records are kept at the County Courthouse. Because of a courthouse fire, no marriage records before 1900 are available. The following publication, based on early newspapers, helps to alleviate this genealogical obstacle:, 80699\u003d1910, 59751\u003dMacon County; 106 County Courthouse; Lafayette, TN 37083; Ph. 615.666.2000 Details: (Co Clk has b rec 1908-1912, m rec from 1901 \u0026 pro rec from 1900; Clk Cir Ct has div \u0026 ct rec; Reg of Deeds has land rec), 78234\u003d1880, 81108\u003d1920, 59978\u003dMacon County Clerk Marriage and probate records Birth records 1908-1912 104 County Courthouse Lafayette, TN 37083 Phone: 1-615-666-2333, 59620\u003dMacon County Courthouse 104 Courthouse, Public Square Lafayette, TN 37083 Phone: 1-615-666-2000, 62207\u003dMiddle Tennessee county established in 1842. Macon County\u0027s land belonged to the pioneer Cumberland Settlements.[2], 63896\u003d\"Rotating Formation Tennessee County Boundary Maps\" (1777-1985) may be viewed for free at the My Tennessee Genealogy website. They rely on AniMap 3.0 software., 79902\u003d1900}","textBeforeTable":"Populated Places Places / Localities Michael John Neill, Burned Counties in Family History Circle Burned Counties Research in FamilySearch Wiki Arlene Eakle, When the Records are Gone in Tennessee Genealogy Blog For tips on researching in burned counties, see: Surviving chancery court records act as a substitute to the lost land and probate records. Lost probate records: 1842 to 1939 Lost marriage records: 1842 to 1900 Lost land records Lost census: 1890 Most records stored at the courthouse before 1900 have been lost. Record Loss \"Rotating Formation Tennessee County Boundary Maps\" (1777-1985) may be viewed for free at the My Tennessee Genealogy website. They rely on AniMap 3.0 software. Boundary Changes Hear it spoken[6] (male) Hear it spoken[5] (female) County Pronunciation 1842--Macon County was created 18 January 1842 from Smith and Sumner Counties. County seat: Lafayette [4]","textAfterTable":"Neighboring Counties Allen County, Kentucky Clay Jackson Monroe County, Kentucky Smith Sumner Trousdale Resources Research Guides Genealogical \"Fact Sheets\" About Tennessee Counties: Macon County, courtesy: TSLA. (Identifies published county histories, published local records, census records, newspapers and local records on microfilm, and select manuscripts.) \"Research in Macon County,\" The Middle Tennessee Journal of Genealogy and History, Vol. 6, No. 3 (Winter 1993). For possible FHL and online access, as well as indexes, seePeriodicals. African American United States African Americans Tennessee African Americans Biographies Douthat, James L. Macon County, Tennessee Biographies. Signal","hasKeyColumn":true,"keyColumnIndex":0,"headerRowIndex":-1}