{"relation":[["","Heading 3","Heading 4","Heading 5"],["Heading 1","Row 1 Col 2","no colspan this time","Row 2 Col 2"],["Heading 2","Row 1 Col 3","","Row 2 Col 3"]],"pageTitle":"Formatting Syntax [Gregow.se]","title":"","url":"http://www.gregow.se/dokuwiki/doku.php?id\u003dwiki:syntax","hasHeader":true,"headerPosition":"MIXED","tableType":"MATRIX","tableNum":2,"s3Link":"common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981460.12/warc/CC-MAIN-20150728002301-00002-ip-10-236-191-2.ec2.internal.warc.gz","recordEndOffset":482822827,"recordOffset":482802817,"tableOrientation":"MIXED","TableContextTimeStampAfterTable":"{25282\u003dThe PHP version: 5.6.11 (inline HTML)}","textBeforeTable":"DokuWiki can embed the following media formats directly. Supported Media Formats For linking an image to another page see Image Links above. {{ wiki:dokuwiki-128.png |This is the caption}} Of course, you can add a title (displayed as a tooltip by most browsers), too. {{ wiki:dokuwiki-128.png }} {{wiki:dokuwiki-128.png }} {{ wiki:dokuwiki-128.png}}           By using left or right whitespaces you can choose the alignment.  Resized external image: {{http://de3.php.net/images/php.gif?200x50}} Resize to given width and height: {{wiki:dokuwiki-128.png?200x50}} Resize to given width: {{wiki:dokuwiki-128.png?50}} Real size: {{wiki:dokuwiki-128.png}}  Resized external image:    Resize to given width and height2):    Resize to given width:    Real size:    You can include external and internal images, videos and audio files with curly brackets. Optionally you can specify the size of them.   Media Files","textAfterTable":"Unfortunately not all browsers understand all video and audio formats. To mitigate the problem, you can upload your file in different formats for maximum browser compatibility. For example consider this embedded mp4 video: {{video.mp4|A funny video}} When you upload a video.webm and video.ogv next to the referenced video.mp4, DokuWiki will automatically add them as alternatives so that one of the three files is understood by your browser. Additionally DokuWiki supports a “poster” image which will be shown before the video has started. That image needs to have the same filename as the video and be either a jpg or png file. In the example above a video.jpg file would work. Lists Dokuwiki supports ordered and unordered lists. To create a list item, indent your text by two spaces and use a * for unordered lists or a - for ordered ones. This is a list The second item You may have different levels Another item The same list but ordered Another item Just use indention for deeper levels That\u0027s it  * This is a list *","hasKeyColumn":true,"keyColumnIndex":0,"headerRowIndex":0}