{"relation":[["","2014","2013","Difference"],["C","0.3%","0.3%","0.0%"],["P","3.4%","2.6%","0.8%"],["1B","9.7%","15.3%","-5.6%"],["2B","14.7%","16.4%","-1.7%"],["3B","4.7%","4.9%","-0.2%"],["SS","8.9%","9.4%","-0.5%"],["LF","13.9%","11.2%","2.7%"],["CF","23.1%","18.2%","4.9%"],["RF","21.5%","21.8%","-0.3%"]],"pageTitle":"Breaking Out: Cincinnati Reds Outfielder Kyle Waldrop","title":"","url":"http://redsminorleagues.com/2014/08/29/breaking-out-cincinnati-reds-outfielder-kyle-waldrop/","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"MATRIX","tableNum":2,"s3Link":"common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042991019.80/warc/CC-MAIN-20150728002311-00090-ip-10-236-191-2.ec2.internal.warc.gz","recordEndOffset":198926991,"recordOffset":198905957,"tableOrientation":"MIXED","TableContextTimeStampAfterTable":"{20895\u003dAs noted above, the outfielder says he has stopped trying to hit a lot of home runs. While the home run total is down from the 2013 season where he hit 21 for Bakersfield he has nearly the same number of extra-base hits in 2014 as he had in 2013. When judging power, I like to look at Isolated Power, which is a players batting average subtracted from a players slugging percentage. Like above, let’s look at the career rates versus the 2014 season:, 26463\u003dIn 2014 the ball is going to center and left field a bit more often and it seems that it’s coming at the expense of the ball being pulled to first and second base., 26695\u003dWith the improvements for Waldrop in 2014 there hasn’t been one big reason for why he’s performed better. He hasn’t begun walking at a very high clip. He hasn’t found big time power that he didn’t have before. He hasn’t cut his strikeout rate in half. What he has done is make minor improvements to his offensive game nearly across the board and when combined they have made for a big improvement overall., 17920\u003dPrior to the 2014 season Waldrop had a 6.1% walk rate, 20.4% strikeout rate and a 3.4 strikeout-to-walk rate for his career. Let’s take a quick look at how those rates compare to the ones he has posted in the 2014 season:, 32039\u003dDoug Gray is the owner and operator of this website and has been running it since 2004 in one variation or another. You can follow him on twitter @dougdirt24, contact him via email here or follow the site on Facebook. and Youtube., 14892\u003dKyle Waldrop was drafted out of high school in the 12th round of the 2010 Draft. He signed late and didn’t play much that first season, getting into just seven games before the season ended. Over the next three seasons he spent time playing in Billings, Dayton and Bakersfield where his OPS was .776, .767 and .766. This season he has split his time between Bakersfield and Pensacola where he’s hit a combined .338/.388/.510 with a career high 36 doubles, four triples and 12 home runs. He’s also set a career high in walks. While in Pensacola earlier this month I had a chance to talk with him about his season and some of the reasons this season has been a breakout year for him., 22755\u003dCompared to the rest of his career the isolated power is the same as it has always been. That does ignore that he had a breakout power season in 2013 where his isolated power was at .202. Still, the current season mark of .172 isn’t far off from that and he’s actually done better in Pensacola with a .189 mark. It’s also worth noting that Pensacola does no favors for power to right field., 23216\u003dAnother thing that Waldrop noted was that he has had to force himself to use the entire field more, to go the other way. He isn’t just saying that though, it’s actually happening. Here is his 2013 spray chart compared with one from 2014:, 49701\u003dCan Waldrop play right? Bruce’s contract is up after 2016, 2 yrs away. We’re paying $10M for a .3 WAR, where his historic WAR is about 2.5. Competition breeds performance.}","lastModified":"Tue, 04 Aug 2015 15:47:51 GMT","textBeforeTable":"Another thing that Waldrop noted was that he has had to force himself to use the entire field more, to go the other way. He isn’t just saying that though, it’s actually happening. Here is his 2013 spray chart compared with one from 2014: Using the entire field Compared to the rest of his career the isolated power is the same as it has always been. That does ignore that he had a breakout power season in 2013 where his isolated power was at .202. Still, the current season mark of .172 isn’t far off from that and he’s actually done better in Pensacola with a .189 mark. It’s also worth noting that Pensacola does no favors for power to right field. .172 Total 2014 .189 Pensacola 2014 .157 Bakersfield 2014 .176 Before 2014 IsoP As noted above, the outfielder says he has stopped trying to hit a lot of home runs. While the home run total is down from the 2013 season where he hit 21 for Bakersfield","textAfterTable":"In 2014 the ball is going to center and left field a bit more often and it seems that it’s coming at the expense of the ball being pulled to first and second base. Overall Improvements With the improvements for Waldrop in 2014 there hasn’t been one big reason for why he’s performed better. He hasn’t begun walking at a very high clip. He hasn’t found big time power that he didn’t have before. He hasn’t cut his strikeout rate in half. What he has done is make minor improvements to his offensive game nearly across the board and when combined they have made for a big improvement overall. Kyle Waldrop Share On: Tweet","hasKeyColumn":true,"keyColumnIndex":0,"headerRowIndex":0}