{"relation":[["Date","Aug 29","Sep 7","Sep 14","Sep 21","Sep 28","Oct 5","Oct 10","Oct 19","Oct 26","Nov 2","Nov 9","Nov 23"],["Opponent","Cumberland (Tenn.)","at Wisconsin","at Hampton","Tennessee State","Indiana St.","at Murray State","UT Martin","at Eastern Kentucky","Jacksonville State","at Eastern Illinois","at Southeast Missouri","Austin Peay"],["Score","W, 63-7","L, 48-0","W, 30-27","L, 41-21","W, 38-37","L, 35-24","L, 28-17","L, 24-10","L, 34-14","L, 56-21","W, 41-16","W, 34-0"],["punt","-","-","-","-","-","-","-","-","-","-","-","-"],["yds","-","-","-","-","-","-","-","-","-","-","-","-"],["avg","-","-","-","-","-","-","-","-","-","-","-","-"],["long","-","-","-","-","-","-","-","-","-","-","-","-"],["in20","-","-","-","-","-","-","-","-","-","-","-","-"],["fc","-","-","-","-","-","-","-","-","-","-","-","-"],["tb","-","-","-","-","-","-","-","-","-","-","-","-"],["blk","-","-","-","-","-","-","-","-","-","-","-","-"]],"pageTitle":"Cody Matthews - Tennessee Tech","title":"","url":"http://www.ttusports.com/sports/fball/2013-14/bios/matthews_cody_yflp?view\u003dgamelog\u0026pos\u003dkr","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"RELATION","tableNum":7,"s3Link":"common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990217.27/warc/CC-MAIN-20150728002310-00299-ip-10-236-191-2.ec2.internal.warc.gz","recordEndOffset":789682295,"recordOffset":789635910,"tableOrientation":"HORIZONTAL","TableContextTimeStampAfterTable":"{29266\u003dA preseason all-OVC selection by College Sports Madness, Cody is the top returning receiver for the Golden Eagles and will be a scoring threat on every snap...runs precise routes and has great hands...after working at free safety in his first season on the Golden Eagle roster, made the move from the defensive secondary to a wide receiver position for the 2011 season...has made six appearances on the Athletic Director\u0027s Honor Roll., 30941\u003d(In 2010): Cody was injured during fall camp and redshirted in his first season on the Golden Eagle roster. HIGH SCHOOL: A two-sport standout at Gallatin High School...lettered three years each on the football and basketball teams...three-year starter on the gridiron for coach Robert Lassiter’s Green Wave...helped the team reach the quarterfinals of the TSSAA playoffs in his senior season...played on both sides of scrimmage as a quarterback and free safety, focusing more on offense in his final two seasons...named all-region as a sophomore defensive back when he produced 72 tackles and one interception....earned all-region honors at quarterback as a junior...recognized on both sides of scrimmage as a senior, earning all Mid-State on defense and all-region on offense...rushed for more than 1,000 yards and passed for more than 1,000 yards in each of his final two seasons. PERSONAL: The son of Chuck Matthews and Chandra Matthews...full name is Cody James Matthews...birthdate is April 22 1992...majoring in English-professional communication., 30446\u003d(In 2011): Appeared in nine games as a redshirt freshman, picking up 169 yards and three touchdowns on 12 catches...started to shine at the season\u0027s end, scoring a touchdown in the final three games of the season and recording his best catch against Austin Peay in Tech\u0027s OVC title game on Nov. 19...caught a career-best 61-yard touchdown pass..in the Golden Eagles\u0027 FCS playoff game against Central Arkansas, Matthews had five catches for 46 yards and a TD., 421750\u003d1100 McGee Boulevard}","textBeforeTable":"Cody Matthews 9 9 Related Bios Steve Wilson Jordan Smith Ladarius Vanlier Cody Forbes Darian Stone Bud Golden Bill Dillard Jamel Cook Brock McCoin Charlie High Marty Jones Eric Belew Demario Donnell Matt Hamby Austin Tallant Krys Cates Zack Ziegler Trent Thompson Jared Davis Cory McDonald Maleek Hall Stephen Bush Jerquin Vines Jimmy Laughlin James Huguely Daniel Pierce Conor Sparkman Trey Burks Steven Lillard Colton Belew Tra\u0027Darius Goff Luke Woodason Trey Thompson Jay Rudwall Radir Annoor Tevin McDermott Patrick Prewitt Senquay Eichelberger Deosha McColley Seth McDonald Cory Webber Dametris Watson Isaiah McKinney Blake Adams Robert Hill Bronson Josh Smith Dorian Eskridge Jordan Carroll Elliot Normand J.T. Rankin Jerry King Avery Rollins Ben Viaene KJ Carter Terrell Rollins Zach Malone Dylan Sullivan Josh Belhu James Normand Gage Terry Randall Reeves Tyler Coen Justin Ivory Matt Martin Ethan Crum Cory Malone Jibrin Linge William Chatmon Charles Rutledge Wesley Sherrill Matthew Smith","textAfterTable":"Date Opponent Score comp att pct yds y/a td int sac yds Aug 29 Cumberland (Tenn.) W, 63-7 - - - - - - - - - Sep 7 at Wisconsin L, 48-0 - - - - - - - - - Sep 14 at Hampton W, 30-27 - - - - - - - - - Sep 21 Tennessee State L, 41-21 - - - - - - - - - Sep 28 Indiana St. W, 38-37 - - - - - - - - - Oct 5 at Murray State L, 35-24 - - - - - - - - - Oct 10 UT Martin L, 28-17 - - - - - - - - - Oct 19 at Eastern Kentucky L, 24-10 - - - - - - - - - Oct 26 Jacksonville State L, 34-14 - - - - - - -","hasKeyColumn":true,"keyColumnIndex":0,"headerRowIndex":0}