{"relation":[["type","FR Doc.","RIN","","",""],["regulations.gov","2014-27125","2060-AS07","EPA-HQ-OAR-2009-0234","EPA-HQ-OAR-2011-0044","FRL-9919-29-OAR"]],"pageTitle":"40 CFR 63.7840 - What notifications must I submit and when? | LII / Legal Information Institute","title":"","url":"https://www.law.cornell.edu/cfr/text/40/63.7840","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"LAYOUT","tableNum":13,"s3Link":"common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042991019.80/warc/CC-MAIN-20150728002311-00090-ip-10-236-191-2.ec2.internal.warc.gz","recordEndOffset":907537039,"recordOffset":907501421,"tableOrientation":"HORIZONTAL","TableContextTimeStampBeforeTable":"{1074\u003dTitle 40 published on 2014-07-01}","TableContextTimeStampAfterTable":"{162422\u003dThe Environmental Protection Agency (EPA) is announcing that the period for providing public comments on the December 8, 2014, supplemental proposed rule titled “National Emission Standards for Hazardous Air Pollutants: Primary Aluminum Reduction Plants” is being extended for 15 days., 35063\u003dThe Environmental Protection Agency (EPA) is taking final action on its reconsideration of the startup and shutdown provisions in the final rules titled, “National Emission Standards for Hazardous Air Pollutants from Coal- and Oil-fired Electric Utility Steam Generating Units and Standards of Performance for Fossil-Fuel-Fired Electric Utility, Industrial-Commercial-Institutional, and Small Industrial-Commercial-Institutional Steam Generating Units.” The national emission standards for hazardous air pollutants (NESHAP) issued pursuant to Clean Air Act (CAA) section 112 are referred to as the Mercury and Air Toxics Standards (MATS), and the new source performance standards (NSPS) issued pursuant to CAA section 111 are referred to as the Utility NSPS. On November 30, 2012, the U.S. Environmental Protection Agency (EPA) granted reconsideration of, proposed, and requested comment on a limited set of issues in the February 16, 2012, final MATS and Utility NSPS, including certain issues related to the final work practice standards applicable during startup periods and shutdown periods. On June 25, 2013, the EPA reopened the public comment period for the reconsideration issues related to the startup and shutdown provisions of MATS and the startup and shutdown provisions related to the particulate matter (PM) standard in the Utility NSPS. The EPA is now taking final action on the standards applicable during startup periods and shutdown periods in MATS and on startup and shutdown provisions related to the PM standard in the Utility NSPS., 258708\u003dThis action corrects our supplemental notice of proposed rulemaking to the national emission standards for hazardous air pollutants for the Ferroalloys Production source category published in the Federal Register on October 6, 2014. In that action, there is an incorrect location for the public hearing. This document amends the public hearing location and the date the hearing will be held, if requested., 204659\u003dThe Texas Commission on Environmental Quality (TCEQ) has submitted updated regulations for receiving delegation of EPA authority for implementation and enforcement of National Emission Standards for Hazardous Air Pollutants (NESHAP) for all sources (both part 70 and non-part 70 sources). These regulations apply to certain NESHAP promulgated by the Environmental Protection Agency (EPA) at 40 CFR part 63, as amended between May 25, 2005 and April 24, 2013. The delegation of authority under this action does not apply to sources located in Indian Country. EPA is providing notice proposing to approve the delegation of certain NESHAPs to TCEQ., 236343\u003dThis action proposes amendments in addition to those proposed on November 25, 2011, and April 15, 2013, for the Mineral Wool Production and Wool Fiberglass Manufacturing source categories. This action addresses comments received on previous proposals, explains changes to previously proposed limits for sources in these industries and clarifies our use of the upper prediction limit (UPL) in setting MACT floors. The Environmental Protection Agency (EPA) is taking comments on only aspects of the proposed rules that are discussed in this document. When finalized, these proposed standards would increase the level of environmental protection., 269469\u003dThis action supplements our proposed amendments to the national emission standards for hazardous air pollutants (NESHAP) for the Ferroalloys Production source category published in the Federal Register on November 23, 2011. In that action, the Environmental Protection Agency (EPA) proposed amendments based on the initial technology and residual risk reviews for this source category. Today\u0027s action presents a revised technology review and a revised residual risk review for the Ferroalloys Production source category and proposes revisions to the standards based on those reviews. This action also proposes new compliance requirements to meet the revised standards. This action would result in significant environmental improvements through the reduction of fugitive manganese emissions and through more stringent emission limits for several processes., 179467\u003dIn this action, the Environmental Protection Agency (EPA) proposes that it has completed its statutory obligation of the Clean Air Act to promulgate emissions standards for source categories accounting for not less than ninety percent of the aggregated emissions of each of the seven hazardous air pollutants enumerated in section 112(c)(6). This document explains the basis for the agency\u0027s conclusion that it completed this obligation in February of 2011, identifies the promulgated standards that collectively satisfy the obligation, and provides the public an opportunity to comment., 108647\u003dThe U.S. Environmental Protection Agency (EPA) is proposing this action to correct and clarify certain text of the final action titled “National Emission Standards for Hazardous Air Pollutants From Coal- and Oil-Fired Electric Utility Steam Generating Units and Standards of Performance for Fossil-Fuel-Fired Electric Utility, Industrial-Commercial-Institutional, and Small Industrial-Commercial-Institutional Steam Generating Units,” which was published in the Federal Register of Thursday, February 16, 2012. We are also proposing to remove rule provisions establishing an affirmative defense for malfunction events in light of a recent court decision on the issue., 231155\u003dThe Environmental Protection Agency (EPA) is announcing that the period for providing public comments on the October 6, 2014, supplemental proposed rule titled “National Emission Standards for Hazardous Air Pollutants: Ferroalloys Production” is being extended for 18 days., 146587\u003dOn February 1, 2013, the Environmental Protection Agency (EPA) finalized amendments to the National Emission Standards for Hazardous Air Pollutants for Area Sources: Industrial, Commercial, and Institutional Boilers (Area Source Boilers Rule). Subsequently, the EPA received three petitions for reconsideration of the final rule. The EPA is announcing reconsideration of and requesting public comment on five issues raised in the petitions for reconsideration, as detailed in the SUPPLEMENTARY INFORMATION section of this document. In this action, the EPA is also proposing a limited number of technical corrections and amendments to the final rule to correct inadvertent errors and to clarify some applicability and implementation issues raised by stakeholders subject to the final rule. Also, we propose to delete rule provisions for an affirmative defense for malfunction in light of a recent court decision on the issue. The EPA is seeking comment only on the five issues being reconsidered, the proposed deletion of the affirmative defense and on the technical corrections and amendments described in the preceding paragraph. The EPA will not respond to any comments addressing any other issues or any other provisions of the final rule., 167877\u003dOn December 18, 2014, the Environmental Protection Agency (EPA) proposed national emission standards for hazardous air pollutants (NESHAP) for brick and structural clay products manufacturing and NESHAP for clay ceramics manufacturing. The EPA is extending the deadline for written comments on the proposed rule by 30 days to March 19, 2015. In addition, the EPA is changing the date of the public hearing, if requested, to January 27, 2015, and the date to pre-register for the hearing if it is held., 29501\u003dThe Texas Commission on Environmental Quality (TCEQ) has submitted updated regulations for receiving delegation of EPA authority for implementation and enforcement of National Emission Standards for Hazardous Air Pollutants (NESHAPs) for all sources (both part 70 and non-part 70 sources). These regulations apply to certain NESHAPs promulgated by the Environmental Protection Agency (EPA) at 40 CFR part 63, as amended between April 13, 2004 and April 24, 2013. The delegation of authority under this action does not apply to sources located in Indian Country. EPA is taking direct final action to approve the delegation of certain NESHAPs to TCEQ., 184623\u003dOn November 7, 2014, the Environmental Protection Agency (EPA) proposed amendments to the national emission standards for hazardous air pollutants for Phosphoric Acid Manufacturing and Phosphate Fertilizer Production source categories and to new source performance standards for several phosphate processing categories. The EPA is extending the deadline for written comments on the proposed amendments by 30 days to January 21, 2015. The EPA received requests for an extension from The Fertilizer Institute, several phosphate facilities and a testing company that supports the industry. The Fertilizer Institute has requested the extension in order to allow more time to review the proposed rule and associated emissions data, risk assessment and technology review., 46097\u003dThe Environmental Protection Agency (EPA) is approving, through a “direct final” procedure, the straight delegation of authority and approval of the mechanism used for the implementation and enforcement of certain unchanged Federal section 112 rules to the Arkansas Department of Environmental Quality (ADEQ), pursuant to section 112(l) of the Clean Air Act (Act or CAA). A more detailed description of the procedures used to implement the delegation is set forth in a memorandum of agreement (MOA) between ADEQ and EPA, dated September 17, 2014, a copy of which may be found in the docket for this rulemaking, as discussed below. The delegation only encompasses sources subject to one or more Federal section 112 standards (Part 63 standards specifically) which are also subject to the requirements of the Title V operating permits program. The delegation of authority under this action does not include authorities contained in CAA section 112(r)., 120151\u003dThe U.S. Environmental Protection Agency (EPA) is announcing the receipt of a complete petition requesting that the EPA add the chemical n-Propyl Bromide (nPB) (Chemical Abstract Service No. 106-94-5) to the list of hazardous air pollutants (HAP) contained in section 112(b)(1) of the Clean Air Act (CAA). On October 28, 2010 and November 28, 2012, the Halogenated Solvent Industry Alliance (HSIA) submitted a petition to list nPB as a HAP and a supplement to the petition, respectively. In addition, on November 24, 2011, the New York State Department of Environmental Conservation (NYSDEC) submitted a petition to add nPB to the HAP list. We have determined that these petitions are complete for purposes of this process, which means they provide sufficient information to assess the human health impacts on people living in the vicinity of facilities emitting nPB. Today\u0027s document initiates our comprehensive technical review phase of the petition process. The EPA invites the public to comment on these petitions and to provide additional data, beyond what are in these petitions, on sources, emissions, exposure, health effects and environmental impacts associated with nPB that may be relevant to our technical review. These petitions and supporting information are available through Docket ID EPA-HQ-OAR-2014-0471. Following completion of the technical review phase that is initiated by today\u0027s notice and runs through the EPA\u0027s evaluation of all the comments received, the EPA will decide whether to grant or deny the petitions., 114671\u003dOn August 5, 2014, The Dow Chemical Company (Dow) requested an Alternative Means of Emission Limitation (AMEL) under the Clean Air Act (CAA) in order to operate pressure-assisted multi-point ground flares at its Propane Dehydrogenation Plant and its Light Hydrocarbons Plant at its Texas Operations site located in Freeport, Texas. On October 21, 2014, ExxonMobil Chemical Company (ExxonMobil) requested an AMEL under the CAA for its pressure-assisted multi-point ground flares at its\u0027 Olefins Plant in Baytown, Texas, and its\u0027 Plastics Plant in Mont Belvieu, Texas. In this document, the Environmental Protection Agency (EPA) is soliciting comment on all aspects of the AMEL requests and the resulting alternative operating conditions that are necessary to achieve a reduction in emissions of volatile organic compounds (VOC) and hazardous air pollutants (HAPs) at least equivalent to the reduction in emissions required by various standards in 40 CFR parts 60, 61 and 63 that apply to emission sources controlled by these pressure-assisted multi-point ground flares. These standards point to the operating requirements for flares in the General Provisions to parts 60 and 63, respectively, to comply with the emission reduction requirements. Because pressure-assisted multi-point ground flares cannot meet the velocity requirements in these General Provisions, Dow and ExxonMobil are seeking an AMEL., 190032\u003dThe Environmental Protection Agency (EPA) is announcing that the period for providing public comments on the November 13, 2014, supplemental proposed rule titled “NESHAP Risk and Technology Review for the Mineral Wool and Wool Fiberglass Industries; NESHAP for Wool Fiberglass Area Sources” is being extended for 30 days., 56870\u003dOn January 30, 2013, the Environmental Protection Agency (EPA) finalized amendments to the National Emission Standards for Hazardous Air Pollutants for Stationary Reciprocating Internal Combustion Engines and the Standards of Performance for Stationary Internal Combustion Engines. Subsequently, the EPA received three petitions for reconsideration of the final rule. On September 5, 2013, the EPA announced reconsideration of and requested public comment on three issues raised in the petitions for reconsideration. A summary of the public comments received on the September 5, 2013, notice of reconsideration and the EPA\u0027s responses to those comments (Response to Comment document) can be found in the rulemaking docket at Docket Number EPA-HQ-OAR-2008-0708. After careful consideration of the public comments received on the September 5, 2013, notice, the EPA has determined that it will not propose any changes to the regulations at this time related to the three petition issues, and is providing notice of this decision. The EPA is informing the petitioners of the decision in separate letters to the petitioners. The letters explain the EPA\u0027s reasons for not proposing changes to the regulations for those three issues. Further discussion of the three petition issues can be found in the Response to Comment document., 157902\u003dThe Environmental Protection Agency (EPA) is announcing that the period for providing public comments on the December 8, 2014, supplemental proposed rule titled “National Emission Standards for Hazardous Air Pollutants: Secondary Aluminum Production” is being extended for 15 days., 195209\u003dThe Environmental Protection Agency (EPA) is announcing that the period for providing public comments on the October 6, 2014, supplemental proposed rule titled “National Emission Standards for Hazardous Air Pollutants: Ferroalloys Production” is being extended an additional 11 days., 220960\u003dOn February 12, 2013, the Environmental Protection Agency (EPA) finalized amendments to the national emission standards for the control of hazardous air pollutants (NESHAP) from the new and existing Portland cement manufacturing industry at major sources of hazardous air pollutants (HAP). Subsequently, the EPA has become aware of certain minor technical errors in those amendments, and is, accordingly, proposing amendments and technical corrections to the final rule. In addition, the EPA plans to remove rule provisions establishing an affirmative defense in the final technical correction rule., 285379\u003dThe Environmental Protection Agency (EPA) is announcing that the period for providing public comments on the June 30, 2014, proposed “Petroleum Refinery Sector Risk and Technology Review and New Source Performance Standards” is being extended by 60 days., 152184\u003dOn January 31, 2013, the Environmental Protection Agency (EPA) finalized amendments to the national emission standards for the control of hazardous air pollutants (HAP) from new and existing industrial, commercial, and institutional boilers and process heaters at major sources of HAP. Subsequently, the EPA received 10 petitions for reconsideration of the final rule. The EPA is announcing reconsideration of and requesting public comment on three issues raised in the petitions for reconsideration, as detailed in the SUPPLEMENTARY INFORMATION section of this notice. The EPA is seeking comment only on these three issues. The EPA will not respond to any comments addressing any other issues or any other provisions of the final rule. Additionally, the EPA is proposing amendments and technical corrections to the final rule to clarify definitions, references, applicability and compliance issues raised by stakeholders subject to the final rule. Also, we propose to delete rule provisions for an affirmative defense for malfunction in light of a recent court decision on the issue.}","lastModified":"Wed, 25 Feb 2015 14:07:59 GMT","textBeforeTable":"Additional Documents GPO FDSys XML | Text 80 FR 9613 - New Source Performance Standards and National Emission Standards for Hazardous Air Pollutants; Delegation of Authority to Louisiana 2015-02-24; vol. 80 # 36 - Tuesday, February 24, 2015 For a complete list of all Rules, Proposed Rules, and Notices view the Rulemaking tab. The following are only the Rules published in the Federal Register after the published date of Title 40. Title 40 published on 2014-07-01 For each initial compliance demonstration that does include a performance test, you must submit the notification of compliance status, including the performance test results, before the close of business on the 60th calendar day following the completion of the performance test according to § 63.10(d)(2). (2) For each initial compliance demonstration that does not include a performance test, you must submit the notification of compliance status before the close of business on the 30th calendar day following completion of","textAfterTable":"ENVIRONMENTAL PROTECTION AGENCY Direct final rule; delegation of authority. This rule is effective on April 27, 2015 without further notice, unless EPA receives relevant adverse comment by March 26, 2015. If EPA receives such comment, EPA will publish a timely withdrawal in the Federal Register informing the public that the updated NESHAPs delegation will not take effect; however, the NSPS delegation will not be affected by such action. 40 CFR Parts 60, 61, and 63 Summary The Louisiana Department of Environmental Quality (LDEQ) has submitted updated regulations for receiving delegation of Environmental Protection Agency (EPA) authority for implementation and enforcement of New Source Performance Standards (NSPS) and National Emission Standards for Hazardous Air Pollutants (NESHAPs) for all sources (both part 70 and non-part 70 sources). The delegation of authority under this action does not apply to sources located in Indian Country. EPA is providing notice that it is updating the delegation of certain NSPS to LDEQ, and taking direct final action to approve the delegation of certain NESHAPs to LDEQ. 80 FR 9622 - National Emission Standards for Hazardous Air Pollutants; Delegation of Authority to Oklahoma GPO FDSys XML","hasKeyColumn":false,"keyColumnIndex":-1,"headerRowIndex":0}