{"relation":[["","Right Hand Pattern:","Objects:","Objects affecting Navigable Airspace (CFR part 77):","Object Height:","Object Distance:"],["End 09","","Powerlines","Utility runway with a visual approach","50\u0027 AGL","1320\u0027 Along centerline"],["End 27","Yes","Powerlines","Utility runway with a visual approach","50\u0027 AGL","1320\u0027 Along centerline"]],"pageTitle":"AvnWx.com 19MS - Nichol Airpark","title":"","url":"http://maps.avnwx.com/airport/19MS","hasHeader":true,"headerPosition":"MIXED","tableType":"ENTITY","tableNum":15,"s3Link":"common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989178.64/warc/CC-MAIN-20150728002309-00273-ip-10-236-191-2.ec2.internal.warc.gz","recordEndOffset":155490140,"recordOffset":155481938,"tableOrientation":"VERTICAL","TableContextTimeStampAfterTable":"{522\u003dFAA NFDC Information Effective 56-day cycle 06/25/2015 - 8/20/2015}","lastModified":"Tue, 16 Jun 2015 20:47:04 GMT","textBeforeTable":"Grass / Sod, Fair Condition Surface: 75 feet Width: 1200 feet by Owner on 10/13/2009 Length: Runway 09/27 09/27 Runways: Runways Peter C. Nichol 1994 Hoover Road Holly Springs, Ms 38635 901-647-1793 Manager: Peter C. Nichol 1994 Hoover Road Holly Springs, Ms 38635 901-647-1793 Owner: Ownership 0 Total: Annual Operations 1 Total: 1 Single Engine GA: Based Aircraft Services Communications no Landing Fee: Unlighted Wind Indicator: Greenwood FSS (GWO) FSS: Memphis (ZME) Memphis Center (ZME) ARTCC: no Control Tower: 06/2011 Activation: Privately","textAfterTable":"Procedures NOTAMs Additional Remarks This information is current as of the date at the top of the page. These pages are valid for all US airports, based on information from FAA National Flight Data Center. Weather information is provided based on AvnWx Data Sources. NOTAM information is from FAA\u0027s NAIMES data portal. As with most information on this website, this page is generated based on FAA data, with automatic translations done via computer. You can also directly read the A/FD via the green icon link at the top of the page, which is the FAA text, and sometimes provides a different translation of codes. Please email me (using link at top-right of this page) if you see information which is confusing, misleading, or wrong....Or have suggestions for additions/changes. Comments from the user community are clearly noted as such this page, are for informational purposes only, may be wrong and/or out-of-date, and must not be used as a sole source for critical decision making. See Privacy","hasKeyColumn":true,"keyColumnIndex":0,"headerRowIndex":0}