{"relation":[["[roman]","[roman?]","[italics]","roman","||roman||","","[…]","roman"],["words that were difficult to decipher in the original or that have been conjectured by the editors","very uncertain readings","editorial interjections to explain ms. condition, to clarify ambiguous terms, or to supply missing dates","material struck out in the original ms.","text written in code by the author and decrypted by the editors","spaces left blank in the ms. by the author","damage to the manuscript that has eliminated text","text added or altered for digitization purposes"]],"pageTitle":"MHS Digital Edition: Adams Papers","title":"","url":"http://www.masshist.org/publications/apde2/?g\u003d89-00571\u0026col\u003d","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"ENTITY","tableNum":0,"s3Link":"common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042991019.80/warc/CC-MAIN-20150728002311-00090-ip-10-236-191-2.ec2.internal.warc.gz","recordEndOffset":570438528,"recordOffset":570430326,"tableOrientation":"HORIZONTAL","TableContextTimeStampBeforeTable":"{994\u003dWelcome to the Adams Papers Digital Edition, which began life as part of the Founding Families Digital Editions. Here in one, easily accessible resource you will find the content of the previously printed volumes of the Revolutionary-era Adams Papers, a long-standing documentary edition prepared at the Massachusetts Historical Society. This digital edition includes all text of the historical documents and all editorial text. There is a single consolidated index for volumes published through 2006, while the indexes for more recent volumes appear separately.}","TableContextTimeStampAfterTable":"{2943\u003dFounding Families Digital Editions: Papers of the Winthrops and Adamses © 2015 Massachusetts Historical Society}","textBeforeTable":"This digital edition displays all editorial mark up that appeared in the printed volumes; although the online view employs different conventions, the underlying code maintains the semantic value of the original transcription policies. What the Editorial Mark up Means Finding Documents Welcome to the Adams Papers Digital Edition, which began life as part of the Founding Families Digital Editions. Here in one, easily accessible resource you will find the content of the previously printed volumes of the Revolutionary-era Adams Papers, a long-standing documentary edition prepared at the Massachusetts Historical Society. This digital edition includes all text of the historical documents and all editorial text. There is a single consolidated index for volumes published through 2006, while the indexes for more recent volumes appear separately. Adams Papers   Digital Edition Papers of John Adams, volume 15 (June 1783 — January 1784) Papers of John Adams, volume 14 (October 1782 — May 1783) Adams Family Correspondence, volume 9 (January 1790 — December 1793) Adams Family Correspondence, volume 8 (March 1787 — December 1789) NEW VOLUMES: --\u003e The Adams Papers Digital Edition is undergoing active maintenance while we work on improvements to the system. You may experience slow performance or the inability to access","textAfterTable":"Creation of the Digital Edition What’s Changed from the Printed Edition? Where Are the Winthrops? The final review of Winthrop volumes is still underway. If you would like to be a beta-tester for Winthrop Papers online while final correction and delivery development is still in progress, please contact Publications: publications@masshist.org. Acknowledgments Made possible with funding from the National Endowment for the Humanities and Harvard University Press and with technical assistance from Rotunda, the electronic imprint of the University of Virginia Press. The Packard Humanities Institute contributes significantly to all Adams Papers digital projects. The Founding Families team, past and present, are William Beck, Suzanne Carroll, Dov Frede, Holly Hendricks, Ondine Le Blanc, Jeanine Rees, Sara Sikes, C. James Taylor, and Paul Fotis Tsimahides. Much of this work could not have been done without the assistance and insight of the Adams Papers editors: Karen Barzilay, Mary Claffey, Judith Graham, Margaret A. Hogan, Robert Karachuk, Gregg Lint, and Hobson Woodward. FFP also benefited from the invaluable volunteer assistance of Margaret Meaney, Marcia Shanbaum, Bill Sloan, and Constantine Zavras. Founding Families Digital Editions: Papers of the Winthrops and Adamses © 2015 Massachusetts Historical Society","hasKeyColumn":false,"keyColumnIndex":-1,"headerRowIndex":0}