{"relation":[["001","001","002","002","004","004","005","005","006","006","007","007","008","008","009","009","010","010","011","011","012","012","013","013","014","014","015","015","016","016","017","017"],["73111-SP0-A10","73111-SP0-A10","73125-SL4-000","73125-SL4-000","73150-SP0-003","73150-SP0-003","73151-SP0-003","73151-SP0-003","73160-SP0-003","73160-SP0-003","77466-SV4-000","77466-SV4-000","91534-SM4-003","91534-SM4-003","91511-SP0-003","91511-SP0-003","91512-SP0-003","91512-SP0-003","91513-SP0-003","91513-SP0-003","91514-SP0-003","91514-SP0-003","91526-SP0-003","91526-SP0-003","91528-SP0-003","91528-SP0-003","91529-SP0-003","91529-SP0-003","91535-SP0-003","91535-SP0-003","91536-SP0-003","91536-SP0-003"],["glass, fr. windshield (bronze)(aptech) Emission: KA - US Market Spec Origin: JPN","glass, fr. windshield (bronze)(aptech) Emission: KL - California Spec Origin: JPN","rubber, fr. windshield dam Emission: KA - US Market Spec Origin: JPN","rubber, fr. windshield dam Emission: KL - California Spec Origin: JPN","molding assy., r. fr. windshield side Emission: KA - US Market Spec Origin: JPN","molding assy., r. fr. windshield side Emission: KL - California Spec Origin: JPN","molding, fr. windshield (upper) Emission: KA - US Market Spec Origin: JPN","molding, fr. windshield (upper) Emission: KL - California Spec Origin: JPN","molding assy., l. fr. windshield side Emission: KA - US Market Spec Origin: JPN","molding assy., l. fr. windshield side Emission: KL - California Spec Origin: JPN","seal, fr. instrument Emission: KA - US Market Spec Origin: JPN","seal, fr. instrument Emission: KL - California Spec Origin: JPN","clip, fr. windshield molding (upper) (green) Emission: KA - US Market Spec Origin: JPN","clip, fr. windshield molding (upper) (green) Emission: KL - California Spec Origin: JPN","clip a, fr. windshield side (blue) Emission: KA - US Market Spec Origin: JPN","clip a, fr. windshield side (blue) Emission: KL - California Spec Origin: JPN","clip b, fr. windshield (upper) Emission: KA - US Market Spec Origin: JPN","clip b, fr. windshield (upper) Emission: KL - California Spec Origin: JPN","clip b, fr. windshield side (blue) Emission: KA - US Market Spec Origin: JPN","clip b, fr. windshield side (blue) Emission: KL - California Spec Origin: JPN","clip c, fr. windshield side (yellow) Emission: KA - US Market Spec Origin: JPN","clip c, fr. windshield side (yellow) Emission: KL - California Spec Origin: JPN","clip f, fr. windshield side (white) Emission: KA - US Market Spec Origin: JPN","clip f, fr. windshield side (white) Emission: KL - California Spec Origin: JPN","clip d, fr. windshield side (yellow) Emission: KA - US Market Spec Origin: JPN","clip d, fr. windshield side (yellow) Emission: KL - California Spec Origin: JPN","e-clip, fr. windshield side (black) Emission: KA - US Market Spec Origin: JPN","e-clip, fr. windshield side (black) Emission: KL - California Spec Origin: JPN","clip, r. fr. windshield corner(green) Emission: KA - US Market Spec Origin: JPN","clip, r. fr. windshield corner(green) Emission: KL - California Spec Origin: JPN","clip, l. fr. windshield corner(blue) Emission: KA - US Market Spec Origin: JPN","clip, l. fr. windshield corner(blue) Emission: KL - California Spec Origin: JPN"],["001","001","001","001","001","001","001","001","001","001","001","001","006","006","002","002","005","005","002","002","002","002","002","002","006","006","006","006","001","001","001","001"],["Contact your dealer","Contact your dealer","$43.60","$43.60","$213.14","$213.14","$44.28","$44.28","$213.14","$213.14","$27.37","$27.37","$1.53","$1.53","$3.78","$3.78","$3.78","$3.78","Contact your dealer","Contact your dealer","$3.78","$3.78","$3.78","$3.78","$2.98","$2.98","$2.98","$2.98","Contact your dealer","Contact your dealer","Contact your dealer","Contact your dealer"],["","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""]],"pageTitle":"Acura online store : 1993 legend front windshield parts","title":"","url":"http://estore.honda.com/acura/parts/parts-catalog-detail-print-view.asp?m\u003d1993-legend-4-l-5mt\u0026b\u003dB++52\u0026dl\u003d","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"ENTITY","tableNum":4,"s3Link":"common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988312.76/warc/CC-MAIN-20150728002308-00321-ip-10-236-191-2.ec2.internal.warc.gz","recordEndOffset":86254384,"recordOffset":86246182,"tableOrientation":"HORIZONTAL","textBeforeTable":"Prices shown are manufacturer suggested retail prices only. Installation cost is not included. Dealer costs may vary. Prices exclude applicable taxes. FRONT WINDSHIELD    ","textAfterTable":"91535-SP0-003 clip, r. fr. windshield corner(green) Emission: KL - California Spec Origin: JPN 001 Contact your dealer   017 91536-SP0-003 clip, l. fr. windshield corner(blue) Emission: KA - US Market Spec Origin: JPN 001 Contact your dealer   017 91536-SP0-003 clip, l. fr. windshield corner(blue) Emission: KL - California Spec Origin: JPN 001 Contact your dealer   Terms and conditions Privacy policy FAQ Contact us Acura Acura Parts 1993 LEGEND L 4 DOOR 5MT Accessories Order status Installation instructions Your Acura Dealer (Currently there is","hasKeyColumn":false,"keyColumnIndex":-1,"headerRowIndex":0}