{"relation":[["Size","Will consider","Access","Family friendly","Notes"],["Sleeps up to 6, 2 bedrooms","Corporate bookings, Long term lets (over 1 month)","Car advised","Great for children of all ages","No pets allowed, No smoking at this property"]],"pageTitle":"","title":"","url":"http://www.holidaylettings.co.uk/rentals/description/167694","hasHeader":true,"headerPosition":"FIRST_COLUMN","tableType":"ENTITY","tableNum":1,"s3Link":"common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990217.27/warc/CC-MAIN-20150728002310-00299-ip-10-236-191-2.ec2.internal.warc.gz","recordEndOffset":493920375,"recordOffset":493912331,"tableOrientation":"VERTICAL","TableContextTimeStampAfterTable":"{6096\u003dThe beautiful Cotswold villages and historic cites of Oxford, Worcester and Coventry are all within easy reach. The National Exhibition Centre, the Symphony Hall and the National Indoor Arena are 40 minutes away by car, as is the National Agricultural Centre and Royal Showground at Stoneleigh with its famous July agricultural fair.}","textBeforeTable":"Bonus: Master bedroom with double bed \u0026 single bed, 2nd bedroom can be made up with a 6ft luxury super king size bed \u0026 single or we can make up as 3 single beds. Measure Cottage comes complete with TV with Freeview, DVD/CD, free broadband connection, electric hob \u0026 oven, crockery, cutlery \u0026 utensils. Dishwasher, washing machine, microwave, fridge, freezer, toaster, vacuum, iron \u0026 ironing board. Cots \u0026 high chairs are free of charge. Hot water, electric \u0026 electric central heating plus duvets with linen \u0026 towels are also provided. Shop 1 mile. Pub 1 mile. Measure Cottage has its very own Luxury Jacuzzi Hot Tub Heated All Year Round, plus an inglenook fire place. The cottages is very spacious with coordinated decor. Open the french doors and step out onto the private cottage style garden complete with your own luxury Jacuzzi Hot Tub plus patio furniture. On the ground floor the entrance hallway leads to a spacious large living with traditional inglenook fire place. The lovely lounge areas has 2 large leather sofas, TV with freeview. The kitchen area has modern fully fitted units and ceramic floor throughout, with a dining area table with 6 chairs. The hallway has traditional wooden doors and solid wooden floors leading out to an enclosed garden. There is a ground floor toilet with wash basin. Private garden No pets allowed Car advised Great for children of all ages Key Info","textAfterTable":"Features and Facilities Luxuries Jacuzzi or hot tub, Log fire, Internet access, DVD player General Central heating, TV, CD player, Safe, Wi-Fi available Standard Kettle, Toaster, Iron, Hair dryer Utilities Dishwasher, Cooker, Microwave, Fridge, Freezer, Washing machine Rooms 2 bedrooms, 1 bathrooms of which 1 Family bathrooms Furniture Double beds (1), Single beds (4), Cots (1), Dining seats for 6, Lounge seats for 6 Other Linen provided, Towels provided, High chair Outdoors Private garden Access Parking, Suitable for people with restricted mobility, Not suitable for wheelchair users Further details indoors First Floor: sleeping a maximum of 6 people - Bedroom one can sleep 3 guests complete with double bed and single bed. Bedroom two is flexible can be made as 3 x single beds, or can have a luxury 6ft bed. The first floor has luxurious carpets. There is a bathroom with a w.c., bath with over-bath shower, heated towel rail and ceramic floor. Bonus of downstairs toilet. Private parking for one car with an additional residents parking area to the rear of the property. You can walk to the local village with selection of pubs, restaurants, take aways, supermarket, bank, tea rooms, church, history center, craft centre etc. The Warwickshire region Stratford Upon Avon is famous for the amazing William Shakespeare Tourist attractions along with an abundance of","hasKeyColumn":true,"keyColumnIndex":0,"headerRowIndex":0}