{"relation":[["Loan Type","30 Y Fixed","15 Y Fixed","30 Y Fixed Jumbo","5/1 ARM","5/1 Jumbo ARM"],["Graph","","","","",""],["Rate","3.90%","3.01%","4.29%","3.19%","3.85%"],["+/-","","","","",""],["Last Week","4.01%","3.13%","4.27%","3.26%","3.84%"]],"pageTitle":"Mortgages Will Be Higher this Year, But Don’t Panic | Fox Business","title":"","url":"http://www.foxbusiness.com/personal-finance/2014/01/08/mortgages-will-be-higher-this-year-but-dont-panic/","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"LAYOUT","tableNum":0,"s3Link":"common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988650.53/warc/CC-MAIN-20150728002308-00069-ip-10-236-191-2.ec2.internal.warc.gz","recordEndOffset":460179055,"recordOffset":460164276,"tableOrientation":"HORIZONTAL","TableContextTimeStampAfterTable":"{17048\u003dWhile no one is predicting interest rates to skyrocket, experts say they could reach 5% by year end. They also predict gyrations in rates as more information about the Fed’s tapering plans unravel. After all, when Federal Reserve Chairman Ben Bernanke first made reference to tapering plans in summer 2013 it sent rates jumping.  , 17405\u003dAccording to the Wall Street Journal, if the Fed sticks to Bernanke’s tapering guidelines, the central bank’s program will likely be complete by the end of this year. With this in mind, real estate experts say home buyers don’t have to rush out and purchase a house tomorrow to take advantage of low interest rates. After the market’s reaction in June, the Fed is being measured in its approach, which bodes well for the improving economy and interest rates., 56581\u003dThis material may not be published, broadcast, rewritten, or redistributed. ©2015 FOX News Network, LLC. All rights reserved. All market data delayed 20 minutes., 21920\u003dAccording to Walters, Fannie and Freddie’s charges account for roughly 0.5% to 0.6% of a homeowner’s interest rate today. Walters says it wouldn’t be surprising if that were to increase by 0.1%-0.2% sometime in 2014. “That would mean if today you are paying an interest rate of 4 ¾, if the guarantee fee were to increase by 0.1% or so, you’d be paying 4 7/8 after such an increase,” he says., 16121\u003dThe Federal Reserve’s announcement that it will begin to taper its $85-billion-a-month bond-buying program in January could translate into a lot of money lost or gained for homebuyers and sellers this year., 22340\u003dAt the end of the day, home buyers and sellers don’t have to monitor every fluctuation in rates, but Simon says they should be cognizant of the fact that the rates will likely increase a bit in 2014. , 16349\u003dThe central bank has been stimulating the economy and keeping interest rates low partly by purchasing billions of dollars in real estate debt and treasuries in the years following the 2008 housing collapse. But as the economy continues to mend--particularly the housing market--the Fed announced it will start to pull back the punch bowl, and that can have a direct impact on interest rates and how much we pay for a mortgage loan., 21574\u003dAlthough there is a lot of attention on what the Fed may or may not do in 2014, Bob Walters, chief economist at Quicken Loans, says consumers should be more aware of what’s happening with Fannie Mae and Freddie Mac, the two government-backed mortgage firms and the impact the moves will have on the cost of a mortgage. }","textBeforeTable":"CD Rates Autos Home Equity Mortgage Bank Rates 6 Patriotic Credit Cards No Down Payments Needed for VA Home Loans Permanent Change of Station (PCS) Tips From a Veteran Mover","textAfterTable":"Find Personalized Rates Search Loan Type Graph Rate +/- Last Week $30K HELOC 4.37% 4.38%   $50K HELOC 4.07% 4.06%   $30K Loan 4.64% 4.63%   $50K Loan 4.25% -- 4.25%   $75K Loan 4.25% -- 4.25%   Find Personalized Rates Search Loan Type Graph Rate +/- Last Week 36 M New 3.07%","hasKeyColumn":true,"keyColumnIndex":0,"headerRowIndex":0}