{"relation":[["Company","3M","Alcoa","American Express","AT\u0026T","Bank of America","Boeing","Caterpillar","Chevron Corporation","Citigroup","Coca-Cola","DuPont","ExxonMobil","General Electric","General Motors","Hewlett-Packard","The Home Depot","Intel","IBM","Johnson \u0026 Johnson","JPMorgan Chase","Kraft Foods","McDonald’s","Merck","Microsoft","Pfizer","Procter \u0026 Gamble","United Technologies Corporation","Verizon Communications","Wal-Mart"],["Symbol","MMM","AA","AXP","T","BAC","BA","CAT","CVX","C","KO","DD","XOM","GE","GM","HPQ","HD","INTC","IBM","JNJ","JPM","KFT","MCD","MRK","MSFT","PFE","PG","UTX","VZ","WMT"],["Industry","Diversified industrials","Aluminum","Consumer finance","Telecommunication","Institutional and retail banking","Aerospace \u0026 defense","Construction and mining equipment","Oil and gas","Banking","Beverages","Commodity chemicals","Integrated oil \u0026 gas","Conglomerate","Automobiles","Diversified computer systems","Home improvement retailers","Semiconductors","Computer services","Pharmaceuticals","Banking","Food processing","Restaurants \u0026 bars","Pharmaceuticals","Software","Pharmaceuticals","Non-durable household products","Aerospace, heating/cooling, elevators","Telecommunication","Broadline retailers"],["Date Added","8/9/1976","6/1/1959","8/30/1982","11/1/1999","2/19/2008","3/12/1987","5/6/1991","2/19/2008","3/17/1997","3/12/1987","11/20/1935","10/1/1928","11/7/1907","8/31/1925","3/17/1997","11/1/1999","11/1/1999","6/29/1979","3/17/1997","5/6/1991","9/22/2008","10/30/1985","6/29/1979","11/1/1999","4/8/2004","5/26/1932","3/14/1939","4/8/2004","3/17/1997"]],"pageTitle":"How To Be Listed on Dow Jones Industrial Average","title":"","url":"http://www.goodfinancialcents.com/how-to-be-listed-on-dow-jones-industrial-average/","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"RELATION","tableNum":0,"s3Link":"","recordEndOffset":0,"recordOffset":0,"tableOrientation":"HORIZONTAL","TableContextTimeStampAfterTable":"{74241\u003dAlliance Wealth Management, LLC Jeff Rose, Certified Financial Planner? 115 S. Washington St. Carbondale, IL 62901 (866)267-2591, 19900\u003dUpdate: Cisco and Traveler’s Co. will be replacing GM and Citi at the end of trading June 8, 2009., 74722\u003dCopyright ? 2008-2012 Good Financial Cents. All Rights Reserved. Disclaimers., 7075\u003dIt never fails that everyday I get the question, “How did the market do?” or “How’s the market doing?”.? The market that everybody is always referring to is the Dow Jones Industrial Average.? The Dow (for short) was founded May 26, 1896 initially only having 12 companies from important American industries (hence: “Industrial” average).? The Dow currently reflects the top 30 U.S. Companies across it’s various industries.? To compute the Dow that you hear about each day, a lengthy geometric formula is used that takes the price-weighted? stock price of each company and divides by the “DJIA divisor”.? The divisor is a number that is constantly adjust to reflect stock splits, mergers, and dividend payments.?}","lastModified":"","textBeforeTable":"Here’s a look at the current holdings in the Dow Jones: Current Holdings Dow Jones The most common criticism of the Dow is that it only represents 30 companies yet it’s recognized as “The” market indicator.? Even though the S\u0026P 500 represents the top 500 US companies and is a better reflection of our economy, when people ask me about the “market”, I assure you it’s not the s\u0026P 500. It never fails that everyday I get the question, “How did the market do?” or “How’s the market doing?”.? The market that everybody is always referring to is the Dow Jones Industrial Average.? The Dow (for short) was founded May 26, 1896 initially only having 12 companies from important American industries (hence: “Industrial” average).? The Dow currently reflects the top 30 U.S. Companies across it’s various industries.? To compute the Dow that you hear about each day, a lengthy geometric formula is used that takes the price-weighted? stock price of each company and divides by the “DJIA divisor”.? The divisor is a number that is constantly adjust to reflect stock splits, mergers, and dividend payments.? What is the Dow Jones? The Dow Jones Industrial average is heading for a imminent change with the expected bankruptcy filing of auto giant General Motors. With the falling out of the once legendary blue chip stock, many of my clients have inquired to how companies get listed on the Dow Jones Industrial Average and when are they replaced.? I thought","textAfterTable":"When Does a Stock Get Dropped from the Dow? A stock is dropped from the Dow Jones when it seems warranted.?? As mentioned before, General Motors is presumed to be soon removed from the Dow especially if it files for bankruptcy.? A likely candidate to join GM is (former) banking giant Citigroup. .? Here are some of the more notable changes in recent history: September 22, 2008: Kraft Foods replaced AIG (American International Group) February 19, 2008:? (My wife’s b’day ? Chevron and Bank of America replaced Altria Group and Honeywell April 8, 2004: Pfizer, Verizon, and AIG replaced International Paper, AT\u0026T, and Eastman Kodak Who Will Replace GM? GM out of the Dow? There aren’t any preset rules on how a company gets replaced on the Dow.?? Looking at past replacements, typically the Dow does not replace an exiting company with another in it’s same industry.? Currently, there are several speculations on which company is going to replace them.? A few possibilities include: Cisco, Visa, Amazon, Wells Fargo, and mother Google.? Time will tell. Update: Cisco and Traveler’s Co. will be replacing GM and Citi at the end of trading June 8, 2009. Securities offered through LPL Financial, Member FINRA/SIPC","hasKeyColumn":true,"keyColumnIndex":0,"headerRowIndex":0}