{"relation":[["","Fianna Fáil","Fine Gael","Labour Party","Progressive Democrats","Green Party","Sinn Féin","Socialist Party","Total"],["Funding received under the Party Leaders Allowance for 2005 ?","2,472,866","1,927,929","1,296,765","467,066","352,555","293,795","58,759","6,869,735"],["Funding received under the Electoral Acts for 2005 ?","2,124,237","1,209,218","645,799","440,413","317,782","312,207","Nil","5,049,656"],["Total Exchequer Funding for 2005 ?","4,597,103","3,137,147","1,942,564","907,479","670,337","606,002","58,759","11,919,391"]],"pageTitle":"Press Releases, Standards in Public Office Commission","title":"","url":"","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"RELATION","tableNum":0,"s3Link":"","recordEndOffset":0,"recordOffset":0,"tableOrientation":"HORIZONTAL","TableContextTimeStampAfterTable":"{6676\u003dDate Released: 16.05.2006, 16371\u003dIssued by the Standards in Public Office Commission on 16 May 2006, 7102\u003dFigures released today by the Standards in Public Office Commission (the Standards Commission) show that qualified political parties received almost ?12m in direct funding from the Exchequer during 2005. (Actual figure ?11,919,391), 8957\u003dEach of the 13 registered political parties was required, under the Electoral Acts, to furnish a Donation Statement to the Standards Commission indicating whether or not any donations exceeding ?5,078.95 in value were received by them during 2005. Donations from the same donor during the year must be aggregated. (Donations valued at ?5,078.95 or less are not required to be disclosed). The maximum value of donations which a political party can accept from the same donor in the same year is ?6,348.69., 14341\u003dTotal Exchequer Funding for 2005, 7348\u003dPolitical parties also disclosed donations received during 2005 with a total value of ?142,917., 14236\u003dFunding received under the Electoral Acts for 2005, 14117\u003dFunding received under the Party Leaders Allowance for 2005 ?, 9475\u003dFour political parties disclosed donations valued in excess of ?5,078.95 received during 2005. Fianna Fáil disclosed donations with the highest value (?76,498)., 7567\u003dSix qualified parties (Fianna Fáil, Fine Gael, Labour, Sinn Féin, Progressive Democrats and the Green Party) received funding of ?5,049,656 in respect of 2005 under the Electoral Acts. The same six parties together with the Socialist Party qualify for funding under the Party Leaders Allowance legislation and received payments of ?6,869,735 in respect of 2005. Table A below gives a breakdown of the funding received by qualified political parties in respect of 2005., 8385\u003dNon-party members of Dáil Éireann and Seanad Éireann also receive funding under the Party Leaders Allowance scheme. The total amount paid to non-party members of Dáil Éireann during 2005 was ?467,273. The total amount paid to non-party members of Seanad Éireann was ?96,054. Non-party members of Dáil or Seanad Éireann are not required to furnish to the Standards Commission a Statement of Expenditure in relation to the allowance.}","lastModified":"","textBeforeTable":"Table A: Total Exchequer funding of qualified political parties in 2005 under the Electoral Acts and the Party Leaders Allowance The Donation Statements and Statements of Expenditure and Auditors\u0027 Reports furnished to the Standards Commission may be inspected and copied by members of the public at its offices at 18 Lower Leeson Street, Dublin 2. The information is also available, in summary form, on the Standards Commission\u0027s website www.sipo.gov.ie. Report to the Ceann Comhairle concerning annual Donation Statements in respect of 2005 furnished by political parties. Tables 1 to 5 of this report show details of the donations disclosed by political parties. This report also contains details of returns furnished to the Standards Commission by the \"accounting units\" of political parties. Table 6 of the report gives a summary of the returns received from \"accounting units\". Report to the Ceann Comhairle concerning Statements of Expenditure and Public Auditors\u0027 Reports, in respect of 2005, furnished under the Electoral Acts by qualified political parties. Table 1 of this report provides details of the funding received in respect of 2005 while Table 2 shows how the funding was used. Report to the Minister for Finance concerning Statements of Expenditure and Public Auditors\u0027 Reports, in respect of 2005, furnished under the Party Leaders Allowance legislation by qualified political parties. Table 1 of this report provides details of the funding received in respect of 2005 while Table 2 shows how the","textAfterTable":"Issued by the Standards in Public Office Commission on 16 May 2006 Telephone: 01- 6395712 Fax: 01- 6395684 e-mail: sipo@sipo.gov.ie Back to contents Home - Sitemap - Contact Us | | |","hasKeyColumn":true,"keyColumnIndex":0,"headerRowIndex":0}