{"relation":[["Candidate or Ballot-Vote","Carl Langner","Gerald Lauer"],["Vote percentage","56.5%","43.4%"],["Vote count","(125)","(96)"]],"pageTitle":"Colorado 2013 Election Results: Elections: The Denver Post","title":"","url":"http://data.denverpost.com/election/results/county/colorado/2013/","hasHeader":true,"headerPosition":"MIXED","tableType":"RELATION","tableNum":123,"s3Link":"common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992543.60/warc/CC-MAIN-20150728002312-00082-ip-10-236-191-2.ec2.internal.warc.gz","recordEndOffset":58501271,"recordOffset":58463109,"tableOrientation":"VERTICAL","TableContextTimeStampBeforeTable":"{1890\u003dColorado Elections › Results › 2013 › By County › Colorado}","TableContextTimeStampAfterTable":"{446681\u003dTheodore \"Ted\" May}","lastModified":"Tue, 04 Aug 2015 23:56:20 GMT","textBeforeTable":"Thompson School District R2-J School Board Director, Thompson School District R2-J District F county election returns » View full results for the Thompson School District R2-J District E election here. Updated 1 year, 8 months ago (112)   49.5% Rocci Bryan (114)   50.4% Lori Hvizda Ward Vote count Vote percentage Candidate or Ballot-Vote Thompson School District R2-J School Board Director, Thompson School District R2-J District E county election returns » View full results for the Thompson School District R2-J District B election here. Updated 1 year, 8 months ago (107)","textAfterTable":"Updated 1 year, 8 months ago » View full results for the Thompson School District R2-J District F election here. Weld County School District RE-8 School Board Director, Weld County School District RE-8 District C county election returns Candidate or Ballot-Vote Vote percentage Vote count Janice A. Wilkin 55.1%   (1,165) Gary Montoya 44.8%   (949) Updated 1 year, 8 months ago » View full results for the Weld County School District RE-8 District C election here. Weld County School District RE-8 School Board Director, Weld County School District RE-8 District D county","hasKeyColumn":true,"keyColumnIndex":0,"headerRowIndex":0}