{"relation":[["Year","2014","2013","2012"],["Taxes","$5,498 (+2.19%)","$4,844 (+2.12%)","$2,229"],["Land","$0","$0","$0"],["Improvements","$0","$0","$0"],["Assessment","$250,530","$227,760","$144,450"]],"pageTitle":"2419 Marathon Ln, Fort Lauderdale, FL, 33312 - Real Estate RealtyTrac","title":"","url":"http://www.realtytrac.com/property/fl/fort-lauderdale/33312/2419-marathon-ln/140482904","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"RELATION","tableNum":3,"s3Link":"common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989891.18/warc/CC-MAIN-20150728002309-00293-ip-10-236-191-2.ec2.internal.warc.gz","recordEndOffset":672931439,"recordOffset":672898298,"tableOrientation":"HORIZONTAL","TableContextTimeStampAfterTable":"{60202\u003dThe USGS database shows that there is a 93.0% chance of a major earthquake within 30 miles of Irvine, CA within the next 50 years. The largest earthquake within 31.8 miles of Irvine, CA was a 5.9 Magnitude in 1987., 51492\u003d2419 Marathon Ln is located in Broward county, FL. The most recently recorded radon levels indicate that Broward county is a Zone 3 county. Zone 3 counties have predicted average indoor radon screening level less than 2 pCi/L (picoucuries per liter)., 104480\u003d © 1996- Renwood RealtyTrac LLC. All Rights reserved | Privacy | Terms of Use, 3666\u003dThis single family residence is located at 2419 Marathon Ln, Fort Lauderdale, FL 33312. It has approximately 1,441 square feet of living space. This property is not in foreclosure with an estimated market value of $394,782., 98401\u003d2419 Marathon Ln, Fort Lauderdale, FL 33312 is a Single Family Residence located in Broward County, Florida. 2419 Marathon Ln was built in 1956 and sits on a 7,150 square foot lot}","textBeforeTable":"Tax History powered by Start quote now Select Service Quote Type: Get fast, free home insurance quotes in moments! Get Quote US Insurance Home Insurance: powered by *See site for details 855-410-9039 Learn More Starting from $53.99/mo* Cloud Storage Home Security Energy Management Home Automation Vivint Packages \u0026 Pricing — To Fit Your Home. $53.99/mo* Vivint Home Solutions: powered by Click \u0027Learn More\u0027 for details 855-410-4262","textAfterTable":"Nearby Homes Loading... Transaction History   1Transactions found for this property view hide sample Sign up for a free trial sample only Transfer of ownership Finance Foreclosure notice Date/Transaction Price Loan Parties 09/27/2014: Foreclosure (NTS) $696,106 (opening bid) $0.00 Borrower: Michael C Mitchell Trustee: Sage Point Lender Services history-opener Full Details for Notice of Trustee Sale (NTS) Document Number 00000240234 Recording Date 07/14/2014 Auction Date 08/07/2014 Auction Time 1:30PM Auction Location 700 Civic Center Dr W Santa Ana Opening Bid $696,000","hasKeyColumn":false,"keyColumnIndex":-1,"headerRowIndex":0}