{"relation":[["","","","","",""],["API Name","Demographics Pro","DoSomething","Klear","Spiritual Networks","Yammer OG Sample Activities"],["Description","The Demographics Pro REST API provides a set of interfaces allowing the integration of social media demographic data into other applications. Some example API methods include aggregating audience...","The DoSomething API allows developers to interact with its campaigns for social change programmatically. Campaigns tackle a variety of issues, including poverty, violence, and environmental...","The Klear REST API allows developers to access and integrate the functionality of Klear with other applications. Some example API methods include looking up users, retrieving user information, and...","The Spiritual Networks connect over 1,000,000 people on Facebook and Twitter interested in spiritual living with chakra healing, intuition, lightworkers, mediums, and yoga as the main common topics....","The Yammer OG Sample Activities API provides developers with samples of both public and private activities. “Non-public” means the provided URL cannot be publicly accessed and scraped for OG metadata..."],["Category","Demographics","Charity","Social","Social","Social"],["Date","07.10.2015","06.30.2015","06.30.2015","06.29.2015","06.16.2015"]],"pageTitle":"Babbl.me API | ProgrammableWeb","title":"","url":"http://www.programmableweb.com/api/babbl.me","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"RELATION","tableNum":0,"s3Link":"common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986423.95/warc/CC-MAIN-20150728002306-00067-ip-10-236-191-2.ec2.internal.warc.gz","recordEndOffset":675864175,"recordOffset":675840494,"tableOrientation":"HORIZONTAL","TableContextTimeStampAfterTable":"{26821\u003dAs the the world\u0027s leading source of news and information about Internet-based application programming interfaces (APIs), ProgrammableWeb.com is known as the Web\u0027s defacto journal of the API economy. Since it was founded in 2005, ProgrammableWeb has been chronicling the daily evolution of the global API economy while amassing the Web\u0027s most relied-on directory when it comes to discovering and searching for APIs to use in Web and mobile applications.}","textBeforeTable":"/View all Promoted RELATED APIs Add Mashup Sorry, no mashups for this API. /View all API Mashups (0) Add Mashup Sorry, no developers found for this API. /View all Developers (0) Track this API","textAfterTable":"Source Code Sorry, no source code for this API. Sorry, no resources found for this API. Developers (0) Add Mashup Comments (0) Comment * Leave this field blank Post Comment Followers (4) Track this API","hasKeyColumn":false,"keyColumnIndex":-1,"headerRowIndex":0}