{"relation":[["Company","RELV Reliv International Inc.","NATR Nature\u0027s Sunshine Products Inc.","CYAN Cyanotech Corp.","PRPH ProPhase Labs Inc.","NUS Nu Skin Enterprises Inc. Cl A","AVP Avon Products Inc.","HLF Herbalife Ltd.","REV Revlon Inc. Cl A","MTEX Mannatech Inc.","RCPI Rock Creek Pharmaceuticals Inc."],["Change","+4.75% +0.06","-0.08% -0.01","-0.25% -0.02","- -","-0.48% -0.19","+2.90% +0.16","-1.14% -0.58","-1.43% -0.52","+0.32% +0.06","-6.35% -0.08"],["P/E (TTM)","15.98","34.81","-","-","14.11","-","14.14","55.34","6.38","-"]],"pageTitle":"USNA Stock Price \u0026 News - USANA Health Sciences Inc. - Wall Street Journal","title":"","url":"http://quotes.wsj.com/USNA?mod\u003darticleInlineTicker","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"RELATION","tableNum":1,"s3Link":"common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989891.18/warc/CC-MAIN-20150728002309-00136-ip-10-236-191-2.ec2.internal.warc.gz","recordEndOffset":204520663,"recordOffset":204494303,"tableOrientation":"HORIZONTAL","textBeforeTable":"Competitors USNA Advertisement N/A Stock Money Flow Money flow measures the relative buying and selling pressure on a stock, based on the value of trades made on an \"uptick\" in price and the value of trades made on a \"downtick\" in price. The up/down ratio is calculated by dividing the value of uptick trades by the value of downtick trades. Net money flow is the value of uptick trades minus the value of downtick trades. Our calculations are based on comprehensive, delayed quotes. Money Flow Uptick/Downtick Ratio ? 12.95% Percent of Float 13.03% Change from Last 742,660 Shares Sold Short (07/15/15) Short Interest Total short positions relative to the number of shares available to trade.","textAfterTable":"More information on USNA Competitor Data Provided By: capital cube Profile USNA USANA Health Sciences, Inc. develops and manufactures nutritional, personal care and weight-management products. The USANA Nutritionals product line divided into four categories: Essentials, Optimizers, Foods and Sense-beautiful science. The Essentials Nutritionals... 3838 West Parkway Boulevard Salt Lake City Utah 84120 United States Email Website Map Employees 1,527 Sector Food Products Sales or Revenue 790.47 M Industry Consumer Goods 1Y Sales Change 10.07% Fiscal Year Ends December 31 Download Reports Myron W. Wentz Chairman","hasKeyColumn":true,"keyColumnIndex":0,"headerRowIndex":0}