{"relation":[["Model name","AX-Synth","Fantom-G6 Fantom-G7 Fantom-G8","Fantom-X6 Fantom-X7 Fantom-X8","Fantom-XR","GAIA SH-01","GW-8","INTEGRA-7","JUNO-Di","JUNO-G","JUNO-Gi","JUNO-STAGE","JUPITER-50","JUPITER-80","Lucina AX-09","SH-201","SonicCell","V-Synth GT"],["Hardware\u0026 Driver","Yes","Yes","Yes","Yes","Yes","Yes","Yes","Yes","Yes","Yes","Yes","Yes","Yes","Yes","Yes","Yes","Yes"],["Exclusive Software","No","No","No","No","-","No","Yes","No","No","-","No","Yes","Yes","-","No","No","No"],["Remarks","Compatible with the original driver came with Windows 8. * Compatible driver here. Exclusive Software: AX-Synth Editor: Cannot work","Driver: Compatible driver here. Exclusive Software: stand-alone Fantom-G Editor: Sorry but it is out of support. Fantom-G Librarian: Sorry but it is out of support. plug-in Fantom-G Editor: Cannot work","Driver: Compatible driver here. * Fantom-X6/7/8 Audio Track Expansion version only (Ver.1.xx is not supported). Exclusive Software: Fantom-X Editor: Sorry but it is out of support. Fantom-X Librarian: Sorry but it is out of support. Fantom-X Sample Converter: Sorry but it is out of support.","Driver: Compatible driver here. * Fantom-XR Sample Tools Expansion version only (Ver.1.xx is not supported). Exclusive Software: Fantom-X Editor: Sorry but it is out of support. Fantom-X Librarian: Sorry but it is out of support. Fantom-X Sample Converter: Sorry but it is out of support.","Driver: Compatible driver here.","Driver: Compatible driver here. Exclusive Software: GW-8 Playlist Editor: Sorry but it is out of support. GW-8 Style Converter: Sorry but it is out of support.","Driver: Compatible driver here. Exclusive Software: INTEGRA-7 Motional Surround Editor: Compatible with Ver.1.00 or later.","Driver: Compatible driver here. Exclusive Software: JUNO-Di Editor/Librarian: Sorry but it is out of support. Playlist Editor: Sorry but it is out of support.","Driver: Compatible driver here. Exclusive Software: JUNO-G Editor/Librarian: Sorry but it is out of support.","Driver: Compatible driver here.","Driver: Compatible driver here. Exclusive Software: JUNO-STAGE Editor/Librarian: Sorry but it is out of support. Playlist Editor: Sorry but it is out of support.","Driver: Compatible driver here. Exclusive Software: JUPITER-50 Control Surface Plug-in for SONAR: Compatible application here.","Driver: Compatible driver here. Exclusive Software: JUPITER-80 Control Surface Plug-in for SONAR: Compatible application here.","Driver: Compatible driver here.","Driver: Compatible driver here. Exclusive Software: stand-alone SH-201 Editor/Librarian: Sorry but it is out of support. plug-in SH-201 Editor : Cannot work","Driver: Compatible driver here. Exclusive Software: stand-alone SonicCell Editor/Librarian: Sorry but it is out of support. SonicCell Playlist Editor: Sorry but it is out of support. plug-in SonicCell Editor : Cannot work","Driver: Compatible driver here. Exclusive Software: V-Synth GT Librarian: Sorry but it is out of support."]],"pageTitle":"Compatibility with Windows(R) ... :: PC-50 :: Information :: Support :: Roland","title":"","url":"http://roland.com/support/article/?q\u003dinformation\u0026p\u003dPC-50\u0026id\u003d62483215","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"RELATION","tableNum":9,"s3Link":"common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992543.60/warc/CC-MAIN-20150728002312-00214-ip-10-236-191-2.ec2.internal.warc.gz","recordEndOffset":207293020,"recordOffset":207282678,"tableOrientation":"HORIZONTAL","TableContextTimeStampBeforeTable":"{2049\u003d2014/10/31, 2010\u003dPublished at 2012/10/26}","TableContextTimeStampAfterTable":"{71349\u003dCopyright © 1999-2014 Roland Corporation. All Rights Reserved.}","textBeforeTable":"Audio Interface Regarding the 32-bit Edition, please refer to Compatibility with Windows(R) 8 32-bit Edition. Will be verified with Windows(R) 8 64-bit Edition To be verified Will be compatible with Windows(R) 8 64-bit Edition To be updated We are sorry but we have no plan to make it compatible with Windows(R) 8 64-bit Edition No: No plan for compatible version Compatible with Windows(R) 8 64-bit Edition with limited operation. Limited: Limited compatibility Compatible with Windows(R) 8 64-bit Edition Yes: Compatible Legend     [ Organ ] [ Digital Piano ] [ DJ / VJ Product ] [ Drums \u0026 Percussion ] [ Guitar \u0026 Bass related ] [ Recorder ] [ Accordion ] [ Arranger ] [ Synthesizer ] [ Pro Audio-Video ] [ Other DTMP Product ] [ Software Product ] [ V-STUDIO ] [ MIDI Keyboard Controller ] [ MIDI Interface ] [ Audio Interface ] Please select a product category to jump. For the products introduced after Windows 8, please refer to each product information page","textAfterTable":"UM-3G Yes - Driver: Compatible driver here. UM-550 Yes - Driver: Compatible driver here. UM-880 Yes - Driver: Compatible driver here. UM-ONE UM-ONE mk2 Yes - Driver: Compatible driver here. MIDI Keyboard Controller Model name Hardware\u0026 Driver Exclusive Software Remarks A-300PRO A-500PRO A-800PRO Yes Yes Driver: Compatible driver here. Exclusive Software: A-PRO Editor : Compatible application here. A-PRO Control Surface Plug-in for SONAR : Compatible application here. A-49 Yes - Driver: Compatible driver here. A-500S Yes - Driver: Compatible driver here. A-88 Yes - Driver: Compatible driver here. PC-50 Yes - Driver: Compatible driver here. PC-80 No -   PCR-1 No No   PCR-30 PCR-50 PCR-80 PCR-M1 PCR-M30 PCR-M50 PCR-M80 Yes No Driver: Compatible driver here. Exclusive Software:","hasKeyColumn":false,"keyColumnIndex":-1,"headerRowIndex":0}