{"relation":[["","HELPS WHO","NEGATIVE","POSITIVE","FIGHTING","MENTAL-COURT","REQUESTS"],["PASSIVE","them","doormat","agreeable","surrenders","victim","yes"],["PASSIVE- AGGRESSIVE","them with resentment","sarcastic","flexible","sabotages","prosecutor","probably"],["ASSERTIVE","me and them","self-centered","strong","defends","judge jailer","we will see"],["AGGRESSIVE- PASSIVE","me with insecurity","all bark and no bite","will compromise","threatens","defender","doubtful"],["AGGRESSIVE","me","violent","takes care of number 1","attacks","offender","no"]],"pageTitle":"Passive to Aggressive Explored Using The 5 Thinking Positions","title":"","url":"http://www.kevinfitzmaurice.com/commu_passive_aggressive.htm","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"RELATION","tableNum":2,"s3Link":"common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989790.89/warc/CC-MAIN-20150728002309-00011-ip-10-236-191-2.ec2.internal.warc.gz","recordEndOffset":535570288,"recordOffset":535562086,"tableOrientation":"HORIZONTAL","lastModified":"Mon, 27 Jul 2015 01:56:10 GMT","textBeforeTable":"• Attitude Is All You Need! Second Edition will help you to improve your attitude, which improves everything else. eBOOKS SURF","textAfterTable":"This table is based on: The 5 Thinking Positions See The 5 Thinking Positions used in another table: 25 Relational Styles QUOTATIONS VARIOUS SOURCES \"Be who you are and say what you feel, because those who mind don\u0027t matter and those who matter don\u0027t mind.\"--Dr. Seuss \"It is better to keep one\u0027s mouth shut and be thought a fool than to open it and resolve all doubt.\"--Abraham Lincoln \"Blessed is the man who, having nothing to say, abstains from giving us worthy evidence of the fact.\"--George Eliot \"Silence is one of the hardest arguments to refute.\"--Josh Billings \"Some man holdeth his tongue, because he hath not to answer: and some keepeth silence, knowing his time.\"--Ecclesiasticus 20:6 \"Treat a man as he is, and he will remain as he is. Treat a man as he could be, and he will become what he should be.\"--Ralph Waldo Emerson \"The most precious things in speech are pauses.\"--Ralph Richardson \"Don\u0027t speak unless you can improve on the silence.\"--Spanish proverb \"Foolishness always results when the tongue outraces the brain.\"--Unknown","hasKeyColumn":true,"keyColumnIndex":0,"headerRowIndex":0}