{"relation":[["Cited Patent","US4037372 *","US4161853 *","US4566236 *","US4586301 *","US4665670 *","US4769877 *","US5222343 *","US5426897 *"],["Filing date","Jun 9, 1975","Nov 25, 1977","Feb 9, 1984","Aug 6, 1984","Jul 19, 1985","May 15, 1986","May 3, 1991","Jan 3, 1994"],["Publication date","Jul 26, 1977","Jul 24, 1979","Jan 28, 1986","May 6, 1986","May 19, 1987","Sep 13, 1988","Jun 29, 1993","Jun 27, 1995"],["Applicant","Johns-Manville Corporation","A. R. Nelson Co., Inc.","Pound John A","W. P. Hickman Company","Den Burg Wouter M Van","Conley John L","Carl Anderson","Gazaway; Vaden S."],["Title","Roof facia arrangement","Resilient wall protector","Greenhouse structure element","Retainer clamp membrane fastening system","Two-piece lock for securing polymeric sheeting over greenhouses","Gripper with innerlock","House trim panels for use with siding and method of assembling the panels","Glass restraint system and windows"]],"pageTitle":"Patent US5553422 - Glass restraint system for windows - Google Patents","title":"","url":"http://www.google.com/patents/US5553422?dq\u003d6,275,983","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"RELATION","tableNum":5,"s3Link":"common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986423.95/warc/CC-MAIN-20150728002306-00052-ip-10-236-191-2.ec2.internal.warc.gz","recordEndOffset":492040539,"recordOffset":492018880,"tableOrientation":"HORIZONTAL","TableContextTimeStampAfterTable":"{25330\u003dThis application is a continuation-in-part of my U.S. and PCT applications entitled \"GLASS RESTRAINT SYSTEM FOR WINDOWS\", respectively filed Jan. 3, 1994 as U.S. Ser. No. 08/176,537 now U.S. Pat. No. 5,426,897, and Jan. 3, 1995 as PCT/US95/00179.}","textBeforeTable":"Patent Citations Although several alternative embodiments of the present invention have been described above, it will be appreciated that certain alterations and modifications thereof will become apparent to those skilled in the art. For example, a similar structure and assembly could be used to secure glass panes within doors. It is therefore intended that the appended claims be interpreted as covering all such alterations and modifications as fall within the true spirit and scope of the invention. The objective of this embodiment is, like that depicted in FIG. 5, to better secure the film edges to the window frame by folding it back over the base strip and clamping it between the base strip and the cap strip. While two embodiments accomplishing this objective are illustrated, it is understood that many other folding and clamping configurations could be used. The configuration depicted in FIG. 6 is preferred because during installation, rotation of cap 520 into place aids in the folding of the somewhat stiff film material over the base strip and does not allow the film edge to bunch up under the cap. Note that forces applied to film 500 tending to pull it from beneath base 503 will be transferred to cap 520 as the film tries to unseat rib 536 from slot 510. However, it will be apparent that such rightward force (as illustrated) will tend to bias cap 520 rightwardly effecting an even tighter lock","textAfterTable":"* Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US5778629 * Dec 11, 1996 Jul 14, 1998 Howes; Stephen E. Impact resistant window US5937611 * Jul 28, 1997 Aug 17, 1999 Howes; Stephen E. Method of making an impact resistant window US5960606 * Feb 28, 1997 Oct 5, 1999 Dlubak; Francis Charles Penetration resistant window US5992107 * Jun 20, 1997 Nov 30, 1999 Poirier; Paul W. Apparatus for edge mounting security window film in a window frame US6101783 * Oct 7, 1998 Aug 15, 2000 Howes; Stephen E. Impact resistant window US6237306 Apr 23, 1999 May 29, 2001 Francis Charles Dlubak Penetration resistant window US6367210 Jul 30, 1998 Apr 9, 2002","hasKeyColumn":true,"keyColumnIndex":3,"headerRowIndex":0}