{"relation":[["Term","Analog (Analogue)","Atomizer","Atomizer Bridge","Battery","Cartomizer","Cartridge","e-cig","E-Cigarette","e-liquid","e-smoke","Electronic Cigarette","mod","Nicotine Level","Personal Vaporizer","Propylene Glycol","Smoke Juice","Vegetable Glycerin","wick"],["Description","The name given to traditional tobacco cigarettes by those who now use an electronic cigarette. If the e-cig is the electronic version, the tobacco version is the analog.","The atomizer is contained in a metal housing that screws into the battery. When the mouthpiece is removed, it looks like a silver loop of metal. The atomizer is what turns the liquid into a vapor. This is the part in the middle of the e-cigarette that says \"PROSMOKE\".","The atomizer bridge is the metal \"bridge\" on the atomizer that actually heats and vaporizes the liquid inside the cartridge. The metal is porous and is reinforced with porcelain underneath to make it the best atomizer on the market.","The battery is what provides power to the atomizer when the user inhales on the mouthpiece. It is general lithium ion, ranges in size and has an LED light on the end that glows when it is activated, ie. when it is inhaled upon. Manual switched batteries have a button to activate rather than activation upon inhalation.","A combination of disposable atomizer and cartridge. It is not considered to be refillable, although some users do manage to do so. It does not perform as well as a 3 piece design and doesn\u0027t have the capacity or lifespan of our 2 peice","The cartridge is a small piece that slides on to the atomizer and contains the eliquid that is vaporized for inhalation.","The Electronic Cigarette is a new product available thanks to recent technology. This “E-Cigarette” is a revolutionary device that acts much the same way an ordinary tobacco cigarette would, but rather than producing smoke from combustion, it produces vapor from vaporization of the E-Liquid. This is also why many e-smokers referred to their Electronic Cigarettes as Personal Vaporizers (PV).","The Electronic Cigarette is a new product available thanks to recent technology. This “E-Cigarette” is a revolutionary device that acts much the same way an ordinary tobacco cigarette would, but rather than producing smoke from combustion, it produces vapor from vaporization of the E-Liquid. This is also why many e-smokers referred to their Electronic Cigarettes as Personal Vaporizers (PV).","E-Liquid is the substance used to saturate the wick and will be heated by the atomizer for vaporization into an inhalable vapor. There are many different types of E-Liquid available on the market. ProSmoke is one of the only companies on the market to use vegetable based liquids and not the chemical known as PG for its base.","E-Smoke is a term used for the action of smoking the electronic cigarette. E-Smoke is also known as a “Vapor” as the action of electronic smoking is actually caused by a vaporization process. As the vapor produced is not caused by combustion and does not burn, it is technically not smoke.","The Electronic Cigarette is a new product available thanks to recent technology. This “E-Cigarette” is a revolutionary device that acts much the same way an ordinary tobacco cigarette would, but rather than producing smoke from combustion, it produces vapor from vaporization of the E-Liquid. This is also why many e-smokers referred to their Electronic Cigarettes as Personal Vaporizers (PV).","A design variation of a normally manufactured battery, atomizer, or cartridge. Mods are generally done by avid e-smokers looking to increase vapor production, battery life, or ease of use.","The nicotine level is the amount of nicotine present in a cartridges e-liquid. It is usually measured in mg/ml.","Personal Vaporizer is another term for electronic cigarette. The electronic cigarette uses an atomizer to vaporize the liquid needed to create a vapor for inhalation and exhalation.","Propylene glycol is one of the main components used in the nicotine solution in our COMPETITORS products. It has been approved by the FDA for some products, including makeup, but is also used in products such as radiator fluid (coolant). Since the FDA has only done minimal testing on the inhalation of all e-cigarette solution varieties, concerns have arisen over certain ingredients used and their adverse health effects for human consumption; especially in comparison to traditional tobacco cigarettes. Thorough FDA and Independent testing has not been performed on the safety of inhalation of Propylene glycol being vaporized and inhaled, but there have been reports of negative effects, including allergic reactions to the substance that can include nausea, dizziness and more. Industry research indicates a higher frequency of adverse reactions to it than a vegetable based solution. Since this is a concern, PROSMOKE DOES NOT USE PROPYLENE GLYCOL as the base of its flavored cartridges. We use Vegetable Glycerin as a substitute for Propylene Glycol, which due to the health concerns, we consider to be a better product while continuing to give superior performance and vapor production. Hundreds and hundreds of hours of research has gone into making the ProSmoke solution the best on the market! In comparison to PG. VG produces more vapor and does not irritate your throat while still giving you a great smooth \"throat hit\". As both VG, PG and other e-liquid variants continue to undergo more thorough testing, ProSmoke will always be in forefront of the market and choosing what we feel is the best solution for our customers. Although both are currently used successfully in our industry, when given a choice between the PG chemical compound and our vegetable based liquid, customers overwhelmingly choose ProSmoke!","Smoke Juice is an interchangeable word for E-Liquid.","Vegetable Glycerin is an alternative to Propylene Glycol and is used as the base in the ProSmokes E-Liquid. Vegetable Glycerin comes from the production of palm or coconut oils and considered to be the best option for electronic cigarette users.","The wick is material inside of the cartridge that looks like cotton and holds the saturated e-liquid inside of it. The solution soaked in the wick is vaporized and inhaled."]],"pageTitle":"Glossary All","title":"","url":"http://www.prosmokestore.com/kb/glossary/QWxs/0/rss2.php?limit\u003d30","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"RELATION","tableNum":7,"s3Link":"common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989790.89/warc/CC-MAIN-20150728002309-00310-ip-10-236-191-2.ec2.internal.warc.gz","recordEndOffset":664471163,"recordOffset":664422904,"tableOrientation":"HORIZONTAL","textBeforeTable":"Search WVSPNMECBAAll Glossary Glossary Home |  Shopping Basket: (0) Items } new google.translate.TranslateElement({pageLanguage: \u0027en\u0027, layout: google.translate.TranslateElement.InlineLayout.SIMPLE, gaTrack: true, gaId: \u0027UA-11111390-1\u0027}, \u0027google_translate_element\u0027); function googleTranslateElementInit() {","textAfterTable":"Shop with ProSmoke Starter Kits Flavored Cartridges Accessories Replacement Parts My Account Login/Register My Account My Order History My Points and Rewards Refer A Friend Customer Service Contact US Live Chat Shipping Warranty FAQ \u0026 Knowledgebase About About Us Awards and Press Reviews Customer Reviews \u0026 Videos Blog \u0026 News Coupons \u0026 Specials More Stuff RSS Feeds Affiliate Program Distributor \u0026 Wholesale Inquiries FAQ Follow Us","hasKeyColumn":true,"keyColumnIndex":0,"headerRowIndex":0}