{"relation":[["Party","Conservative","Labour","Lib-Dem","SNP","PC","Green","BNP","UKIP"],["Votes 2015","8,895,066","9,199,875","2,519,729","1,004,774","313,433","1,785,516","112,864","3,282,872"],["% votes 2015","37.3","38.6","10.6","4.2","1.3","7.5","0.5","13.8"],["Seats","254","291","37","42","7","1","0","0"],["Poll standing 16/4/15","34","34","8","","","6","","14"]],"pageTitle":"Exiled from GROGGS","title":"","url":"http://exilefromgroggs.blogspot.com/","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"RELATION","tableNum":5,"s3Link":"common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986423.95/warc/CC-MAIN-20150728002306-00125-ip-10-236-191-2.ec2.internal.warc.gz","recordEndOffset":88475599,"recordOffset":88435628,"tableOrientation":"HORIZONTAL","lastModified":"Thu, 02 Jul 2015 10:13:12 GMT","textBeforeTable":"One of the things that I find quite pleasing about the approach I have taken is that, rather than the values obtained from an opinion poll being used as inputs (\"What would 34% of the electorate supporting both Labour and Conservative mean?\") it actually becomes one of the outputs - in effect, a correspondence between the opinion poll results and the total votes cast per party in the model provides a validation of the assumptions that I have made about how the votes have been redistributed. The downside is that it gives a misleading sense of confidence. A reminder of the results that came out of the model run above: The trouble is that, as with psychohistory, the model can\u0027t deal with details and individuals - for example, a very charismatic candidate in one constituency; an issue that polarises local populations. In effect, I make the assumption that on a national level the impact of such things is likely to be small over a five year period. There will be local variations, but as far as the model is concerned, they can be ignored, as what I am trying to get out of the model is not so much a forecast for each individual constituency but an estimate of how large-scale","textAfterTable":"The problem is that, even assuming that I get close to being right about the number of votes, the number of ways of arranging those votes is indefinitely large. The opinion poll output is very low in information: the size of parties in parliament much higher. Is it possible to determine how reasonable any specific arrangement is? Incidentally, I have no doubt that there\u0027s nothing terribly unusual about this model - political parties and media organisations almost certainly do the same thing. I was just interested in the fact that it could be put together in about an evening using nothing more than spreadsheet software. I\u0027d like next to spend some time refining the model. I think that a more general matrix for transfer of allegiance can be constructed, though I\u0027m not sure how much it would add. I would like to get closer to the actual poll standings - though this is quite scary, I hammered the Lib-Dem vote even to get it down to 11%, and I still have some votes to lose from Conservative and Labour. And maybe I should be trying to look at \"Other\" or something, more usefully than BNP. And would it be possible to determine which constituencies actually have a Green candidate standing in them? And then, just how varied could the size of parties in the House of Commons be and still return the headline poll figure? And is the poll","hasKeyColumn":true,"keyColumnIndex":0,"headerRowIndex":0}