{"relation":[["PI/Contractor Name","De La Torre, Adela","Estape, Estela S.","Potter, David D.","Roget, Nancy A.","Whitlow, Jesse W.","Wolff, Steven N."],["Project Title/Number","Addiction Research and Investigation for Science Educators (ARISE) DA020724-01A2","Clinical Research Education and Career Development (CRECD) in Minority Institutions RR017589-07","Phase II: Opening the Pipeline for Native High Schools RR020406-04","NIDA Enters College: Infusing the Science of Addiction Into University Curricula DA020472-03","SPARC2000+: Science Fair Drug Abuse Science Literacy DA015200-05","Clinical Research and Education for Career Development RR017577-07"]],"pageTitle":"NIDA Health Disparities Research Portfolio - FY 2008 | National Institute on Drug Abuse (NIDA)","title":"Branch: Science Policy Branch (SPB)","url":"http://www.drugabuse.gov/about-nida/organization/health-disparities/nida-health-disparities-research/nida-health-disparities-research-portfolio-fy-200","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"RELATION","tableNum":15,"s3Link":"common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992543.60/warc/CC-MAIN-20150728002312-00016-ip-10-236-191-2.ec2.internal.warc.gz","recordEndOffset":417364135,"recordOffset":417320112,"tableOrientation":"HORIZONTAL","lastModified":"Tue, 28 Jul 2015 02:06:43 GMT","textBeforeTable":"Division: Clinical Trials Network (CCTN) Science Policy Branch - SPB Science Policy Branch - OSPC Special Populations Office - SPPOP Office of the Director - OD Office of the Director - OD Medications Research Grants Branch - MRGB Medical Consequences Branch - MCDA Medical Consequences Branch - DPMC Services Research Branch - SRB Prevention Research Branch - PRB Epidemiology Research Branch - ERB Epidemiology Research Branch - DESPR Clinical Neuroscience Branch - CNB Behavioral and Integrative Treatment Branch - BITB Behavioral and Brain Development Branch - BBDB Behavioral and Brain Development Branch - DCNBR Genetics and Molecular Neurobiology Research Branch - GMN Functional Neuroscience Research Branch - FNRB Chemistry and Physiological Systems Research Branch - CPS Behavioral and Cognitive Science Research Branch - BCS Behavioral and Cognitive Science Research Branch - DBNBR Clinical Trials Network - CTN Clinical Trials Network - CCTN Jump to: NIDA Health Disparities Research Portfolio–FY 2008","textAfterTable":"Rotrosen, John P. NIDA Clinical Trials Network: New York Node DA013046-09 Somoza, Eugene C. Clinical Trials Network: Ohio Valley Node DA013732-09 Stitzer, Maxine L. Clinical Trials Network: Mid Atlantic Collaborative Group DA013034-09 Szapocznik, Jose Florida Node of The Drug Abuse Clinical Trials Network DA013720-09 Weiss, Roger D. CTN: Northern New England Node DA015831-07 Back to top Division: Behavioral and Cognitive Science Research Branch (DBNBR) Branch: Behavioral and Cognitive Science Research Branch (BCS) PI/Contractor Name Project Title/Number   A Social-Cognitive Model of Adolescent Substance Use DA018871-04NCE Bandstra, Emmalee S. Sex and Gender Influences on Addiction and Health: A Developmental Perspective DA024584-02 Chaplin, Tara M. Gender, Emotional Arousal, and Risk for Adolescent Substance Abuse DA024759-01","hasKeyColumn":false,"keyColumnIndex":-1,"headerRowIndex":0}