{"relation":[["AVAILABILITY","Pro D","X-line","Z-line","Z-line Dyed","Z-line Glow","Z CryZtal","ESP","FLX","Titanium"],["STABILITY","1.6","1.6","1.6","1.6","1.6","1.6","1.6","1.6","1.6"],["WEIGHTS","150 Class, 151-174g","164-174g","164-174g","167-174g","167-174g","171-174g","151-174g","167-174g","167-174g"]],"pageTitle":"Titanium Nuke | Discraft Distance Driver Golf Disc","title":"","url":"https://discsunlimited.net/manufacturer/discraft-discs/Discraft-Advanced/discraft-titanium-nuke?sort\u003dp.price\u0026order\u003dDESC\u0026limit\u003d75","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"RELATION","tableNum":0,"s3Link":"common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989018.40/warc/CC-MAIN-20150728002309-00144-ip-10-236-191-2.ec2.internal.warc.gz","recordEndOffset":850967079,"recordOffset":850950639,"tableOrientation":"HORIZONTAL","TableContextTimeStampBeforeTable":"{34482\u003dQuestions? Call us: (785) 258-2494}","TableContextTimeStampAfterTable":"{28883\u003dDiscs Unlimited © 2015. Photography courtesy of Clark Griffiths — Taylor Park, Largo, FL.}","textBeforeTable":"\"This disc consistently goes farther than I can throw. NUKE was one of the keys to my success at the World Championships.\" - Barrett White, World Champ The Pro D and Elite X Nuke are suitable for all skill levels. The Z and ESP Nukes are suitable for intermediate to expert skill levels. ngineering give the NUKE a huge distance advantage and unparalleled velocity with a 1.6 stability rating that makes it more useful to a wider range of players. The Discraft ESP NUKE is a maximum distance driver with a stability rating of 1.6, moderately overstable. This high performance disc is a game changer! The wide, heavy rim and refined aerodynamic engineering give the NUKE a huge distance advantage and unparalleled velocity with a 1.6 stability rating that makes it more useful to a wider range of players. Seize the power!   Availability/Stability Rating: Available in Pro D, Elite X, Elite Z, Z-dyed, Z-Glo, Z Sparkle, CryZtal, ESP and Titanium - all with Stability 1.6   The Elite X Nuke is suitable for all skill levels. The Z, ESP andTitanium Nukes are suitable for intermediate to expert skill levels. The Discraft Titanium NUKE is a high performance maximum distance driver disc golf disc that is a game changer! The wide, heavy rim and refined aerodynamic engineering give the NUKE a huge distance advantage and unparalleled velocity with a 1.6 stability rating that makes it more useful to a wider range of","textAfterTable":"Write a review Rating: Bad                     Good Your Name: Your Review: Note: HTML is not translated! Enter the code in the box below: Continue Related Products Discraft Nuke - Z CryZtal Fundraiser for Am Worlds 2011 $30.00 Discraft Nuke - Z CryZtal Sparkle Fundraiser for Am Championship 2011 $25.00","hasKeyColumn":true,"keyColumnIndex":0,"headerRowIndex":0}