{"relation":[["Emperor","Domitian","Trajan","Hadrian","[Antonins Dynasty]","(Faustina)","Antoninus Pius","(Lucilla) \u003d\u003e Lucius Verus","Marcus Aurelius","Commodus","Septimius Severus","Caracalla","(Julia Pia)","Elagabalus","Julia Mamaea","Severus Alexander","Gordian III","Philippus","Decius","Etruscilla"],["reign","81-96","98-117","117-138","","","138-161","161-166","161-180","180-192","193-211","211-217","","218-222","","222-235","238-244","244-249","249-251",""],["years","15","19","21","","","23","","19","12","18","6","","4","","13","6","5","2",""],["no.coins","1","3","2+1","(1)","(3)","7+3","(1)","1+1","0","4","1","4","1+4","1","7+1","8","2","1+2","(2)"],["coin/ year","0,0667","0,1579","0,1429","","","0,4348","","0,1053","0,0000","0,2222","0,1667","","1,2500","","0,6154","1,3333","0,4000","1,5000",""]],"pageTitle":"numismatic?","title":"","url":"http://www.mnir.ro/cercetare/santiere/racari/UK/num_sumUK.htm","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"RELATION","tableNum":1,"s3Link":"","recordEndOffset":0,"recordOffset":0,"tableOrientation":"HORIZONTAL","TableContextTimeStampAfterTable":"{611\u003dRac\u003dthe abbreviation of the archaeological site from R?cari; the following number represents the identification number (or “the inventory”), a provisory number which might be used for finding the artifact, until the comprising of the piece in the official inventory of a museum. Starting with 2005, inventory numbers have as prefix the number of the section; the numbers having a form like “2001” would therefore signify “section 2, no. 1”  , 13138\u003dTudor 1965, p. 252, after Polonic’s notes; \"Imp. M. Iul. Philippus Aug. trib. pot II, cos. p.p.\", 9148\u003dTudor 1965, p. 252, after Polonic’s notes; \"Imp. Sev. Alexander, cos II \", 4259\u003dTudor 1965, p. 252, after Polonic’s notes; \"denars from Antoninus Pius\", 8865\u003dTudor 1965, p. 252, after Polonic’s notes; \"Imp. Sev. Alexander Aug.\", 10447\u003dTudor 1965, p. 252, after Polonic’s notes; \"Imp. Sev. Alexander, cos. II \", 3538\u003dTudor 1965, p. 252, after Polonic’s notes; \"a bronze from Diva Faustina \", 2864\u003dTudor 1965, p. 252, after Polonic’s notes; \"Imp. Hadrianus Aug. cos III, on the reverse two figures that shake hands\", 9906\u003dTudor 1965, p. 252, after Polonic’s notes; \"Sever Alexander, cos. \", 17668\u003d0,1429, 19173\u003d0,1053, 4759\u003dTudor 1965, p. 252, after Polonic’s notes; \"a bronze piece from Antoninus Pius\", 7611\u003dTudor 1965, p. 252, after Polonic’s notes; \"two silver pieces from Julia Pia\", 14920\u003dTudor 1965, p. 252, after Polonic’s notes; \"with Diva Augusta inscription\", 2454\u003dFlorescu 1931, p. 24, 17379\u003d0,1579, 17170\u003dTrajan, 19758\u003d0,2222, 14657\u003dTudor 1965, p. 252, after Polonic’s notes; \"with NIKE inscription\", 2163\u003dTudor 1965, p. 252, after Polonic’snotes; \"Imp. Ner. Traianus Germ. tr. pot. cos. III, pp. \", 6467\u003dTudor 1965, p. 252, after Polonic’s notes; \"three denars from Septimius Severus\", 15102\u003dThe situation described in the table must be analyzed (at the 2005 campaign; the discoveries of the collective coordinated by col. Vl?descu are missing from the statistic) with caution. Many of the coins are not that surely dated, and moreover, their nominal is not known. Even the way the investigation has been performed might come into discussion. The team coordinated by Tocilescu and Florescu had as main objectives the delimitation of the walls, which might make us think that they didn’t paid enough attention to the early levels; from this reason, the early coins may have an under-evaluated representation. Recent investigations lead as well through the same conclusion, due to the fact that the collective coordinated by col.Vladescu left several segments of section unfinished (therefore in the detriment of early discoveries), and the actual collective investigated until now only the area of the fortification elements, without investigation in the interior of the small fort. With this necessary correction, we may now have a global perspective of the data, to make an opinion, though only summarily and, of course, provisory, on the main phases of the fort. Let’s take a look at the following table:, 11011\u003dTudor 1965, p. 252, after Polonic’s notes; \"three antonins from Gordianus III,  of which one has on the reverse: Saeculi felicitas, next to the emperor with the globe and the lance\", 11860\u003dTudor 1965, p. 252, after Polonic’s notes; \"a bronze from Gordian III with Iovi statori\", 20046\u003d0,1667, 1626\u003dTudor 1965, p. 252, after Polonic’s notes, 6149\u003dTudor 1965, p. 252, after Polonic’s notes; \"Aurelius Caesar Aug., imp., on the reverse Virtus, cos III \", 1859\u003dTudor 1965, p. 252, after Polonic’s notes; \"Imp. Ner. Traianus p.m. tr. p. cos. III, Optimo Principi\", 20631\u003d1,2500, 22505\u003dEarly coins, from Domitian to Trajan, are, so far, too few to assures us of the fact that this fort has been built during Trajan’s time. More certitude as regarding this matter may offer the situation analogy with forts from Dacia Porolissensis (Bologa, Buciumi, Gilau), which know a similar evolution and of which we know that have been founded at the end of the war. Another conjuctural element, as the presence of a tile with the stamp of V Macedonica legion (Tudor 1965, 237) may suggest the same thing. The Roman presence at Racari, during Hadrian’s time, seems very pale, especially if we consider the low nominal of the coins (all made of bronze). On the other hand, the stratigraphic situation from the ditch of the small fort does not recommend a complete abandonment of the fort, even only a provisory one, the ditch being only a third blocked, before its covering and levelment. Another moment of considerable presence we encounter for Antoninus Pius’ time (0, 44 coins per year), wherefore beginning with Marcus Aurelius’ reign (161-180) the presence to be once again reduced towards zero (0,11 coefficient), situation maintained along the 12 years of Commodus’ reign (0 coefficient). Nevertheless, sometimes during this period we should assume the construction of the large earth fort; this is pretty hard, isn’t it? This matter will be resolved only through supplementary investigations, and by observing of the abundance of the 2 archaeological level (until now - reduced). For the moment, all that we might assume is that it would be plausibly to think that this first large fort was built at the beginning of Marcus Aurelius’ reign, the objective to be voided, possibly during the Marcomanic wars, when the troops might had been deployed. A revigoration of the presence in the fort is clearly indicated during Septimius Severus (193-211), for which the 0, 2222 coefficient id relatively high, being corrected as well with the information that the inflation appears during this period (information Ernest Oberlander-Tarnoveanu). The frequencies of Caracalla’s coins (211-217) is pretty faint (0, 167), bearing in mind that ample rebuilding activities in Dacia are assigned to this emperor; for now is pretty hard to admit this fact for Racari.       The first “inrush” appears at Elagabalus (coefficient 1, 25), but we already are during a period of explosive inflation; looking at the evolutions from the table, we might say that, even in the given conditions, we should admit that during the respective years (218-222), or immediately after, the stone fort has suffered the first calamitous devastation, as well as the rebuilding named, in stratigraphical terms, 3.2. The coefficient decreases once again, at Severus Alexander (0, 62), to significantly grow again during Gordian III’s time (1, 33); it presents a new inferior oscillation (0, 4 at Philippus), and a maximum quotation at the end (Decius, 249-251), of 1, 5, representing the latest monetary apparition of the Roman levels. We are, again, in a period of great inflation, especially after 235 (once again, information from our colleague, Ernest, to whom I thank him for the friendly assistance), but the oscillation Gordian-Philippus-Decius should have a signification, even only local, because intense military activities, at the Danube, have been recorded during these three emperors. During Philippus is recorded as well the devastating Carpic invasion (247-248), combined with the German attacks at the Middle Danube. The destruction level is clearly visible, and we do not exclude the possibility that the fortification to have been again provisory abandoned. During Decius’ two years we may date – on the basis of several archaeological and numismatic satisfactory contexts – the final rebuilding of the Roman fortification, in the northern half of the fort. The “exploitation” period of this new work seems to have been extremely short. We cannot conclude without specify, once again, the fact that these considerations have a provisory character and they must not be regarded as conclusions; this statistic is designated only to guide the archaeologists in the field, and to formulate working-hypotheses.     }","lastModified":"","textBeforeTable":"STATISTIC TABEL    coins per year, grpuped on reigns  The situation described in the table must be analyzed (at the 2005 campaign; the discoveries of the collective coordinated by col. Vl?descu are missing from the statistic) with caution. Many of the coins are not that surely dated, and moreover, their nominal is not known. Even the way the investigation has been performed might come into discussion. The team coordinated by Tocilescu and Florescu had as main objectives the delimitation of the walls, which might make us think that they didn’t paid enough attention to the early levels; from this reason, the early coins may have an under-evaluated representation. Recent investigations lead as well through the same conclusion, due to the fact that the collective coordinated by col.Vladescu left several segments of section unfinished (therefore in the detriment of early discoveries), and the actual collective investigated until now only the area of the fortification elements, without investigation in the interior of the small fort. With this necessary correction, we may now have a global perspective of the data, to make an opinion, though only summarily and, of course, provisory, on the main phases of the fort. Let’s take a look at the following table:     Tudor 1965, p. 252, after Polonic’s notes; \"with Diva Augusta inscription\"   ?     Ag Tudor 1965, p. 252, after Polonic’s notes; \"with NIKE inscription\"   ?     Ag","textAfterTable":"    Observations Early coins, from Domitian to Trajan, are, so far, too few to assures us of the fact that this fort has been built during Trajan’s time. More certitude as regarding this matter may offer the situation analogy with forts from Dacia Porolissensis (Bologa, Buciumi, Gilau), which know a similar evolution and of which we know that have been founded at the end of the war. Another conjuctural element, as the presence of a tile with the stamp of V Macedonica legion (Tudor 1965, 237) may suggest the same thing. The Roman presence at Racari, during Hadrian’s time, seems very pale, especially if we consider the low nominal of the coins (all made of bronze). On the other hand, the stratigraphic situation from the ditch of the small fort does not recommend a complete abandonment of the fort, even only a provisory one, the ditch being only a third blocked, before its covering and levelment. Another moment of considerable presence we encounter for Antoninus Pius’ time (0, 44 coins per year), wherefore beginning with Marcus Aurelius’ reign (161-180) the presence to be once again reduced towards zero (0,11 coefficient), situation maintained along the 12 years of Commodus’ reign (0 coefficient). Nevertheless, sometimes during this period we should assume the construction of the large earth fort; this is pretty hard, isn’t it? This matter will be resolved only through supplementary investigations, and by observing of the abundance of the 2 archaeological level","hasKeyColumn":true,"keyColumnIndex":0,"headerRowIndex":0}