{"relation":[["Year","2011","2010","2009","2008","2007","2006","2005","2004","2003","2002","2001","2000","1999","1998","1997","1996","1995","1994","1993","1992","1991","1990","1989","1988"],["Game","Batman: Arkham City","Super Mario Galaxy 2","Uncharted 2: Among Thieves","Grand Theft Auto IV","Super Mario Galaxy","The Legend of Zelda: Twilight Princess","Resident Evil 4","Half-Life 2","The Legend of Zelda: The Wind Waker?","Metroid Prime","Halo: Combat Evolved","Metal Gear Solid","Soulcalibur","The Legend of Zelda: Ocarina of Time","GoldenEye 007","Super Mario 64","Chrono Trigger","Final Fantasy VI","The Legend of Zelda: Link\u0027s Awakening","The Legend of Zelda: A Link to the Past","Sonic the Hedgehog[130]","Motocross Maniacs","Tetris","Phantasy Star II"],["Genre","Action-Adventure: Brawler, Stealth","Platformer","Action-Adventure: (Third-Person) Shooter","Open World: (Third-Person) Shooter","Platformer","Action-adventure","Survival Horror: (Third-Person) Shooter","(First-Person) Shooter","Action-Adventure","(First-Person) Action-Adventure","(First-Person) Shooter","Stealth: Action-Adventure","Fighting: Hack \u0026 Slash","Action-Adventure: Open World","(First-Person) Shooter","Platformer: Open World","Role-Playing Game","Role-Playing Game","Action-Adventure","Action-Adventure","(Side-Scrolling) Platformer","Racing","Puzzle","Role-Playing Game"],["Platform(s)","PlayStation 3, Xbox 360","Wii","PlayStation 3","PlayStation 3, Windows, Xbox 360","Wii","Wii, Nintendo GameCube","GameCube, PlayStation 2, Windows, Wii","Windows, Xbox 360, Xbox, PlayStation 3","GameCube","GameCube","Xbox, Windows","Game Boy Color","Dreamcast, Namco System 12, iOS, Xbox Live Arcade","Nintendo 64, Nintendo GameCube, iQue Player, Virtual Console, Nintendo 3DS","Nintendo 64","Nintendo 64, iQue Player, Nintendo DS, Virtual Console","Super NES, PlayStation, Nintendo DS, Virtual Console, PlayStation Network, iOS","Super NES, Virtual Console","Game Boy, Game Boy Color","Super NES, Virtual Console","Sega Genesis / Mega Drive, Game Boy Advance, Mobile","Game Boy","Game Boy","Mega Drive / Genesis, Virtual Console, Xbox Live Arcade, iOS"],["Developer(s)","Rocksteady Studios","Nintendo EAD Tokyo Development Group","Naughty Dog Software","Rockstar North Ltd.","Nintendo EAD Tokyo Development Group","Nintendo EAD Software Development Group No. 3","Capcom","Valve Corporation","Nintendo EAD Software Development Group No. 3","Retro Studios, Nintendo","Bungie Studios","Tose","Namco","Nintendo EAD","Rare, Nintendo","Nintendo EAD","Squaresoft","Squaresoft","Nintendo EAD","Nintendo EAD","Sonic Team","Konami","Bullet Proof Software","Sega"]],"pageTitle":"Game of the Year - Wikipedia, the free encyclopedia","title":"","url":"http://en.wikipedia.org/wiki/Game_of_the_Year","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"RELATION","tableNum":40,"s3Link":"","recordEndOffset":0,"recordOffset":0,"tableOrientation":"HORIZONTAL","TableContextTimeStampAfterTable":"{331917\u003dThe Golden Joysticks are the oldest gaming awards. The inaugural ceremony took place in 1982 in London\u0027s Berkeley Square.[163], 78927\u003dFormerly known as Academy of Video Games. Includes all GOTY Winners picked by AIE staff members. Note: All winners before 1993 were picked in 1993 when AIE was formed., 293154\u003dIn addition to the editor\u0027s picks, 1UP.com also hosts a poll for the Readers\u0027 GOTYs. Until 2010, this was considered their primary Game of the Year.[11], 298354\u003dStarting in 1984, the ZX Spectrum magazine Crash published an annual readers awards article, based on votes from the readers., 191814\u003dThe winners of the Giant Bomb Game of the Year are chosen by Giant Bomb editors.[93] In 2011, the editors changed their Game of the Year deliberations from picking a winner from their console-specific award winners, to creating a Top 10 list from their collective personal Top 10 games and ordering them from 10th to 1st.[94], 195419\u003dIGN\u0027s most prestigious game of the year award is chosen by all the editors at IGN and unveiled mid-January., 230291\u003dOver the years, Kotaku has been refining how it selects its Game of the Year. Currently, it involves a debate which starts with the Kotaku editors determining the four most defendable candidates for the award. Editors are then given time to play all the games, and for each of the candidates, an appropriate editor is determined to make his case behind it in front of a panel who also raise questions. The results of these debates are given to the readers, who then also have the chance to make their own opinions felt. To make the final decision, the Kotaku staff members reexamine their arguments, and the winner is determined from a vote between the editors in late January.[114][115], 65769\u003dAs of 2010[update], the winners of 1UP\u0027s Game of the Year are chosen by the editors. (In 2009, they also revealed their picks in the Reader\u0027s Choice Awards). For the Reader\u0027s Choice, see the Reader and gamer polls GOTY Section below.[11], 203747\u003dIn addition, the Australian (Au) team at IGN has been posting a top 10 games of the year since 2008. IGN AU\u0027s game of the year is as follows:, 206777\u003dThe winners of the Grand Award annually given by the Japan Game Awards, formerly known as the CESA Awards, since 1996. There are some years where two games shared the Grand Award.[112], 310470\u003dThe winners of G4\u0027s annual \"Videogame Deathmatch\" or \"G-phoria\" polls. The 2011 \"Videogame Deathmatch\" poll involved 500,000 votes.[142], 281182\u003d? The Xbox release of Grand Theft Auto Double Pack scored slightly higher than The Wind Waker but was a re-release of both GTA3 \u0026 Vice City, which came out in 2001/2002.}","lastModified":"","textBeforeTable":"The winners of the Games (magazine) Game of the Year are chosen by Games editors:[1] See Games 100. [edit] Games magazine [edit] Board games (Game of the Year) X-Play Time (magazine) The Washington Examiner Spike TV ScrewAttack New York Times Metro GameCentral Metacritic Los Angeles Times Kotaku Joystiq Japan Media Arts Festival Japan Game Awards MMGN IGN Giant Bomb GameTrailers GameSpy GameSpot Games (magazine) Games Master GamePro Game Informer Gamasutra G4 Eurogamer Electronic Gaming Monthly Edge (magazine) Crispy Gamer British Academy of Film and Television Arts Academy of Interactive Entertainment Academy of Interactive Arts \u0026 Sciences 1UP.com","textAfterTable":"Apples to Apples Ricochet Robot Double Quick! - Trivia: Bioviva CCG: Pok?mon Dexterity: Spintrek 1999[8] Fossil GIPF Conflict: Atlantic Storm Montgolfiere Bohnanza El Grande Say When! Stormy Seas Alpha Blitz - Trivia: Where in Time is Carmen Sandiego? CCG: C 23 1998[8] Quoridor Balanx Strategy \u0026 Conflict: Princess Ryan\u0027s Star Marines Take It Easy Get the Goods Quandary Wise and Otherwise Lost in a Jigsaw A to Z - Trivia: Director\u0027s Cut CCG: Magic: The Gathering - Portal","hasKeyColumn":true,"keyColumnIndex":1,"headerRowIndex":0}