{"relation":[["RANG","1","2","3","4","5","6","7","8","9","10","11","12","13","14","15","16","17","18","19","20"],["Museum","MoMA The Museum of Modern Art","Metropolitan Museum of Art","Acropolis Museum","Mus?e du Louvre","Guggenheim Museum","Tate Modern","Design Museum","City Museum","Museo del Prado","Centre Pompidou","Creation Museum","Victoria \u0026 Albert Museum","The Getty Museum","Whitney Museum of American Art","British Museum","New Museum","Salvador Dali Museum","Natural History Museum","National Museum of the American Indian","American Museum of Natural History"],["Stadt","New York","New York","Athen","Paris","New York","London","London","St Louis","Madrid","Paris","Petersburg","London","Los Angeles","New York","London","New York","Saint Petersburg","London","Washington D.C.","New York"],["Facebook-Fans","542187","301109","225498","150473","142369","114937","78717","68755","63036","59343","59339","54598","54579","54143","51298","44599","41260","29105","28897","28788"]],"pageTitle":"Web 2.0 — PR-Kloster","title":"","url":"http://www.pr-kloster.de/category/web-20/page/2/","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"RELATION","tableNum":11,"s3Link":"","recordEndOffset":0,"recordOffset":0,"tableOrientation":"HORIZONTAL","TableContextTimeStampAfterTable":"{291668\u003dPlatz zwei belegt im September das Mercedes Benz Museum mit 6.938 ?Fans? und Platz drei das KW Institute for Contemporary Art mit 6.538 ?Fans? – dabei hat das Mercedes Benz Museum mit 1.858 neuen Fans den gr??ten Sprung gemacht, gefolgt vom NRW-Forum mit 1.760 neuen “Gef?llt mir”. Auch die SCHIRN Kunsthalle in Franfurt (Platz 5) hat diesmal deutlich aktiver als die letzten Monate neue Kontakte (3.836) gekn?pft., 276254\u003d1141, 263718\u003d1463, 259406\u003d2266, 261523\u003d1718, 88416\u003dBemerkenswert auch das MMK Museum f?r Moderne Kunst, das sich um vier Pl?tze verbessern konnte und sich damit nun auf Platz 11 befindet. Dagegen ist das St?del Museum um drei Pl?tze auf Platz 13 gefallen. Erneut in den Top 20 k?nnen wir im November das DDR-Museum begr??en, das mit 1.262 Fans das Schlusslicht im Ranking ist., 83228\u003dDas gerade erschienene Jahrbuch \"Annual Multimedia 2011\" dokumentiert Trends in Screendesign, Nutzerführung, multimedialer Integration, digitalem Marketing und Social Media. Im Klappentext heißt es weiter: \"Das Jahrbuch liefert wertvolle Inspiration und macht Mut, originelle Ideen in der Marketingkommunikation umzusetzen. Ausführliche Porträts stellen Agenturen und ihre Dienstleistungen vor. Darüber hinaus geben bekannte Medienjournalisten und Branchen-Insider in zehn exklusiven Fachartikeln informative sowie unterhaltsame Einblicke in die aktuellen Entwicklungen der Branche.\" Einer dieser 10 Artikel stammt von uns und beschäftigt sich mit dem Thema: \"Museen im Web 2.0-Zeitalter: Beispiele für erfolgreiches Social Media Marketing\". Leider war der Redaktionsschluß für den Beitrag schon im Sommer 2010 und dementsprechend sind die genannten Zahlen in der schnelllebigen Web 2.0-Zeit längst überholt. Aber trotzdem hilft er vielleicht dem einen oder anderen \"Neueinsteiger\" in die Social Media-Welt. Vor allem natürlich aus dem Museumsbereich, der anhand von konkreten Beispielen näher beschrieben wird:, 309685\u003d51298, 244351\u003dNat?rlich sagt die Zahl der Kontakte auf Facebook oder Twitter noch nichts ?ber die Qualit?t der dort ver?ffentlichten Beitr?ge und die tats?chliche Resonanz bei der Zielgruppe aus. Aber sie macht zumindest sichtbar, ob ein Museum aktiv den Dialog vorantreibt oder eher passiv auf ein Echo wartet. Doch hier erst einmal das aktuelle Ranking f?r den September 2010:, 86592\u003dDezember 28, 2010   Kommentare deaktiviert, 294868\u003d542187, 290870\u003dPrivate Galerien sind jedoch in unserem Ranking der ?Museen und Ausstellungsh?user? von Anfang an nicht ber?cksichtigt, deshalb bleibt das NRW-Forum D?sseldorf mit 9.738 ?Fans? weiterhin Spitzenreiter im Facebook-Ranking f?r September. Eine weniger sch?ne Seite des Erfolgs: Seitdem c/o Berlin vor drei Wochen bei den “Fans” die 10.000er-Marke durchbrochen hat, ist die Facebook-Seite der Galerie gesperrt und die Verantwortlichen k?nnen sie nicht mehr administrieren und z.B. den Spam entfernen. Ursache ist vermutlich eine Verlosung von 10 Jahresabos unter den neuen ?Fans?, was nach den Gewinnspiel-Regeln von Facebook verboten ist. Dieses Beispiel zeigt einmal mehr das hohe Risiko f?r Kultureinrichtungen, wenn sie ihre Social-Media-Strategie alleine auf Facebook ausrichten., 255076\u003d2987, 258387\u003d2433, 172391\u003dWinterm?digkeit l?sst gr??en! Kommunikation ist immer wechselseitig. Doch einige Museen scheinen diesen Ansatz, den bereits Karl B?hler in seinem Werk ?Die Krise der Psychologie? von 1927 manifestierte, nicht wirklich umsetzen zu wollen. Dabei unterliegen jegliche Formen des sozialen Kontaktes folglich einer asymmetrischen Steuerungssituation, innerhalb derer einer den Part des F?hrenden und der Andere den des Gef?hrten bzw. des ?Sich-gef?gig-Gebenden? ?bernimmt. Social Media ist demnach nicht nur ein ?Nice-to-have? Instrument, sondern sollte so eingesetzt werden, dass ein realer Dialog stattfinden kann., 275332\u003d1370, 257203\u003d2457, 277184\u003d1034, 264681\u003d1145, 273468\u003d1621, 315738\u003dSchaut man sich den internationalen Vergleich an, schafft auch diesmal das New Yorker Museum of Modern Arts (MoMa) den gr??ten Sprung mit 38.108 neuen Anh?ngern. Damit liegt es weiter auf Platz 1 mit 542.187 “Fans”. Das zweitplatzierte Metropolitan Museum of Art demgegen?ber mit 301.109 “Fans” weit abgeschlagen, trotz eines Zuwachses von 31.189 “Like it” im September konnte der Abstand zum MoMa nur marginal verkleinert werden., 317028\u003dOktober 4, 2010   Kommentare deaktiviert, 295834\u003d301109, 82647\u003dJanuar 3, 2011   Kommentare deaktiviert, 260469\u003d2157, 311801\u003d41260, 256206\u003d2470, 265652\u003d1073, 272556\u003d1922, 262672\u003d1538, 271482\u003d2269, 242252\u003dNovember 3, 2010   2 Comments, 298970\u003d142369, 116365\u003dBeim aktuellen Twitter-Ranking sind dagegen nur marginale Ver?nderungen festzustellen. Alle Museen konnten einen leichten Anstieg verzeichnen. Weiterhin auf Platz 1 ist das NRW-Forum mit 12.814 Followern, dicht gefolgt vom M?ritzeum mit 11.092 “Verfolgern”. Auch im Twitter-Ranking belegt das Mercedes-Benz-Museum den dritten Platz mit 7.360 Followern. Ob auch hier noch 2010 die 10.000-Fan-H?rde genommen wird, bleibt mit Spannung abzuwarten., 268698\u003d12476, 171725\u003dDezember 3, 2010   2 Comments, 87104\u003dEin Blick auf das aktuelle Facebook-Ranking f?r November 2010 zeigt, dass auch diesmal wieder die “Top 3? das gesamte Feld sehr dominant beherrschen. Dabei belegt nach wie vor die Galerie c/o Berlin den ersten Platz mit nun 13.345 Fans, gefolgt vom NRW-Forum mit inzwischen 11.188 Fans. Bei beiden war das Wachstum gegen?ber dem Vormonat eher moderat, w?hrend das Mercedes Benz Museum einen go?en Schritt nach vorne gemacht hat. Es konnte im vergangenen Monat 1.530 neue Fans gewinnen? und hat nun insgesamt 9.883 Anh?nger. Damit wird das Stuttgarter Automuseum zum Jahresende h?chstwahrscheinlich ebenfalls die 10.000-Fan-H?rde ?berspringen., 278116\u003d1020, 274398\u003d1536}","lastModified":"","textBeforeTable":"Den gr??ten Sprung hat im Dezember erneut das Mercedes Benz Museum (+1.488 neue Fans) gemacht, das wie der Spitzenreiter c/o Berlin nun auch auf englisch postet. Damit belegt es in der Geasamtwertung mit 11.371 Fans Platz 3. Vielleicht ist das Posting auf englisch der einzige Weg, um ein gr??eres Publikum zu erreichen und eine bestimmte Schwelle oberhalb von 10.000 Fans wirkungsvoll zu durchsto?en. Das Ramones Museum konnte sich um einen Platz verbesser und belegt nun Platz 13 mit 3.201 Fans. Dagegen ist das St?del Museum erneut um einen Rang auf Platz 14 gefallen. Neu in unser Ranking aufgenommen und damit auf Platz 18 ist das Museum Ludwig mit 1.681 Fans, das in den letzten Wochen einen enormen Anstieg verzeichnen konnte. Damit bildet nun das Museum Kunst Palast aus D?sseldorf das Schlusslicht der Top 20 mit 1.507 Fans. Ein Blick auf das aktuelle Facebook-Ranking f?r Museen und Ausstellungshallen zeigt, dass sich die Top 3 immer st?rker ann?hern und weiterhin sukzessive steigern – jedoch mit immer flacher werdenden Zuwachsraten bei den Fan-Zahlen. Das c/o Berlin belegt zu Monatsbeginn weiterhin den ersten Platz mit 13.946 Fans, das NRW-Forum D?sseldorf folgt auf dem zweiten Platz mit 12.270 Anh?ngern. Die Coupon-Aktionen des NRW-Forums, bei denen es Frei-Tickets gab, sind zwar durchaus von den Fans angenommen worden (mehrere hundert Coupons wurden ausgedruckt), aber eine “Explosion” der Fan-Zahlen hat es dadurch nicht gegeben. Welche Museen starten dynamisch ins Jahr 2011? by Maria","textAfterTable":"18 Museum Ludwig K?ln 1.681 Neu 19 Pergamonmuseum Berlin 1.557 - 20 Museum Kunst Palast D?sseldorf","hasKeyColumn":true,"keyColumnIndex":1,"headerRowIndex":0}