{"relation":[["Rank","1","2","3","4","5","6","7","8","9","10"],["Title","The Legend of Zelda: Twilight Princess","Mario Party 7","Paper Mario: The Thousand-Year Door","Super Smash Bros. Melee","Legend of Zelda: Collector\u0027s Edition","Mario Kart: Double Dash","Naruto: Clash of Ninja 2","Super Mario Strikers","Resident Evil 4 (2 disc game)","Super Mario Sunshine"],["Category","Action Adventure","Kids/Family","Action Adventure","Fighting","RPG","Racing","Fighting","Sports","Action Adventure","Action Adventure"],["Publisher","Nintendo","Nintendo","Nintendo","Nintendo","Nintendo","Nintendo","D3P","Nintendo","Capcom","Nintendo"]],"pageTitle":"Cheap Xbox 360 - Gamer News : Gamefly Top 10 for Feb. 26, 2007","title":"","url":"http://360-deals.com/blogs/cheap-xbox-360-gamer-news/archive/2007/02/26/gamefly_top_10_for_feb_26_2007.aspx","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"RELATION","tableNum":12,"s3Link":"","recordEndOffset":0,"recordOffset":0,"tableOrientation":"HORIZONTAL","TableContextTimeStampAfterTable":"{35374\u003dGamers Finding where to Buy Cheap Xbox 360 Video Games, Xbox 360 Bargains, Xbox 360 Coupons \u0026 Sales and Cheap Discount Xbox 360 Premium \u0026 Core Video Game Console (Consoles) System (Systems) \u0026 Xbox 360 Video Game Prices on the Net! This web site is not affiliated with or endorsed by Microsoft Corp. All content/trademarks are owned by their respective owners. Copyright 2006-2011 All Rights Reserved CouponClix LLC. Please submit all inquiries to info1 [noSp@m] Gamerdeals dot net.}","lastModified":"","textBeforeTable":"Most Popular Games Cross-Platform: Queue up the complete list: Eight out of the top ten spots are occupied by Xbox 360 game requests.  Crackdown is still tops for the Xbox 360, Sonic for Nintendo Wii, and Virtua Fighter 5 tops the PS3 list.  Here is the ol Gamefly Top 10 most requested list.  Gamefly Top 10 for Feb. 26, 2007 .DoNotDisplay { display: none; }","textAfterTable":"Shooter Atari 10 Armored Core 4 Xbox 360 Shooter Sega Xbox 360 Most Popular Games: Rank Title Category Publisher 1 Crackdown Action Adventure Microsoft 2 Major League Baseball 2K7 Sports Take Two 3 Def Jam Icon Fighting Electronic Arts 4 NBA Street Homecourt Sports Electronic Arts 5 Tom Clancy\u0027s Ghost Recon Advanced Warfighter 2 Shooter Ubisoft 6 Lost Planet: Extreme Condition Action Adventure Capcom 7 Bullet Witch Shooter Atari 8 Armored Core 4 Shooter Sega 9 Tom Clancy\u0027s Rainbow Six Vegas Shooter Ubisoft 10 TMNT: The Movie Action Adventure Ubisoft Nintendo Wii Most Popular Games: Rank Title Category Publisher 1 Sonic and the Secret Rings Action Adventure Sega 2 SSX Blur Sports Electronic Arts 3 Wario Ware: Smooth Moves Arcade/Puzzle Nintendo 4 Super Paper Mario Action Adventure Nintendo 5 Red Steel Action Adventure Ubisoft 6 Rayman Raving Rabbids Action Adventure Ubisoft 7 Wii Play Arcade/Puzzle Nintendo 8 Trauma Center: Second Opinion Strategy/Sim Atlus 9 Excite Truck Racing Nintendo 10 Mario Party 8 Arcade/Puzzle Nintendo PlayStation 3 Most Popular Games:","hasKeyColumn":true,"keyColumnIndex":1,"headerRowIndex":0}