{"relation":[["Country","Albania","Algeria","Angola","Argentina","Australia","Austria","Bahamas","Bangladesh","Belgium","Belize","Bhutan","Bolivia","Bosnia and Herzegovina","Brazil","Burma","China","Croatia","Cuba","Djibouti","El Salvador","Finland","France","Gambia","Germany","Greece","Grenada","Hungary","Iran","India","Israel","Jamaica","Japan","Jordan","Korea, North","Korea, South","Kuwait","Lebanon","Libya","Luxembourg","Macedonia, Republic of","Malaysia","Maldives","Malta","Moldova","Netherlands","New Zealand","Qatar","Romania","Russia","Rwanda","Saudi Arabia","Seychelles","Singapore","Slovenia","South Africa","Spain","Syria","Swaziland","Switzerland","Taiwan (Republic of China)","Thailand","Tonga","Trinidad and Tobago","Turkey","United Kingdom","United States","Vanuatu"],["Land area","27,398","2,381,740","1,246,700","2,736,690","7,617,930","82,444","10,070","133,910","30,528","22,806","47,000","1,084,390","51,129","8,456,510","657,740","9,326,410","56,414","110,860","22,980","20,720","304,473","640,053","10,000","349,223","130,800","344","93,030","1,636,000","2,973,190","20,330","10,831","374,744","92,300","120,410","98,190","17,820","10,230","1,759,540","2,586","24,856","328,550","300","316","33,371","33,883","268,021","11,437","238,392","16,995,800","24,948","2,149,690","455","692","20,151","1,219,912","499,542","184,050","17,203","41,285","32,260","511,770","718","5,128","780,580","241,590","9,161,923","12,200"],["GDP nominal (US$M)","$9,306","$90,000","$28,610","$210,000","$644,700","$310,100","$6,159","$69,340","$316,200","$1,141","$840.5","$10,330","$9,217","$967,000","$9,600","$2,518,000","$37,420","$40,000","$702","$15,160","$199,000,","$2,149,000","$462.5","$2,872,000","$256,300","$454","$207,000","$193,500","$804,000","$140,300","$9,230","$4,883,000","$300,000","$40,000","$897,400","$60,720","$19,890","$34,200","$34,530","$6,225","$132,300,","$906","$5,447","$2,574","$612,700","$98,390","$30,760","$256,900","$733,600","$1,968","$276,900","$712","$137,762","$37,920","$201,400","$1,084,000","$24,260,","$2,195","$386,100","$681,800","$197,700","$244","$14,900","$635,600","$2,346,000","$13,210,000","$341"],["Per capita GDP (US$)","$2,584.63","$2,700.01","$2,332.92","$5,210.67","$31,550.09","$37,818.07","$20,150.17","$460.89","$31,400","$3,875.88","$361.06","$1,132.78","$2,024.74","$5,089.19","$202.64","$1,904.90","$7,863.44","$3,510.61","$1,414.26","$2,181.90","$35,111.80","$33,758.81","$273.94","$34,853.95","$24,000","$5,046.07","$11,369.91","$2,958.83","$657.60","$21,830.87","$3,319.99","$38,318.03","$2,068.33","$1,800","$18,297.56","$24,234.11","$5,066.87","$5,665.15","$71,904.24","$3,027.85","$5,330.10","$2,455.08","$13,553.80","$595.77","$36,975.10","$23,079.36","$33,905.44","$10,661","$5,188.94","$198.64","$10,032.23","$8,694.06","$30,723.61","$18,872.76","$3,994.61","$23,480.26","$1,356.90","$1,937.22","$51,107.52","$29,600","$3,038.35","$2,086.88","$14,101.73","$9,000","$38,600.61","$42,137.52","$1,608.71"],["Population","3,600,523","33,333,216","12,263,596","40,301,927","20,434,176","8,233,300","305,655","150,448,339","10,584,534","294,385","2,327,849","9,119,152","4,552,198","190,010,647","47,373,958","1,321,851,888","4,443,350","11,394,043","496,374","6,948,073","5,246,100","60,873,000","1,688,359","82,400,996","10,706,290","89,971","10,064,000","68,251,090","1,094,583,000","6,426,679","2,780,132","127,433,494","6,053,193","23,301,725","49,044,790","2,505,559","3,925,502","6,036,914","480,222","2,055,915","24,821,286","369,031","401,880","4,320,490","16,570,613","4,098,900","907,229","22,276,056","141,377,752","9,907,509","27,601,038","81,895","4,553,009","2,009,245","46,888,200","43,398,150","19,043,380","1,131,000","7,508,700","22,858,872","64,232,760","116,921","1,056,608","71,158,647","60,776,238","296,410,400","211,971"],["Government","emerging democracy","republic","republic; multiparty presidential regime","republic","federal parliamentary democracy","federal republic","constitutional parliamentary democracy","parliamentary democracy","democracy","parliamentary democracy","(possibly outdated) absolute monarchy; special treaty relationship with India; note - transition to a constitutional monarchy is expected in 2008 constitutional monarchy; special treaty relationship with India","republic","emerging federal democratic republic","federal republic","military junta","socialist republic","presidential/parliamentary democracy","socialist republic","republic","republic","republic","republic","republic","federal republic","parliamentary republic","parliamentary democracy","parliamentary democracy","theocratic republic","federal republic","parliamentary democracy","constitutional parliamentary democracy","constitutional monarchy with a parliamentary government","constitutional monarchy","juche socialist republic","republic","constitutional emirate","republic","jamahiriya (a state of the masses) in theory, governed by the populace through local councils; in practice, an authoritarian state","constitutional monarchy","parliamentary democracy","constitutional monarchy","republic","republic","republic","constitutional monarchy","parliamentary democracy","emirate","democracy","federation","republic; presidential, multiparty system","absolute monarchy","republic","parliamentary republic","parliamentary republic","republic","parliamentary monarchy","republic under an authoritarian military-dominated regime","monarchy","formally a confederation but similar in structure to a federal republic","multiparty democracy","constitutional monarchy","constitutional monarchy","parliamentary democracy","republican parliamentary democracy","constitutional monarchy","federal republic","parliamentary republic"],["Conscription","Yes","Yes","Yes","Legal, not practiced","No (banned as enshrined by parliament in 1972","Yes","No","No","No (abolished in 1994)","Legal, not practiced","Yes (selective)","Yes (only when there are few volunteers)","No","Yes","Officially prohibited, de facto still practiced","Yes (selective)","No (abolished by law in 2008)","Yes (both sexes)","No","Legal, not practiced","Yes","No (conscription suspended since 2001)","No","Yes","Yes","No (no military service)","No","Yes","No","Yes (both sexes)","No","No","No","Yes","Yes","Yes","No (abolished in 2007)","Yes","No","No","Yes (selective)","No","No","Yes","Legal, not practiced","No","No","No (ended in 2007)","Yes","No","No","Yes","Yes","No","No","No","Yes","No","Yes","Yes (alternative service available","Yes","No","No","Yes","No (except Bermuda Regiment )","No","No"]],"pageTitle":"Untalented | Learn everything there is to know about Untalented at Reference.com","title":"Conscription by country — Examples","url":"http://www.reference.com/browse/untalented","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"RELATION","tableNum":0,"s3Link":"","recordEndOffset":0,"recordOffset":0,"tableOrientation":"HORIZONTAL","TableContextTimeStampBeforeTable":"{20401\u003dThe Moroccan Sultan Moulay Ismail \"the Bloodthirsty\" (1672-1727) raised a corps of 150,000 black slaves, called his Black Guard, who coerced the country into submission., 24550\u003dIn the middle of the 14th century, Ottoman Sultan Murad I built his own personal slave army called the Kap?kulu. The new force was based on the sultan\u0027s right to a fifth of the war booty, which he interpreted to include captives taken in battle. The captive slaves were converted to Islam and trained in the sultan\u0027s personal service. In the dev?irme (translated \"blood tax\" or \"child collection\"), young Christian boys from the Balkans were taken away from their homes and families, converted to Islam and enlisted into special soldier classes of the Ottoman army. These soldier classes were named Janissaries, the most famous branch of the Kap?kulu. The Janissaries eventually became a decisive factor in the Ottoman invasions of Europe. Most of the military commanders of the Ottoman forces, imperial administrators and de facto rulers of the Ottoman Empire, such as Pargal? ?brahim Pasha and Sokollu Mehmet Pa?a, were recruited in this way. By 1609 the Sultan\u0027s Kap?kulu forces increased to about 100,000. Mahmud II forcibly disbanded Janissary corps in 1826., 22331\u003dMamluks were slave soldiers who converted to Islam and served the Muslim caliphs and the Ayyubid sultans during the Middle Ages. The first mamluks served the Abbasid caliphs in 9th century Baghdad. Over time they became a powerful military caste, and on more than one occasion they seized power for themselves, for example, ruling Egypt from 1250-1517. From 1250 Egypt had been ruled by the Bahri dynasty of Kipchak origin. Slaves from the Caucasus served in the army and formed an elite corp of troops eventually revolting in Egypt to form the Burgi dynasty. Mamluks were mainly responsible for the expulsion of the Crusaders from Palestine and preventing the Mongol Ilkhanate of Persia and Iraq from entering Egypt., 17809\u003dIn Russian Empire, the service time was 25 years at the beginning of the 19th century. In 1834 it was decreased to 20 years. The recruits should have been not younger than 17 and not older than 35. In 1874 universal conscription on the modern pattern was introduced, an innovation only made possible by the abolition of serfdom in 1861. New military law decreed that all male Russian subjects, when they reached the age of 20, were eligible to serve in the military for six years., 17140\u003dConscription was introduced in the Union Army during the American Civil War. The 1863 Enrollment Act permitted draftees to hire paid substitutes to fight in their place. This, and the bounty system, led to widespread dislike of conscription by the public at large; the New York Draft Riots were one symptom. In addition, draftees were viewed with disdain by volunteer soldiers and their officers. In the end, the draft provided only 6% of the Union Army\u0027s manpower. Conscription was not employed again in the U.S. until 1917., 11830\u003dIn 1981 in the United States, several men filed lawsuit in the case Rostker v. Goldberg, alleging that the Military Selective Service Act violates the Due Process Clause of the Fifth Amendment by requiring that men only and not also women register with the SSS. The Supreme Court eventually upheld the Act, stating that \"the argument for registering women was based on considerations of equity, but Congress was entitled, in the exercise of its constitutional powers, to focus on the question of military need, rather than \u0027equity.\u0027, 10618\u003dOn October 1, 1999 in the Taiwan Area, the Judicial Yuan of the Republic of China in its Interpretation 490 considered that the physical differences between males and females and the derived role differentiation in their respective social functions and lives would not make drafting males only violating the Constitution of the Republic of China. However, transsexual persons are exempt from the Taiwanese conscription., 5187\u003dToward the end of the U.S. draft, an attempt was made to make the system somewhat fairer by turning it into a lottery, with each of the year\u0027s calendar dates randomly assigned a number. Men born on lower numbered dates were called up for review. For the reasons given above, this did not make the system any fairer, and the entire system ended in 1973. Today, American men 18-25 are required to register with the government, but there has not been a callup since the Vietnam Era.}","TableContextTimeStampAfterTable":"{29444\u003dIn Soviet-bloc Hungary, more than half of pre-1989 conscripts received a mere few weeks of rifle training and were swiftly assigned to \"working squadrons,\" which usually hand-built rail tracks \"for free\", and in very poor quality. At the same time, railway tracks in Western Europe were being built to high-quality standards by semi-automatic, rail-rolling factories operated by a professional workforce., 26616\u003dSome groups, such as libertarians, say that the draft constitutes slavery, since it is mandatory work. Under the Thirteenth Amendment to the U.S. Constitution, slavery or other involuntary servitude is not allowed unless it is part of punishment for a crime. They therefore see the draft as unconstitutional (at least in the U.S.) and immoral. In 1918, the Supreme Court ruled that the World War I draft did not violate the United States Constitution. Arver v. United States, ). The Court detailed its conclusion that the limited powers of the federal government included conscription. Its only statement on the Thirteenth Amendment issue reads thus:}","lastModified":"","textBeforeTable":"See: Military service Countries with and without mandatory military service Though some conscripts feel that they benefited from their experience in the military, others feel that their time could have been spent more productively pursuing their chosen studies or career paths. Individual resentment may also be compounded by the typically low wages paid to conscripts, especially in countries such as Greece, South Korea, Finland and Singapore. In Israel, the Muslim and Christian Arab minority, as well as many ultra-Orthodox Jews are also exempt from mandatory service. This exemption, however, does not cover Druze Israeli citizens and several Bedouin Muslim villages. Permanent residents such as the Druzes of the Golan Heights are also excused. Exemption does not prevent members of the exempted groups from volunteering although such behavior is marginal. There are those who are immune to the draft. These people include anyone who works for the government (Teachers, police officers, lawmakers, etc), People who work for government","textAfterTable":"Notes: Unless otherwise noted, information is sourced from Nationmaster.com Arguments against conscription Universal Declaration of Human Rights Many arguments opposed to conscription, or opposed to gender-discriminated conscription, arise from its violation of the principles of the Universal Declaration of Human Rights of the United Nations. In particular: Art.2: Everyone is entitled to all the rights and freedoms set forth in this Declaration, without distinction of any kind, such as (?) sex (?) Art.3: Everyone has the right to life, liberty and security of person. Art.4: No one shall be held in (?) servitude (?) Art.18: Everyone has the right to freedom of thought, conscience and religion; this right includes freedom to change his religion or belief, and freedom, either alone or in community with others and in public or private, to manifest his religion or belief in teaching, practice, worship and observance. Art.20: (?) No one may be compelled to belong to an association. Art.23: Everyone has the right (?) to free choice of employment (?) In addition, many constitutions do provide similar rights in countries where there is or has been some form of conscription after World War","hasKeyColumn":true,"keyColumnIndex":0,"headerRowIndex":0}