{"relation":[["Name","Arcadius","Theodosius II","Marcian","Leo I","Leo II","Zeno","Anastasius","Glycerinus","Justin I","Justinian I","Justin II","","Maurice","Phocas","Heraclius","Constantine III","Constans II","Constantine IV","Justinian II","Leontius","Tiberius II","Justinian II restored","Philippicus (Bardan)","Anastasius II","Theodosius II","Leo III the Isaurian","Constantine V Copronymus","Leo IV","Constantine VI","Irene","Nicephorus I","Michael I Rangabe","Leo V the Armenian","Michael II","Theophilus","Michael III"],["Reign","395-408","408-50","450-7","457-74","474","474-491","491-518","","518-27","527-65","-578","","-602","602-10","610-41","-641","641-88","c 673","685-695 dep","695","697/8","704/5-11","711-3","713-6","716-7 abd","717-","720-75 co-emp","775-","780-97dep","797","802-11","811-13","813-20","820-9","829-42","842-67"],["Full Name","","","","","","","","","","Flavius Petrus Sabbatius Justinianus","","","","","","","","","","","","","","","","","","","","","","","","","",""],["Family","Son of Theodosius the Great","Son of Arcadius","","","Grandson of Leo II Son of Zeno + Ariadne","Father of Leo II","","","","Nephew of Justin","Nephew of Justinian II","","","","","","son of Constantine III","","","deposed Justinian II","deposed Leontius","","killed Justinian II","","","","","son of Constantine V","son of Leo IV + Irene","deposed Constantine VI","","","","","son of Michael II",""],["Spouse","","Eudoxia","","","","Ariadne, dau Leo I","","","","Theodora","Sophia, neice of Theodora","","","","","","","","","","","Theodora (a Khazar)","","","","","","Irene","","","","","","","Theodora",""]],"pageTitle":"Europe-Medieval","title":"","url":"http://www.tekeli.li/onomastikon/Europe-Medieval/Byzantium.html","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"RELATION","tableNum":4,"s3Link":"","recordEndOffset":0,"recordOffset":0,"tableOrientation":"HORIZONTAL","TableContextTimeStampAfterTable":"{28321\u003dThis collection of names was compiled by Kate Monk and is ©1997, Kate Monk., 1914\u003dThe Iconoclastic controversy led to conflict between the emperors and the papacy and the Greek Orthodox Church broke with Rome in 1054. The Byzantine Empire reached the height of its prosperity under the Macedonian dynasty (867-1056). The Bulgars, who had been a formidable threat, were defeated after a long struggle by Basil II (\u0027the Bulgar-slayer\u0027) in 1018 but the Empire declined after his death due problems between internal factions. In 1071-3, the Seljuk Turks conquered most of Anatolia and in 1204, the Fourth Crusade sacked Constantinople and created a new Latin (West European) Empire under Baldwin of Flanders. The Greeks recaptured it in 1261 and restored the Byzantine Empire but it was never as strong and the Turks captured Constantinople in 1453 and founded the Ottoman Empire. The name of the city was later changed to Istanbul., 195\u003dThis city on the Bosphorus was founded as a colony by the Greek city of Megara around 660 BC, at an important strategic site at the entrance to the Black Sea. It became part of the Roman empire.}","lastModified":"","textBeforeTable":"Byzantine Emperors   Veneranda Theognosia Theodosia Theodoracis Theodora Theocharista Syagria Pericleia Pateria Passara Pasara Nonna Nicasia Nereida Megethia Megaris Marozia Macedonia Leocadia Ionnina Ionnia Ionna Hesychia Herena Helena Gundesvinda Georgia Gabrielia Evantia Eusebia Euphrasia Euphemia Eugenia Eudoxia Eudocia Erchantrudis Epiphania Domentzia Didyma Destasia Damiane Cyra Comito Charito Byzantia Bore Bobila Baudegundis Basina Basilina Basilia Athanasia Arabia Appa Anzoy Antipatra Anna Alexandria Aetheria Greek and Biblical - Female     Zoilus Ziper Zenobius Zeno Zemarchus Vasacius Varazes Vaanes Tzittas Tzimisas Trasaricus Trasaric Theotimus Theophylactus Theophylact Theophilus Theophilius Theopemptus Theon Theogenius Theodulus Theodorus Theodoricus Theodoretus Theodore Theodoracius Theoctistus Theocharistus Tarchaniotes Symeonius Symeon Syagrius Syagricus Strategius Stilicho Stauracius Speciosus Smaragdus Sittas Simocatta Senuthius Scholasticus Satabus Sarapammon Rogatus Potamius Plutinus Photinus Phoebammon Philoxenus Phillippus Philippicus Philaretus Philagrius Perigenes Pelagius Pastor Paschalis Parthenius Pardus Pantagathus Pancratius Pamphilus Palamas Pachymeres Origen Olympius Olybrius Nichomachus Nicetius Nicetas Nicephorus Nazares Musonius Moschus Michaelius Methodius Menas Melminius Meletius Megistus Megas Maruthus Marthanes Lecapenus Laskaris Isidorus Isaacius Isaaces Irenaeus Iosephus Iosephius Ioseph Iordanes Ionnes Ionnacius Ignatius Iacobus Hydatius Himerius Hermongenes Heraclius Helladius Hannibalianus Gregoras Godilas","textAfterTable":"Macedonian Dynasty Basil I the Macedonian 867-86 deposed Michael III   Leo VI 886-912 son of Basil I   Alexander 912-3 brother of Leo VI   Constantine VII Porphyrogenitus 913-59 son of Leo VI   Romanus I Lecapenus 920-44     Romanus II       Nicephorus II Phocas 963-9     John Tzimisces 969-76     Basil II Bulgaroctonus 976-1025 son of Romanus II   Constantine VIII 976-1028 son of Romanus II   Romanus III 1028-34 Zoe, daughter of Constantine VIII Michael IV the Paphlagonian 1034-41   Zoe, daughter of Constantine VIII Michael V 1041-2 nephew of Michael IV   Theodora + Zoe 1042   daughters of Constantine VIII Constantine IX Monomachus 1042-55   Zoe, daughter of Constantine VIII Theodora 1055-6 last Macedonian daughter of Constatine VIII Michael VI the Aged 1056-7abd     Comnenus Dynasty Isaac I Comnenus 1057-9 abd     Constantine X Ducas 1059-67   Eudocia Macrembolitissa Eudocia 1067-8 wife of Constantine X   Romanus IV Diogenes 1068-71   Eudocia Macrembolitissa Michael VII 1071-8 son of Constantine X  ","hasKeyColumn":true,"keyColumnIndex":0,"headerRowIndex":0}