{"relation":[["","Promoter","FII","DII","Others","Total"],["Jun\u0027 15","64.45","18.63","4.00","12.92","100.00"],["Dec\u0027 14","64.50","13.14","3.48","18.88","100.00"],["Sep\u0027 14","64.50","11.86","3.12","20.52","100.00"],["Jun\u0027 14","64.50","11.11","2.33","22.06","100.00"]],"pageTitle":"Dish TV India Stock Price, Share Price, Live BSE/NSE, Dish TV India Bids Offers. Buy/Sell Dish TV India news \u0026 tips, \u0026 F\u0026O Quotes","title":"","url":"http://www.moneycontrol.com/india/stockpricequote/media-entertainment/dishtvindia/DTV","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"MATRIX","tableNum":34,"s3Link":"common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988650.53/warc/CC-MAIN-20150728002308-00069-ip-10-236-191-2.ec2.internal.warc.gz","recordEndOffset":596788847,"recordOffset":596738341,"tableOrientation":"MIXED","TableContextTimeStampAfterTable":"{137007\u003dNIFTY Jul Fut, 133699\u003d31 July 2015, 136302\u003dDrReddysLabs Jul Fut, 215234\u003dDish TV is in the Media \u0026 Entertainment sector. The current market capitalisation stands at Rs 12,368.39 crore. The company management includes Subhash Chandra - Non Executive Chairman, Jawahar Lal Goel - Managing Director, Ashok Kurien - Non Executive Director, Bhagwan Dass Narang - Independent Director, Arun Duggal - Independent Director, Eric Louis Zinterhofer - Independent Director, Lakshmi Chand - Independent Director, Mintoo Bhandari - Non Exe. \u0026 Nominee Director, Utsav Baijal - Alternate Director, Rashmi Aggarwal - Addnl.Independent Director. It is listed on the BSE with a BSE Code of 532839 and the NSE with an NSE Code of DISHTV. Its Registered office is at Essel House, B-10, Lawrence Road,,Industrial Area New Delhi,Delhi - 110035. Their Registrars are Sharepro Services (India) Pvt.Ltd., 213937\u003dIdea Cellular Recommended on Jan 20th 2015, 134210\u003dBharatForge Jul Fut, 134912\u003dVoltas Jul Fut, 135604\u003dINDAG RUBBER Jul Fut}","textBeforeTable":"Edit Watchlist Have you invested in these stocks? You can track them better in your Portfolio close[x] Add to Watchist Account Optional Optional Optional Optional Add to Portfolio OR Add to watchlist } $(\u0027#mcpcp_addprof_info\u0027).hide(); { function close_info()","textAfterTable":"Its easy and FREE! Username Username should be atleast 4 characters Password Password should be 6 to 10 characters Confirm Password Email OR connect with LIVE BSE Jul 31, 17:00 116.05 0.80 (+0.69%) VOLUME 775,805 AVERAGE VOLUME","hasKeyColumn":true,"keyColumnIndex":0,"headerRowIndex":0}