{"relation":[["The Video Game Critic","The Atari Times","neXGam","Tilt"],["Jul 10, 2010","Sep 04, 2003","Jun 27, 2013","Sep, 1982"],["A","85 out of 100","8.3 out of 10","4 out of 6"],["100","85","83","67"]],"pageTitle":"Warlords for Atari 2600 (1981) - MobyGames","title":"","url":"http://www.mobygames.com/game/atari-2600/warlords_","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"ENTITY","tableNum":2,"s3Link":"common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981460.12/warc/CC-MAIN-20150728002301-00002-ip-10-236-191-2.ec2.internal.warc.gz","recordEndOffset":592969586,"recordOffset":592953192,"tableOrientation":"HORIZONTAL","TableContextTimeStampAfterTable":"{22344\u003dVideo game information, credits, reviews, box covers, screenshots and more for 168 video game platforms from 1971 to date!, 22589\u003dMobyGames™ Copyright © 1999-2015 Blue Flame Labs. All rights reserved. Terms of Use. Privacy Policy.}","lastModified":"Tue, 28 Jul 2015 01:54:59 GMT","textBeforeTable":"User Reviews Warlords variant Part of the Following Group add alternate title] [ \"Kings in the Corner break-out game\" -- Working title Alternate Titles add screenshots] 3 more | [ Screenshots edit description] [ DescriptionIn Warlords, you need to defend yourself from three human and/or computer players. Each of the four players are in one of the corners of the screen guarded by a castle. You control a small shield which can be moved around the edge of the castle. To survive you need to use the shield to block a ball which bounces around the screen. If the ball hits your castle, it will take out some of the bricks. If a hole forms in the castle wall and the ball makes it though and hits your warlord, then you are out of the game. The last player left alive wins the battle, and the first player to win five battles wins the game! Several game options are included which allow you to either catch or ricochet the ball when the shield touches it, and control the speed","textAfterTable":"The Video Game Critic Jul 10, 2010 A 100 The Atari Times Sep 04, 2003 85 out of 100 85 neXGam Jun 27, 2013 8.3 out of 10 83 Tilt Sep, 1982 4 out of 6 67 [ add review] Forums There are currently no topics for this game. [ new thread] Trivia 1001 Video Games Warlords appears in the book 1001 Video Games You Must Play Before You Die by General Editor Tony Mott. Awards Flux Magazine (Issue #4) - #78 on the \"Top 100 Video Games of All-Time\" list Game Informer Magazine August 2001 (Issue #100) - #25 on the \"Top 100 Games of All Time\" poll Retro Gamer Magazine (Issue #46) - #8 on the “Top 25 Atari 2600” Games poll Information also contributed by Big John WV [ add trivia] Servo (55772) added Warlords (Atari 2600) on May 09, 2003 Other platforms contributed by FatherJack (58530)","hasKeyColumn":true,"keyColumnIndex":0,"headerRowIndex":0}