{"relation":[["elisamario","bigcocksupnher","waterboy00001","jag1227","ronricker","thickmr","Loves_forced_bi","rob_355","atrainbi6267","scsteve2002","559Visalia","jeff76542","magnum933","mcgolf69","hairpie2008","chasmore","pghmale"],["We are a committed couple, very fit, educated, and discreet. Will be in Birmingham two nights 10/22 and 10/23 and looking for a playmate. She plays and he watches!","sexy cpl wild crazy anything goes when we are fucking deep big toys anal","Just a laid back professional guy looking for bi sexual/bi curious males for discreet encounters. Like straight acting males; MARRIED GUYS ARE A PLUS.++++++ Enjoy having sex w/male while female watches and then participates.","Bi guy looking for oral delights. I love to suck cock and eat pussy Size and shapes or age are not important. As long as you are clean and healthy I would love to suck a cock while a female watches I really enjoy eating cream pies. So singles or couples are very welcome. Lets get together and have some fun. Life is to short to miss out on anything. .","to suck cocks and love to eat pussy. By that, I mean that I am bisexual and it is the right of any individual to be that way. I am not gay, but enjoy some behaviors that some would consider \"gay\". Note that I thoroughly enjoy licking the kitty which to me ranks equal to fucking. Then again, I enjoy gaging on a thick cock. We are all the same yet we are all different.","6\u00270\u0027\u0027 165lbs 8.5in cut nice looking fellow. I consider myself a gentleman who likes to give as well as receive. I\u0027m not much for the ruff stuff, I prefer to enjoy encounters that allow for sensuality and tenderness to prevail over athleticism and selfishness. Now, if the erotic energy is flowing, there is nothing wrong with going at it with excitement and gusto, but If you are looking for a one dimensional fucking machine, you should pass me by. I like to have sexy fun...I\u0027m not about degrading others, nor should there be any name calling or racist comments when I play. Respect is a two way street. if you feel the same way, then we should meet ~","Hi I\u0027m 6\u0027 1\" bi curious guy. I am very open minded and easy going guy. She is hot and looking for bi guys to fuck her while i watch. She wants to have me get fucked while I fuck her. Were open to anything just message us and see what happens... My boyfriends such a little sexy slut...one thing though his cock is huge...so he gets points for that I\u0027d love to ride his cock and makeout with a guy as that guy fucks his ass....its open for business guys who wants it...also you can have me if your willing to let him watch. I could use a good fucking, who wants to give it to me...preferably under 40...","Im 6ft, 200, brown hair, hazel eyes, 6 inch hard cock! to completely satisfy a woman (love to eat pussy). Looking for fuck buddie(s) MMF/MFF, cyber/phone sex! Not looking for relationship, just discrete sex. Im considered attractive by women. Because I want to be discrete, I can only send pic upon request.... MEN: If you really like sucking and fucking hard cock and need to suck and fuck hard cock, fell freee to contact me! I love to be serviced by others","Hi im 46 yrs old and i am bisexual. i am 5\u002711 220 lbs i have a 9 iinch penis atratctive nice looking fun guy iso bisexual males or couples where the male is bi and female likes it and wants to participate i love to eat pussy but ive had several bisex experiences and i love to suck cock and swallow cum would enjoymmf mm mmm enjoy licking a mans ass and balls would like to make friends and make them last. i smoke cigarrettes 420 occasional drinker d/d free love white couples and white men. im serious and know that i am bi and want to find a couple of good friends that are willing to drive to meet for good times and conversations and good friendship lets get together im really horny for some cock","38yo bisexual male. Well I\u0027m open to a lot and interested in a lot. I would love to experience more of my submissive side, find an attractive and well hung man to make me his cum slut to fuck me, just make sure he\u0027s happy and taken care off. Another is a few woman with strap-ons. I also like black men and woman and would love to even try a gang bang. I would really enjoy being with a bi couple and enjoy sucking a cock off together with a woman, eating her out while she\u0027s getting fucked, and DP her. And of course good fun kinky sexy with a woman, from eating her out to fucking her in the ass and everything in between. Not really into Piss, Scat, extreme pain or torture, and of course NO KIDS!","Hello. I am a Married white male","45 y/o white male, 6ft average weight. Looking to try something new and exciting.","white male very straight acting and masculine.","Single layback white male, that would like to meet couples for fun","single white male, retired, love to travel!!!","white male,5ft 7 13 stone blue eyes,blond.","White male 5 11 200lbs attractive D/D free and very oral"]],"pageTitle":"White.wifes.fucking.blackmen.husbands.watches Bisexual Playground","title":"","url":"http://www.bisexualplayground.com/ext-search.php?q\u003dWhite.wifes.fucking.blackmen.husbands.watches","hasHeader":false,"headerPosition":"NONE","tableType":"LAYOUT","tableNum":8,"s3Link":"common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981969.11/warc/CC-MAIN-20150728002301-00077-ip-10-236-191-2.ec2.internal.warc.gz","recordEndOffset":317847671,"recordOffset":317818085,"tableOrientation":"HORIZONTAL","textBeforeTable":"Interests: White.wifes.fucking.blackmen.husbands.watches Blocking Autoresponses Preset Messages Manage Folders Remove Account Log Off Links Change Membername Change Member Type Change E-Mail Address Change Password Change Membership Status Banners Help Us Advertise Ways To Advertise Tell A Friend Link To Us Section 10 - Information For Us Section 9 - Contacting You Section 8 - Miscellaneous Info Section 7 - Same Sex Interests Section 6 - Sexually Speaking Section 5 - Physical Description Section 4 - Getting Together* Section 3 - Looking For* Section 2 - About You* Section 1 - Location*","textAfterTable":"Profiles: elisamario We are a committed couple, very fit, educated, and discreet. Will be in Birmingham two nights 10/22 and 10/23 and looking for a playmate. She plays and he watches! bigcocksupnher sexy cpl wild crazy anything goes when we are fucking deep big toys anal waterboy00001 Just a laid back professional guy looking for bi sexual/bi curious males for discreet encounters. Like straight acting males; MARRIED GUYS ARE A PLUS.++++++ Enjoy having sex w/male while female watches and then participates. jag1227 Bi guy looking for oral delights. I love to suck cock and eat pussy Size and shapes or age are not important. As long as you are clean and healthy I would love to suck a cock while a female watches I really enjoy eating cream pies. So singles or couples are very welcome. Lets get together and have some fun. Life is to short to miss out on anything. . ronricker to suck cocks and love to eat pussy. By that, I mean that I","hasKeyColumn":true,"keyColumnIndex":0,"headerRowIndex":-1}