{"relation":[["Size","Neck","Chest"],["AS","14-14.5\"","34-36\""],["AM","15-15.5\"","38-40\""],["AL","16-16.5\"","42-44\""],["AXL","17-17.5\"","46-48\""],["A2XL","18-18.5\"","50-52\""],["A3XL","19-19.5\"","54-56\""],["A4XL","19.5-20\"","58-60\""],["A5XL","20-20.5\"","62-64\""],["A6XL","20.5-21\"","66-67\""]],"pageTitle":"Blue Generation Men\u0027s SS Soft Touch Polo Shirts - Cheerleading Equipment and Gear","title":"","url":"http://cheer.epicsports.com/prod/13896/blue-generation-mens-ss-soft-touch-polo-shirts.html?cid\u003d7342","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"ENTITY","tableNum":2,"s3Link":"common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981969.11/warc/CC-MAIN-20150728002301-00077-ip-10-236-191-2.ec2.internal.warc.gz","recordEndOffset":43627639,"recordOffset":43606401,"tableOrientation":"VERTICAL","textBeforeTable":"Men\u0027s/Adult Size Chart (Body Measurements) Adult Sizes: AS - A6XL - Shirt Only (all other items shown are not included) - Tag free label - Matching buttons - Taped neck \u0026 shoulders - Side vents - Straight bottom - Curl free collar - Rib knit collar \u0026 cuffs - Wrinkle resistant - 5.5 ounce - Easy care 65/35 poly cotton blend - Classic Fit (standard fit, roomy across chest \u0026 shoulder, straight through body) Details: Style #: BG7500 Blue Generation Men\u0027s Short Sleeve Soft Touch Pique Polo Shirt Product Description Gildan DryBlend Adult T-Shirt with Pocket $13.39 $3.49-$8.39 Bella Womens Sheer Jersey Short Sleeve... $19.00 $1.49 Baw Ladies 3/4 Sleeve Xtreme-Tek Polo... $18.99 $11.99-$16.29  ","textAfterTable":"Neck - Measure around neck just below larynx Chest - Measure across fullest part of chest under arms Usually ships within 2 to 3 business days. Allow an extra 3 business days if embroidered. Note: UPS DOES NOT DELIVER ON SATURDAY OR SUNDAY, regardless of shipping method selected. **BECAUSE DYE LOTS VARY, WE CANNOT GUARANTEE COLOR MATCHING ON ALL SHIPMENTS** Due to color differences in monitors, the colors on this site are for reference only. Please contact Epic Sports if you have any color questions. Would you like to view the available embroidery options and costs before adding this product to your cart? Frequently Bought With Blue Generation Men\u0027s SS Cotton Twill Shirts [E27327] $14.79-$22.19   Instant Cold Packs First Aid (Ea or Case) [E61339] $0.99-$11.99  ","hasKeyColumn":false,"keyColumnIndex":-1,"headerRowIndex":0}