{"relation":[["Size","X-Small","Small","Medium","Large","X-large"],["Length","8\"","12\"","16\"","20\"","24\""]],"pageTitle":"Zack \u0026 Zoey Saddle Jockey Costume - SMALL","title":"","url":"http://www.entirelypets.com/zack-and-zoey-saddle-jockey-costume-small.html","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"ENTITY","tableNum":6,"s3Link":"common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988312.76/warc/CC-MAIN-20150728002308-00321-ip-10-236-191-2.ec2.internal.warc.gz","recordEndOffset":434179415,"recordOffset":434150559,"tableOrientation":"HORIZONTAL","textBeforeTable":"Adjustable Velcro straps provide opportunity to give a customized fit to the costume without causing discomfort to the dog Tiny, fully uniformed Jockey figure adds to the authentic look of this costume Great for special occasions or use while going on a casual walk outside Unique costume design that will serve as conversation starter at a party or while out for a walk Benefits of purchasing this dog costume include: A large costume from Zack \u0026 Zoey is designed to fit most large breed dogs. Comfort is guaranteed with the use of a small, discrete Velcro strap. Velcro straps around the chest and belly keep the costume securely in place without causing skin irritations. Velcro straps are adjustable for easy customization that allows all dogs to become a jockey for a day. Get conversations started by dressing your furry four-legged friend with the Zack \u0026 Zoey Large Saddle Jockey Costume. Simple and unique, this dog costume will be sure to attract attention and get people talking as you walk down the street. Costume is designed to appear as if your pet has saddled up and awaiting his or her big chance at the races. A tiny Jockey figurine sits upon your pet just waiting to grab the reigns and get the race started. Jockey figurine is securely sewn into place to prevent it from falling off or coming loose.","textAfterTable":"*All Pet Costume sales are Final. No returns or exchanges. Top Usage Information Sizing Guide: Back: Measure length of pet\u0027s back from the base of the neck to the base of the tail. See below for estimating by breed. Neck: Measure the circumference of pet\u0027s neck for a snug fit. No need to add inches as you would with a collar. Chest/Girth: Measure girth around the broadest part of the chest and add 2\". Note: If the dog has a stout build, select one size larger. Recommended Sizing by Breed: XX-Small: Teacup and dogs under 5 lbs X-Small: Australian Terrier, Chihuahua, Pomeranian, Toy Poople, Yorkshire Terrier Medium: Bichon Frise, Beagle, Cocker Spaniel, Corgi, Scottish Terrier Large: Brittany Spaniel, Bulldog, Collie, Schnauzer, Springer Spaniel X-Large: Doberman Pinscher, German Sheperd, Golden Retriever, Labrador Retriever, Rottweiler Size Length X-Small","hasKeyColumn":true,"keyColumnIndex":0,"headerRowIndex":0}