{"relation":[["","Low Interest","Business","Student","Balance Transfer","Airline","Reward","Cash Back","Instant Approval","Bad Credit"],["Avg. APR","11.62%","12.85%","13.14%","14.12%","15.10%","15.14%","15.27%","18.00%","22.73%"],["Last Week","11.62%","12.85%","13.14%","14.12%","15.10%","15.14%","15.27%","18.00%","22.73%"],["6 Months","10.24%","12.85%","13.14%","12.80%","15.52%","14.89%","14.91%","23.33%","22.73%"]],"pageTitle":"All-cash home sales reach new high - MarketWatch","title":"","url":"http://www.marketwatch.com/story/nearly-half-of-all-homes-are-purchased-in-cash-2013-08-29?siteid\u003dyhoof2","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"MATRIX","tableNum":0,"s3Link":"common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042991019.80/warc/CC-MAIN-20150728002311-00090-ip-10-236-191-2.ec2.internal.warc.gz","recordEndOffset":568115855,"recordOffset":568078324,"tableOrientation":"MIXED","TableContextTimeStampAfterTable":"{67284\u003dAll-cash purchases accounted for 42% of all sales of residential property in November 2013, up from 39% during the previous month, according to data from real-estate data firm RealtyTrac released Friday. “This is still a very cash- and investor-driven market,” says Daren Blomquist, vice president at RealtyTrac., 68624\u003dWhen interest rates went up slightly in June, there was a notable increase in cash sales, Daren Blomquist says. “Some markets are more interest-rate sensitive than others based on affordability,” he says. “Just a slight increase makes homes a lot less affordable.” In fact, another report by Goldman Sachs in August was even more strongly in the cash-is-king camp, estimating that cash sales now account for 57% of all residential home sales versus 19% in 2005. Walt Molony, a spokesman for the National Association of Realtors, says that the association’s estimate of the share of the market made up by all-cash buyers is lower than others’, at 31% in July, but that it’s still at an all-time high., 71097\u003dIf tapering does lead to higher mortgage rates, some home buyers might buy with cash rather than a mortgage, says Jed Kolko, chief economist for real-estate firm Trulia. However, many cash buyers are investors, and now that prices have risen, investor activity is also starting to decline, he says. (House prices in 20 American cities rose more than 13% in the 12 months leading up to September, according to the S\u0026P/Case-Shiller index of property values, the biggest rise since February 2006.) “On balance, the all-cash share of purchases will probably decline next year, as fading investor activity outweighs the impact of higher rates.”, 121685\u003dCopyright ©2015 MarketWatch, Inc. All rights reserved., 68037\u003dThe decision by the Federal Reserve Wednesday to reduce its bond-buying program to $75 billion per month starting in January, from $85 billion per month currently, may also encourage more cash-purchases — at least for those who can afford it, Blomquist says. “They’re going to do everything they can to keep interest rates low, which may be tough to do,” he says. To reduce cash buyers, he says there will need to be low interest rates and a cooling off in home price appreciation. “Otherwise, you’ll see the market skew even further toward cash buyers,” Blomquist says., 67613\u003dThe cities with the biggest month-over-month jumps in the number of all-cash sales, according to RealtyTrac, included Florida (63%), Georgia and Nevada (both 51%), South Carolina (50%) and Michigan (49%). This helped boost overall sales of U.S. residential properties, which sold at an annualized pace of 5.1 million in November 2013, a 1% increase from the previous month and a rise of 10% from a year ago., 69340\u003dMolony says that investors make up 32% of all-cash buyers (70% of all investors pay cash), up from 31% in October and 30% in November 2012, while retirees who’ve built up equity in their homes or paid off their mortgages account for around 12%. The rest include vacation-home buyers and foreign buyers., 55532\u003dPublished: Dec 20, 2013 12:48 p.m. ET}","textBeforeTable":"National averages from Bankrate.com 2.6% 36 Mo Auto Refi 2.59% 60 Mo Auto Refi 3.06% 48 Mo New Car 3.14% 60 Mo New Car 2.88% 72 Mo New Car 3.3% 36 Mo Used Car 2.96% 48 Mo Used Car 2.69% 60 Mo Used Car National averages from Bankrate.com 0.42% MMA Savings Jumbo 0.29% MMA Savings 0.42% MMA $50K+ 0.28% MMA $10K+ 0.63% 1 yr CD 0.83% 2 yr CD 1.49%","textAfterTable":"Source: CreditCards.com Quentin Fottrell Quentin Fottrell is a personal finance reporter and The Moneyologist columnist for MarketWatch. You can follow him on Twitter @quantanamo. MarketWatch Partner Center","hasKeyColumn":true,"keyColumnIndex":0,"headerRowIndex":0}