{"relation":[["List_Powitalny-OdpicujMiCV.pl.pdf","Skrypt_Szkoleniowy-OdpicujMiCV.pl.pdf","Checklisty-OdpicujMiCV.pl.pdf","Klauzula-przetwarzanie_danych-Materialy_dodatkowe-OdpicujMiCV.pdf","Bonus_1-CV_Rentgen-OdpicujMiCV.pdf","Bonus_2-CV_Konsultacja-OdpicujMiCV.pl.pdf","Bonus_3-CV-Kompetencje-OdpicujMiCV.pdf"],["0,10 MB","0,31 MB","0,05 MB","0,05 MB","0,59 MB","0,04 MB","0,04 MB"]],"pageTitle":"Odpicuj mi CV - Jak pisać skuteczne CV w oparciu o wiedzę headhunterów (Tomasz Rudnik, Social Dynamics) - eMentor.pl","title":"","url":"http://www.ementor.pl/szkolenia/biznes/Jm6a71twUh?a\u003dsklep","hasHeader":false,"headerPosition":"NONE","tableType":"ENTITY","tableNum":2,"s3Link":"common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988312.76/warc/CC-MAIN-20150728002308-00321-ip-10-236-191-2.ec2.internal.warc.gz","recordEndOffset":432339030,"recordOffset":432330828,"tableOrientation":"HORIZONTAL","TableContextTimeStampAfterTable":"{6154\u003dCopyright © 2015 eMentor.pl}","textBeforeTable":"Materiały dodatkowe: padding-top:5px;\"\u003e text-align:right;\"\u003e oraz email: text-align:right;\" width\u003d\"30%\"\u003e Podaj imię: ZANIM ZDECYDUJESZ SIĘ NA ZAKUP SZKOLENIA obejrzyj 4 bezpłatne lekcje, zaczynając od Lekcji #1     znajdziesz nową pracę w ciągu 1-2 miesięcy Mając w ręku narzędzie, którere da Ci przewagę nad konkurentami na rynku pracy, 4 ZASADY TWORZENIA SKUTECZNEGO CV Odpicuj mi CV - Jak pisać skuteczne CV w oparciu o wiedzę headhunterów Biznes Szkolenia \u003e Profesjonalne szkolenia wideo z dostępem online Koszyk","textAfterTable":"Dostęp do materiałów uzyskasz po wykupieniu szkolenia, w sekcji \"Mój eMentor\". Podobne szkolenia Planowanie pracy Justyna Broniecka-Klim Zarzadzanie projektami Justyna Broniecka-Klim Jak osiągnąć TOP3 Google w 21 dni? Market Wiedzy Automatyzacja biznesu - nagranie webinaru Złote Myśli O autorze Social Dynamics - więcej Jak kupować? Zapłać online a natychmiast uzyskasz dostęp do szkolenia! Zaloguj się lub załóż konto. Wybierz sposób płatności. Dokonaj płatności online. Oglądaj szkolenie w przeglądarce lub pobierz na dysk! Gwarancja satysfakcji Wszystkie zakupy są objęte gwarancją satysfakcji. Jeśli szkolenie nie spełni Twoich oczekiwań, zwrócimy Ci pieniądze. Więcej Obsługa Klienta (032) 790 40 55 pomoc@ementor.pl","hasKeyColumn":false,"keyColumnIndex":-1,"headerRowIndex":-1}