{"relation":[["Week Beginning","1-Jul-12","8-Jul-12","15-Jul-12","22-Jul-12","29-Jul-12","5-Aug-12","12-Aug-12","19-Aug-12","26-Aug-12","2-Sep-12","9-Sep-12","16-Sep-12","23-Sep-12","30-Sep-12","7-Oct-12","14-Oct-12","21-Oct-12","28-Oct-12","4-Nov-12","11-Nov-12","18-Nov-12","25-Nov-12","2-Dec-12","9-Dec-12","16-Dec-12","23-Dec-12","30-Dec-12","6-Jan-13","13-Jan-13","20-Jan-13","27-Jan-13","3-Feb-13","10-Feb-13","17-Feb-13","24-Feb-13","3-Mar-13","10-Mar-13"],["Image #4","#9","#9","#9","#19","#19","#19","#19","#20","#20","#20","#20","#17","#17","#17","#17","#12","#12 \u0026Rosary","#12","#12","#23","#23","Mid Year","#9","#9","#21","#21","#21","#25","#25","#25","Phx HS","#7","#7","#7","#7","#8","#8"],["Image #86","#14","#14","#14","#14","#23","#23","#23","#23","#28","#28","#28","#28","#30","#30","#30","#30","#24","#24","#24","#24","#32","#32","#32","#32","#15","#15","#15","#3","#3 \u0026 4th Degree","#3","Tucson HS","#1","#1","#1","#2","#2","#2"],["Image #105","#25","#25","#25","#25","#10","#10","#10","#10","#11","#11","#11","#11","#16","#16","#16","#16","#26","#26","#26","#26","#27","#27","#27","#27","#14","#14","#14","#10","#10","#10","Yuma HS","#18","#18","#18","#13","#13",""]],"pageTitle":"July 2012 ~ AZ Knights of Columbus","title":"","url":"http://www.azknightsofcolumbus.org/2012_07_01_archive.html","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"MATRIX","tableNum":0,"s3Link":"common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990217.27/warc/CC-MAIN-20150728002310-00299-ip-10-236-191-2.ec2.internal.warc.gz","recordEndOffset":309082231,"recordOffset":309043807,"tableOrientation":"MIXED","TableContextTimeStampAfterTable":"{47564\u003dIn order to make this happen, the students will need to raise funds to make the journey to Rome in October. The St. Pius Knights and parishioners will host a fundraising concert featuring the students and Vince Redhouse on Monday August 20, from 7 PM to 9 PM at St. Pius X Catholic Church. A suggested donation is $10 - $20 and all proceeds will go to help the students with their travel costs., 50527\u003dWorking together. On 18 July, a request for assistance was received from Brother Karl (deployed to Afghanistan) Griffor\u0027s wife. Amy requested help from Our Lady of the Mountains Council 10799 in removing flood debris from her fence line and adjusting her fence to allow further debris from collecting at the fence line. Brother Knights and family members again stepped up on 19 Jul and rendered their support. Less than two hours later the job was done before the rains came. A thank you was extended from Amy for the assistance that she received from Brothers Rob Bridges, Deacon Bill \u0026 Jo Merritt, David Waldmann, Chuck Everding, and Tom Whipp who grabbed their rakes, hammers, pliers and wire cutters to get the job done.}","lastModified":"Sat, 01 Aug 2015 17:38:50 GMT","textBeforeTable":"Please contact your District Deputy to schedule to have the image available for your council and parish. Listed below are the Districts that will have the Our Lady of Guadalupe Image Icon. No comments icon   7/08/2012 06:31:00 PM   Our Lady of Guadalupe Image Icon Tour Sunday, July 08, 2012 Read More Working together. On 18 July, a request for assistance was received from Brother Karl (deployed to Afghanistan) Griffor\u0027s wife. Amy requested help from Our Lady of the Mountains Council 10799 in removing flood debris from her fence line and adjusting her fence to allow further debris from collecting at the fence line. Brother Knights and family members again stepped up on 19 Jul and rendered their support. Less than two hours later the job was done before the rains came. A thank you was extended from Amy for the assistance that she received","textAfterTable":"Read More Thursday, July 05, 2012 Wheelchair Mission Program 7/05/2012 05:40:00 PM   wheelchair   No comments Brothers, Did you know . . . ? That the American Wheelchair Mission is the official mobility partner of the Knights of Columbus, and is headed by Chris Lewis, a Fourth Degree Knight and son of beloved actor and comedian Jerry Lewis? That the American Wheelchair Mission has in recent years distributed more than 30,000 life-changing chairs to children, teens and adults in Afghanistan, Cuba, Guatemala, Haiti, the Holy Land, Honduras, Mexico, Poland, the Philippines, Mexico, and Viet Nam? That one of the most successful fundraising and membership growth","hasKeyColumn":false,"keyColumnIndex":-1,"headerRowIndex":0}