{"relation":[["1988","1987","1985","1983","1982","1982"],["Equipment for Rio Platano Biosphere Reserve","Consultant services, training and equipment for improving the ...","Strengthen protection and management of Rio Platano Biosphere ...","Implementation of protective measures, of training activities and ...","Financial contribution towards ecodevelopment programmes and ...","Rio Platano Biosphere Reserve"],["20,000 USD","30,000 USD","20,000 USD","26,000 USD","67,025 USD","4,975 USD"]],"pageTitle":"UNESCO World Heritage Center - State of Conservation (SOC 1990) Río Plátano Biosphere Reserve (Honduras)","title":"","url":"http://whc.unesco.org/en/soc/1634/","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"ENTITY","tableNum":2,"s3Link":"common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042991019.80/warc/CC-MAIN-20150728002311-00090-ip-10-236-191-2.ec2.internal.warc.gz","recordEndOffset":256242319,"recordOffset":256224059,"tableOrientation":"HORIZONTAL","TableContextTimeStampBeforeTable":"{114\u003dRequests Approved: 0 (from 1982-1988) Total Amount Approved: 168,000USD}","TableContextTimeStampAfterTable":"{11250\u003dReporting \u0026 Monitoring State of Conservation (SOC) Periodic Reporting Questionnaires 2008-2015 Reactive Monitoring Africa Arab States Asia \u0026 Pacific Latin America and the Caribbean Europe and North America, 13845\u003d© UNESCO World Heritage Centre 1992-2015 United Nations}","textBeforeTable":"Requests Approved: 0 (from 1982-1988) Total Amount Approved: 168,000USD International Assistance granted to the property until 1990 Extreme pressure with the invasion of refugees and settlers into the Reserve; Illegal tree felling; Poaching; Road construction Factors* affecting the property identified in previous reports Illegal activities Identity, social cohesion, changes in local population and community Ground transport infrastructure Factors affecting the property in 1990* All 1988 1989 1990 1991 1995 1996 1997 1998 1999 2000 2001 2003 2004 2005 2006 2007 2008 2009 2010 2011 2012 2013 2014 2015 Río Plátano Biosphere Reserve (Honduras) Search  Text Search","textAfterTable":"Missions to the property until 1990** Conservation issues presented to the World Heritage Committee in 1990 [Oral report by IUCN] Decisions adopted by the Committee in 1990 Adopted Draft Decision 14COMIX SOC: Rio Platano Biosphere Reserve (Honduras) Rio Platano Biosphere Reserve (Honduras) The Committee noted that the Honduran authorities had submitted to the Secretariat a nomination of this property to the List of World Heritage in Danger. The Committee was unable to make a decision on this nomination, however, in the absence of any request for international assistance for this property pursuant to article 11.4 of the Convention. The Committee consequently urged the Honduran authorities to prepare and submit such a request as soon as possible. Read more No draft Decision  Honduras Date of Inscription: 1982 Nomination records (Year): 1981 Category: Natural Criteria: (vii)(viii)(ix)(x) Danger List (dates): 1996-2007, 2011-present","hasKeyColumn":false,"keyColumnIndex":-1,"headerRowIndex":0}