{"relation":[["Posts","Comments","Photos"],["7827","","2927"],["Videos","Followers","Following"],["1813","32","0"]],"pageTitle":"Comments - Doug MacCash, NOLA.com | The Times-Picayune | NOLA.com","title":"","url":"http://connect.nola.com/user/dmaccash/comments-2.html","hasHeader":false,"headerPosition":"NONE","tableType":"OTHER","tableNum":6,"s3Link":"common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042991019.80/warc/CC-MAIN-20150728002311-00090-ip-10-236-191-2.ec2.internal.warc.gz","recordEndOffset":56738447,"recordOffset":56713966,"tableOrientation":"HORIZONTAL","TableContextTimeStampAfterTable":"{56811\u003dDear muspench, grrlyfern, and everyone Thanks so much for watching and writing. About physical difficulty: I\u0027m a few years older than James, but I\u0027d kept up the pace for the whole 2005 trip. Almost. Near the end, we were pedaling up the (I think) Carrollton overpass on I-10, when I just couldn\u0027t go another inch. So I called out to James, who was a little in front of me, that I had to stop and rest. He stopped and said, \"Thank God. I couldn\u0027t give up before the old man.\", 60742\u003dThanks 7870 Faubourg. I had not been biking much this summer, so Saturday\u0027s trek was pretty tough. My legs are still a little wobbly. I was younger in 2005, of course, and adrenaline might have played a role. Doug MacCash, 48984\u003dHave no fear chentrails; I was busy this week preparing a new sort of video. It\u0027s an Arts and Entertainment weekend preview. Check it out. Tell me what you think. http://www.nola.com/entertainment/index.ssf/2010/10/video_new_orleans_entertainmen.html, 52037\u003dDear emr1boricua, Thanks for reading and writing. I too have heard that the practice can be found in Central America. Also, someone told me that this goes back at least 20 years in New Orleans -- though I\u0027d never noticed it until maybe last year. But here\u0027s another mystery: How did your comment about anti-fly bags end up in the blog about giant concrete sculpture? Here\u0027s the fly bag story: http://www.nola.com/arts/index.ssf/2010/09/do_those_fly_repellant_water_b.html, 80506\u003d© 2015 NOLA Media Group. All rights reserved (About Us). The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of NOLA Media Group.}","lastModified":"Tue, 04 Aug 2015 15:53:14 GMT","textBeforeTable":"More ... News Home | News Forums Loading headlines... Featured News Home Loading headlines... RSS Facebook Twitter Follow us: News News Sign in Search NOLA.com 5-day | Hurricane Center Greater N.O. Baton Rouge NOLA.com Sign in | Join RSS Facebook Twitter Greater New Orleans","textAfterTable":"Environment Hurricane Center Religion Military Business Business Follow us: Twitter Facebook RSS Loading headlines... Business Home » Featured Loading headlines... Find Area Businesses | Business Forum » More ... Real Estate Transactions TP Store Entrepreneurs Contact Us Hollywood South Connect Science and Tech Newsletters Jefferson Parish Journal Sports Sports Follow us: Twitter Facebook RSS Loading headlines... Sports Home Featured Loading headlines... Sports Site Map | All Sports Forums More ... Saints Talk Saints! LSU Sports photos SEC sports Video reports, interviews","hasKeyColumn":true,"keyColumnIndex":0,"headerRowIndex":-1}