{"relation":[["Company","ALLEGIANT T…","SIMULATIONS…","BOOT BARN H…","AMEDISYS IN…","CAL-MAINE F…"],["Symbol","ALGT","SLP","BOOT","AMED","CALM"],["Price","219.87","6.66","32.56","44.88","55.11"],["%Chg","+3.36%","+3.10%","+3.04%","+2.87%","+1.75%"]],"pageTitle":"SLB, CAM Form Subsea Joint Venture - November 16, 2012 - Zacks.com","title":"","url":"http://www.zacks.com/stock/news/86994/slb-cam-form-subsea-joint-venture","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"RELATION","tableNum":0,"s3Link":"common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990217.27/warc/CC-MAIN-20150728002310-00299-ip-10-236-191-2.ec2.internal.warc.gz","recordEndOffset":839339127,"recordOffset":839316044,"tableOrientation":"HORIZONTAL","TableContextTimeStampAfterTable":"{14846\u003dby Zacks Equity Research   Published on November 16, 2012 |, 20166\u003dOilfield services giant Schlumberger Limited (SLB - Analyst Report) and flow equipment and services specialists Cameron International Corporation (CAM - Analyst Report) have announced the formation of OneSubsea – a joint venture (JV) between the subsea units of both the companies to capitalize on the growing demand for deepwater drilling. The main purpose of the JV is to integrate the advanced reservoir knowledge as well as wellbore expertise with industry leading subsea capabilities to provide superior yield, efficiency and stability throughout the life of the field. It will also be responsible for producing and upgrading products, systems and services for the oil and gas market. The rise in oil prices in the recent times has encouraged oil majors to increase spending on exploration activities and enter newer territories like the Arctic and West Africa. These attempts entail new methods to access oil. Schlumberger believes that around 200 such fields will be commissioned worldwide over the next four years. The operational subsea well count is likely to reach 11,000 by 2020. Production equipments used for subsea operations are placed on the sea floor and developed such that it can endure strong ocean currents and harsh temperatures. Thus, the JV intends to increase recovery from these reservoirs through development of advance techniques. Per the terms of the agreement, Cameron will contribute its existing subsea division in return for $600 million from Schlumberger. On the other hand, Schlumberger will contribute Framo, Surveillance, Flow Assurance and Power and Controls businesses. Schlumberger and Cameron have a respective 60% and 40% stake in the joint venture. Cameron, the operator of the venture, will be accountable for financial reporting purposes.  Schlumberger’s interest in the JV will be recorded by Cameron in its financial statements as minority interest. OneSubsea is expected to concentrate on research and engineering investment along with merging ongoing complementary projects at both parent companies. The joint venture created is advantageously positioned to offer comprehensive subsea production systems as well as assist their clients to improve yield and recovery from their subsea developments. The transaction is subject to regulatory consent as well as other customary closing conditions. Both Schlumberger and Cameron carry Zacks #3 Ranks (short-term Hold rating). Longer term, we maintain our Neutral recommendation on both the companies.  , 64259\u003dCopyright © 2015 Zacks Investment Research, 64320\u003dAt the center of everything we do is a strong commitment to independent research and sharing its profitable discoveries with investors. This dedication to giving investors a trading advantage led to the creation of our proven Zacks Rank stock-rating system. Since 1986 it has nearly tripled the S\u0026P 500 with an average gain of +26% per year. These returns cover a period from 1986-2011 and were examined and attested by Baker Tilly, an independent accounting firm.}","lastModified":"Mon, 03 Aug 2015 22:55:26 -0500","textBeforeTable":"Income Momentum Value Growth Zacks #1 Rank Top Movers for Aug 3, 2015 Zacks #1 Rank Top Movers Zacks #1 Rank Top Movers for 08/03/15 } } document.getElementById(\u0027score_val\u0027).className \u003d \u0027\u0027; document.getElementById(\u0027score_val\u0027).innerHTML \u003d \u0027\u0027; document.getElementById(\u0027tab_label\u0027).innerHTML \u003d tab_text; { else } document.getElementById(\u0027score_val\u0027).className \u003d \u0027scores_val\u0027; document.getElementById(\u0027score_val\u0027).innerHTML \u003d \u0027A\u0027; document.getElementById(\u0027tab_label\u0027).innerHTML \u003d tab_text+ \u0027 Score\u0027; { if(tab_text !\u003d \u0027income\u0027) document.getElementById(\u0027rank_text\u0027).innerHTML \u003d cat_uri; var cat_uri \u003d \u0027View All Zacks Rank #1 \u0027+tab_text+\u0027 Stocks\u0027; var cat_uri \u003d \u0027/stocks/buy-list/\u0027+tab_text; { function footer_text(tab_text)","textAfterTable":"Company Symbol Price %Chg NCI INC NCIT 11.81 +4.98% SKYWEST INC… SKYW 17.10 +3.26% ASSURANT IN… AIZ 76.33 +2.32% PCM INC PCMI 10.29 +2.18% TRIUMPH BAN… TBK 14.25 +1.35% Company Symbol Price %Chg AMAG PHARMA… AMAG 66.20 +3.60% AMEDISYS IN… AMED 44.88 +2.87% NORDIC AMER… NAT 15.23 +1.40% COTT CORP Q… COT 11.30 +0.53%","hasKeyColumn":true,"keyColumnIndex":1,"headerRowIndex":0}