{"relation":[["Height:","Weight:","Year:","Hometown:","Position:","Previous School:"],["5-11","215","So.","Glendale, Ariz.","LB","O\u0027Connor HS"]],"pageTitle":"","title":"","url":"http://athletics.svu.edu/sports/fball/2012-13/bios/robbins_robbie_707x?dec\u003d/printer-decorator\u0026view\u003dgamelog\u0026pos\u003dkr","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"ENTITY","tableNum":0,"s3Link":"common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988312.76/warc/CC-MAIN-20150728002308-00321-ip-10-236-191-2.ec2.internal.warc.gz","recordEndOffset":18911575,"recordOffset":18895604,"tableOrientation":"VERTICAL","textBeforeTable":"Robert Robbins 2 2 Related Bios Jake Palmer Chris Harper Matt Gregory Cameron Williams Mitch Stevenson Michael Kilstrom Colter Evans Brenton Estorffe Bruce Eisenhauer Tyler Groves Dewayne Beamon Juwan Owens Presley Gamble Ronta Clark Justin Nikolaus Ethan Condiff Will Braddy Cooper Jenkins Jacob Evans Jerry Washington Jamal Coates Robert Williams Steven Andreasen David Winslow Frank Taitano Addin Soto Jamie Cain Jordan Lee Nikko Smith Oran Kobobel Alex Berthelson Michael Goering Walton Branscome Jake Wyckoff Tod Workman Andy Jones Kyle Leslie Matt Strickland Dustin Via Dakoda Winsor Caleb Fredricksen Xavier Fernandez Dylan Hall Devin Cupp Luke Herndon Isaac Lewis Michael Beck Stephen Jensen Tyler Mysyk Jace Weaver Zackary Smith Robert Spencer Braden Petersen Connor Wolfe Tyler Condiff Jonathan Curtis T.J. Moyer Hayden Means Michael Greer Jacob Lee Jake Behan Tyler Mattox Andrew Dax Hunter Eisenhauer Brett Murray Stockton Hiatt Jeff Waldron Juel Petersen Sione Tukuafu Jarron Johnson Tanner Greer","textAfterTable":"gp 11 tk 100 sac 0.5 int 1 ffum - Player Profile Game Log Career Stats Split Stats Recent Games Oct 5 vs. Apprentice W, 20-14 Oct 13 at Brevard L, 59-24 Oct 20 Concordia-Selma L, 20-14 Oct 27 at Alfred State W, 21-6 Nov 3 Webber Int\u0027l W, 27-6 Nov 10 at Edward Waters W, 17-10 Statistics category Overall Conf Solo tackles 44 20 Assists 56 24","hasKeyColumn":false,"keyColumnIndex":-1,"headerRowIndex":0}