{"relation":[["Bedrooms:","Bathrooms:","Sleeps:","Type:"],["2","1","6","Condo"]],"pageTitle":"Las Vegas Apartment Rentals | VacationHomeRentals: Browse 98 Vacation Rentals in Las Vegas, NV","title":"","url":"http://www.vacationhomerentals.com/Nevada/Las-Vegas-Territory/Las-Vegas-vacation-rentals/g1530/","hasHeader":false,"headerPosition":"NONE","tableType":"ENTITY","tableNum":10,"s3Link":"common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042991019.80/warc/CC-MAIN-20150728002311-00090-ip-10-236-191-2.ec2.internal.warc.gz","recordEndOffset":803071631,"recordOffset":802992538,"tableOrientation":"HORIZONTAL","TableContextTimeStampAfterTable":"{89328\u003dWITH OUR SELECTION AS ONE OF THE WORLD\u0027S TOP VACATION RENTALS FOR 2013 YOU CAN BE ASSURED THIS HOUSE IS WELL MAINTAINED, BEAUTIFULLY FURNISHED, FULLY SUPPLIED AND SPARKLING CLEAN. We are also proud to be a member of the Vegas Vacation Rentals Association. Relax and unwind in..., 302594\u003d2 Bedrooms, 2 baths, 1205 square feet or 112 square meters luxury townhome in peaceful, gated, suburban community. Fully furnished, all inclusive, turnkey, all utilities included including Central Air Conditioning , Electricity, Water, Advanced Cox Contour Cable TV (240+..., 535906\u003d5 bedroom / 3 bathroom home build in 2005. Every room has a television. All furniture and beds are only a year old. Spa and pool with temperature control settings to allow for year round swimming. Office is available, high speed internet, Sunroom with a sofa sleeper if needed. See..., 197907\u003dWITH OUR SELECTION AS ONE OF THE WORLD\u0027S TOP VACATION RENTALS FOR 2013 YOU CAN BE ASSURED THIS HOUSE IS WELL MAINTAINED, BEAUTIFULLY FURNISHED, FULLY SUPPLIED AND SPARKLING CLEAN - We are also proud to be a member of the Vegas Vacation Rentals Association. This exceptional ..., 49687\u003dThis home is 1500 sq. ft. with a heated pool and spa, pool table, wifi, cable, large screen tvs, and located 2 miles from the Las Vegas Strip......}","textBeforeTable":"Close x See all","textAfterTable":"Per night: $874 - $1,999 Per week: $5,799 - $9,999 Pets allowed: No Internet: Yes Over 200 reviews on our main 777rentals site. Inquire and we will send you a link to them and our main site. Wow - what a house. Spectacular 7 Bedroom Compound (5 Bedrooms in the main house and 2 Bedrooms in the Casita. The Casita alone has 2 Bedrooms, 2 Baths, Living Room,... See more Close x Absolutely Pleased “ Excellent ” September 19, 2013 The attentiveness given through the entire process is very detailed. From your payments all the way through any questions it concerns that arise, they\u0027re here to help and guide you to make it an even easier experience. During our stay we did not encounter any issues. The home is kept up to date. Clean, smells good, enough of just everything for 16 people. Four wonderful spacious rooms in the second floor with and intriguing entrance bedroom. The backyard was filled with excitement, from a clean pool and well maintained jacuzzi to a basketball court and grill. (Maybe the grill needs some maintenance with the","hasKeyColumn":false,"keyColumnIndex":-1,"headerRowIndex":-1}