{"relation":[["Updated:","Created:","Downloads:","Favorites:","MD5:"],["01-10-08 06:49 PM","unknown","492,643","805",""]],"pageTitle":"Bongos2 : Outdated Mods : World of Warcraft AddOns","title":"","url":"http://www.wowinterface.com/downloads/fileinfo.php?id\u003d4744\u0026so\u003d\u0026page\u003d36","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"ENTITY","tableNum":4,"s3Link":"common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988312.76/warc/CC-MAIN-20150728002308-00321-ip-10-236-191-2.ec2.internal.warc.gz","recordEndOffset":838941015,"recordOffset":838915626,"tableOrientation":"VERTICAL","textBeforeTable":"View 3 Screenshots File Info Pictures Features Bugs Portal Install Help Add Favorite Updated: 01-10-08 06:49 PM Download (93 Kb) Comments (1,302) Other Files Addon Info. }); return false; $(\"#announcement_popup\").fadeOut(\"slow\"); $.cookie(\u0027minionbeta\u0027, \u0027true\u0027, { expires: 999 }); $(\"a#closeit\").click(function() { if(!$.cookie(\u0027minionbeta\u0027)) $(\"#announcement_popup\").fadeIn(\"slow\");","textAfterTable":"Bongos2  Version: 1.10.1 by: Tuller [ More] I have written a new action bar addon, called Dominos, and am no longer supporting this one. Please feel free to try it out, along with Trinity Bars, and Bartender 3 Bongos is an action bar replacement designed to be both low memory, and easy to setup. It is not as feature rich as other bar mods, but should include the features most commonly used. Version History A Brief Guide Included Addons Bongos2: The core addon. Bongos2 ActionBar: Breaks up the main action bar into movable parts Bongos2 Stats: A display for latency, framerate, and memory usage Bongos2 RollBar: Makes the frame for rolling on items movable Bongos2 CastBar: A movable casting bar, with the ability to show cast time Bongos2 XP: A movable experience bar Bongos2 MapBar: A movable mapbar Bongos2 Options: A dynamically loaded options menu for Bongos Features Every Bongos bar can be moved, hidden, and have its scale and opacity altered Sticky bars - Each bar can be anchored to any other bar 120 action buttons, which can be setup in any number of bars Both macro and key binding text on action buttons","hasKeyColumn":true,"keyColumnIndex":1,"headerRowIndex":0}