{"relation":[["Zacks Rank","1","2","3","4","5","S\u0026P"],["Definition","Strong Buy","Buy","Hold","Sell","Strong Sell","500"],["Annualized Return","26.65%","18.84%","10.45%","4.76%","2.56%","10.28%"]],"pageTitle":"TDW: TIDEWATER INC Stock Quote \u0026 Analysis - Zacks.com","title":"","url":"http://www.zacks.com/stock/quote/TDW","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"RELATION","tableNum":2,"s3Link":"common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989043.35/warc/CC-MAIN-20150728002309-00122-ip-10-236-191-2.ec2.internal.warc.gz","recordEndOffset":854485175,"recordOffset":854459358,"tableOrientation":"HORIZONTAL","TableContextTimeStampBeforeTable":"{5772\u003dUpdated Jul 31, 2015 04:06 PM ET}","TableContextTimeStampAfterTable":"{34093\u003dAt the center of everything we do is a strong commitment to independent research and sharing its profitable discoveries with investors. This dedication to giving investors a trading advantage led to the creation of our proven Zacks Rank stock-rating system. Since 1986 it has nearly tripled the S\u0026P 500 with an average gain of +26% per year. These returns cover a period from 1986-2011 and were examined and attested by Baker Tilly, an independent accounting firm., 34032\u003dCopyright © 2015 Zacks Investment Research}","lastModified":"Sun, 02 Aug 2015 07:28:21 -0500","textBeforeTable":"This is our short term rating system that serves as a timeliness indicator for stocks over the next 1 to 3 months. How good is it? See rankings and related performance below. Zacks Style Scores Education - Learn more about the Zacks Style Scores As an investor, you want to buy stocks with the highest probability of success. That means you want to buy stocks with a Zacks Rank #1 or #2, Strong Buy or Buy, which also has a Score of an A or a B in your personal trading style. Within each Score, stocks are graded into five groups: A, B, C, D and F. As you might remember from your school days, an A is better than a B; a B is better than a C; a C is better than a D; and a D is better than an F. A Momentum Score A Value Score A Growth Score The three scores are based on the trading styles of Growth, Value, and Momentum. The Style Scores are a complementary set of indicators to use alongside the Zacks Rank. It allows the user to better focus on the stocks that are the best fit for his or her personal trading style. Zacks","textAfterTable":"Zacks Rank Education - Learn about the Zacks Rank Zacks Rank Home - Zacks Rank resources in one place Zacks Premium - The way to access to the Zacks Rank Quote Overview Stock Activity Open 19.74 Day Low 19.23 Day High 20.07 52 Wk Low 17.63 52 Wk High 50.99 Avg. Volume 1,413,324 Market Cap 917.23 M Dividend 1.00 ( 5.12%) Beta 1.64 Key Earnings","hasKeyColumn":true,"keyColumnIndex":1,"headerRowIndex":0}