{"relation":[["Horse","Colour Vision (FR)","High Jinx (IRE)","Molly Malone (FR)"],["Trainer","BIN SUROOR SAEED","FANSHAWE JAMES","DELZANGLES MIKEL"],["Breeder / Owner","GODOLPHIN CAPRICORN STUD SA","MR \u0026 MRS W J WILLIAMS HARAS DE LA PERELLE","DIETER BURKLE DIETER BURKLE"]],"pageTitle":"Longines Prix de l\u0027Opera at LONGCHAMP on Oct 7, 2012 | Race Preview | BloodHorse.com","title":"","url":"http://www.bloodhorse.com/horse-racing/race/FR/LCH/2012/10/7/8/longines-prix-de-lopera","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"RELATION","tableNum":0,"s3Link":"common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989790.89/warc/CC-MAIN-20150728002309-00271-ip-10-236-191-2.ec2.internal.warc.gz","recordEndOffset":323071643,"recordOffset":323045588,"tableOrientation":"HORIZONTAL","TableContextTimeStampBeforeTable":"{248\u003dFame And Glory will attempt to emulate his former Ballydoyle stablemate Yeats when he bids for a repeat victory in the $542,500 Ascot Gold Cup (Eng-I) at Royal Ascot June 21., 8029\u003dEstimate led in the final furlong of the Gold Cup (Eng-I) June 20 at Royal Ascot and gamely turned back a strong challenge to narrowly prevail in the 2 1/2-mile marathon for owner Queen Elizabeth II., 4762\u003dExcelebration, the world\u0027s second-best miler behind Frankel, tops a field of eight set for the QIPCO Queen Elizabeth II Stakes (Eng-I) on Oct. 20 at Ascot., 3951\u003dMolly Malone, always in striking position for jockey Umberto Rispoli, closed with a rush to win the marathon Qatar Prix du Cadran (Fr-I) to conclude the Qatar Prix de l\u0027Arc de Triomphe program at Longchamp Oct. 7., 7187\u003dThe Gold Cup (Eng-I) is Ascot\u0027s oldest surviving race and attracted 18 entrants for this year\u0027s renewal June 20 at the Royal meeting, including previous winners Colour Vision and Rite of Passage., 5990\u003dCeremony participants and an invited audience of 300 celebrated the racing career of Frankel, who joins Ouija Board (2004 and 2006) as the only two-time Cartier Horse of the Year winner., 1121\u003dColour Vision rallied under a strong drive from jockey Frankie Dettori and was able to hold off stablemate Opinion Poll to win the $542,500 Ascot Gold Cup (Eng-I) by a half-length at Royal Ascot June 21.}","textBeforeTable":"Fame And Glory will attempt to emulate his former Ballydoyle stablemate Yeats when he bids for a repeat victory in the $542,500 Ascot Gold Cup (Eng-I) at Royal Ascot June 21. Racing, International June 20, 2012 By Mary Schweitzer Fame And Glory Bids for Ascot Gold Cup Repeat Colour Vision rallied under a strong drive from jockey Frankie Dettori and was able to hold off stablemate Opinion Poll to win the $542,500 Ascot Gold Cup (Eng-I) by a half-length at Royal Ascot June 21. Racing, International June 21, 2012 Dettori Rallies Colour Vision to Gold Cup Win Comments from Frankie Dettori after winning the Ascot Gold Cup aboard Colour Vision. watch video International June 21, 2012 Royal Ascot - Frankie Dettori View the races of Royal Ascot. view slideshow International June","textAfterTable":"More Race Results At this Track Race Date JUDDMONTE GRAND PRIX DE PARIS (FR-I) 7/14 PRIX MAURICE DE NIEUIL (FR-II) 7/14 PRIX ROLAND DE CHAMBURE 7/14 PRIX DE THIBERVILLE 7/14 View All Race Results Upcoming Stakes Entries Race Track Date Manitoba Derby ASD 8/3 British Columbia Cup Dogwood H. HST 8/3 British Columbia Cup Nursery S. HST 8/3 Pegasus Distaff H. HST 8/3 British Columbia Cup Debutante S. HST 8/3 View All Stakes Entries News Sections Latest News Racing Breeding Sales International Horse Health Handicapping TOBA Triple Crown Breeders\u0027","hasKeyColumn":true,"keyColumnIndex":1,"headerRowIndex":0}