{"relation":[["Guyyaa","Mar 29","Apr 4","Apr 4-5","Apr 11","Apr 11","Apr 12","Apr 18-19"],["Maal","Outdoor BBQ and Fund Calanqoo Soccer Team of Arizona; Time: 3:00PM","Folle Entertainment Presents Spring Concert - Live in DC; Time: 9:00PM - 2:00AM, 16+ to Party","Yaadannoo Goototaa; Sagantaan Bashannanaa, Sanbata -Sa\u0027aa 8:00WB irraa eegala; Walagahii Hawaasaa Dilbata - Sa\u0027aa 2:00 PM irraa eegala","International Qeerroo Suupport Group (IQSG)/Dhaabbata Deeggarsa Eeerroo Idila Addunyaa, Sa’a: 5:00PM EST","Waamicha Kabajaa Guyyaa Goototaa Oromoo Magaalaa Torontoo, Sa\u0027aa 2:00 WB","Waamicha Guyya Goototaa kan bara 2015, Viiktooriyaa, Awustraliyaa; Sa\u0027aa 2:00 WB (PM)","WAAMICHA KORA XIQQOO ABO: KUTAA ISKANDANAAVIYAA BARA 2015: Ebla/April 18-19"],["Link","Place: 2605 North 15th Avenue Phoenix AZ, and Encantto Blvd","Location: 1000 U Street, NW, Washington, DC 20001","Bakki: Temple Community Association, 167 Temple Green Road, NE, T1Y6G3 Calgary, AB","Bakka: Washington Ethical Society, 7750 16th St. NW, Washington, DC 20012","Bakki: Waltajii Hawaasa Oromoo Torontoo, 94A Kenhar Drive Drive North York, Ontario","Guyyaa Goototaa (2015) - in Youtube Video","Bakka: MAGAALAA OSLOOTTTI (address tbd)"]],"pageTitle":"2012 September 12 - Ayyaantuu News","title":"","url":"http://ayyaantuu.com/2012/09/12/","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"RELATION","tableNum":2,"s3Link":"common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992543.60/warc/CC-MAIN-20150728002312-00148-ip-10-236-191-2.ec2.internal.warc.gz","recordEndOffset":22107303,"recordOffset":22084501,"tableOrientation":"HORIZONTAL","TableContextTimeStampBeforeTable":"{7261\u003dABC News, September 12, 2012, 6033\u003d1 comment - What do you think? Posted by Falmataa - 12/09/2012 at 8:40 am, 2578\u003dDuring the trial of Johan Persson and Martin Schibbye autumn 2011 showed prosecutor videos that he meant clearly proven Swedes crimes. Even then questioned a video sequence and the prosecutor was forced to admit that the sound of gunfire was applied retrospectively. But the prosecutor insisted that the films showed the arrest of one authentic way. Read more…, 9370\u003dSeptember 12, 2012, 8437\u003d2 comments - What do you think? Posted by admin - 12/09/2012 at 1:59 pm, 1846\u003dBe the first to comment - What do you think? Posted by admin - 12/09/2012 at 12:58 am, 3486\u003dSeptember 12, 2012  | Language in the video is Swedish, 4593\u003dBe the first to comment - What do you think? Posted by admin - 12/09/2012 at 12:58 am}","textBeforeTable":"Free Bekele Gerba + over 40,000 Political Prisoners in Ethiopia Three books in One (Oromo-Oromo, Oromo-English and English-Oromo) Dictionary - By Ibsaa Guutamaa SPECIAL OROMO DICTIONARY ~~~~~~~~~~~~~~~~~~~~~~~~ ~~~ --\u003e widebar 125 sidebar.php ~~~ --\u003e Widget Area: [All Content] Below End of common.php Categories: Ethiopia   Tags: Be the first to comment - What do you think? Posted by admin - 12/09/2012 at 12:58 am ~~~ --\u003e Individual Post Details ~~~ --\u003e Widget Area: [Content Item] Below","textAfterTable":"Reach Oromo Voice Radio by telephone 1. To listen to Oromo Voice Radio Call: +1 716-748-0384 America +1 61386720116 Australia + 492219888089 Germany + 27878250192 South Africa 2. To leave Voicemail Message, Call: +1 206-309-3148 Support Madda Walaabuu Media Foundation MWMF Membership form  (MS Word 2007 and later) or Download Form (MS Word 1997-2003) Please fill in one of the above forms and send it to info@oromovoice.org Bank Accounts: Madda Walaabuu Media Foundation USA Wells Fargo Bank Account Number: 6691081936 Routing number: 121000248 Australia \u0026 Newzealand Commonwealth bank Madda Walaabuu Media Foundation Inc. Account Number: 063144 10499424 Other Countries International Wells Fargo Bank Account Number: 6691081936 SWIFT code WFBIUS6S","hasKeyColumn":true,"keyColumnIndex":0,"headerRowIndex":0}