{"relation":[["Categories","Campus Safety","Greek Life","Clubs and Activities","Share any unusual traditions or locations on campus","Bang for the buck","What to do for fun","Food and Dining","Dorm Life","Academic Rigor","Tips for prospective students","In three sentences"],["Comments","Online classes","none","none","Online classes","I think you get a lot for your buck. The classes are very informative and the instructors are very helpful.","I like to talk to other students to get an idea of what they experience from attending the school. I also love fishing and reading.","Online classes.","I am taking classes online so I have not experience dorm life.","The academics are great there are many to choose from.","Do your research on the price for classes and stay focus when starting class.","The classes very informative and the instructors gives great feedback. You can log on to your classes doing any time of the day or night. The financial advisers help in making sure your classes and funds are in order."]],"pageTitle":"University of Phoenix Reviews: Student Reviews and Ratings | Cappex","title":"","url":"https://www.cappex.com/colleges/University-of-Phoenix/reviews?_escaped_fragment_\u003d/show/21113","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"RELATION","tableNum":265,"s3Link":"common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988310.3/warc/CC-MAIN-20150728002308-00142-ip-10-236-191-2.ec2.internal.warc.gz","recordEndOffset":894589547,"recordOffset":894428366,"tableOrientation":"HORIZONTAL","TableContextTimeStampBeforeTable":"{268\u003d93 out of 95 people found this review useful. 2 people found this inaccurate. 1 of 1487}","TableContextTimeStampAfterTable":"{829703\u003d230 of 1487, 387048\u003d1 out of 1 people found this review useful. 106 of 1487, 631785\u003d0 out of 1 people found this review useful. 175 of 1487, 1071136\u003d297 of 1487, 787168\u003d220 of 1487, 794752\u003d222 of 1487, 360286\u003d1 out of 1 people found this review useful. 99 of 1487, 29180\u003d18 out of 19 people found this review useful. 8 of 1487, 516519\u003d0 out of 1 people found this review useful. 142 of 1487, 800726\u003d223 of 1487, 1036381\u003d287 of 1487, 1157336\u003d319 of 1487, 576975\u003d0 out of 1 people found this review useful. 160 of 1487, 943695\u003dI am an alumni of the University of Phoenix, and earned my Associate of Arts degree in Business Management June 2011. I have chosen to continue my education in the Bachelor\u0027s of Science program with an emphasize on Human Services Management. The academic, financial aid, and facility of University of Phoenix are outstanding, therefore I am very comfortable doing all my classes online., 1120424\u003d310 of 1487, 890017\u003d248 of 1487, 1149060\u003d316 of 1487, 3818\u003d47 out of 52 people found this review useful. 2 of 1487, 125797\u003d3 out of 4 people found this review useful. 37 of 1487, 734202\u003d0 out of 1 people found this review useful. 206 of 1487, 1020640\u003d283 of 1487, 465349\u003d0 out of 2 people found this review useful. 126 of 1487, 617210\u003d0 out of 1 people found this review useful. 171 of 1487, 1100299\u003d305 of 1487, 189854\u003d2 out of 3 people found this review useful. 55 of 1487, 571476\u003d0 out of 1 people found this review useful. 158 of 1487, 6541\u003d34 out of 36 people found this review useful. 1 person found this inaccurate. 3 of 1487, 640841\u003d178 of 1487, 865194\u003d240 of 1487, 398646\u003d1 out of 1 people found this review useful. 109 of 1487, 58332\u003d8 out of 9 people found this review useful. 16 of 1487, 757939\u003d0 out of 1 people found this review useful. 212 of 1487, 1028756\u003d285 of 1487, 297928\u003d1 out of 1 people found this review useful. 83 of 1487, 637976\u003d177 of 1487, 10472\u003d26 out of 27 people found this review useful. 4 of 1487, 47848\u003d9 out of 13 people found this review useful. 6 people found this inaccurate. 13 of 1487, 693501\u003d0 out of 1 people found this review useful. 194 of 1487, 563756\u003d0 out of 1 people found this review useful. 156 of 1487, 198243\u003d1 out of 2 people found this review useful. 58 of 1487, 1076043\u003d298 of 1487, 461977\u003d0 out of 2 people found this review useful. 124 of 1487, 148150\u003d3 out of 4 people found this review useful. 43 of 1487, 477219\u003d0 out of 1 people found this review useful. 131 of 1487, 21469\u003d21 out of 22 people found this review useful. 6 of 1487, 870531\u003d242 of 1487, 452975\u003d1 out of 1 people found this review useful. 120 of 1487, 555427\u003deach class is five weeks long, compared to 16 weeks at a traditional college or university. this means that homework is at a faster pace and assignments are due by the first day of class. classes are held on campus from 6:00 pm to 10:00 pm on week nights., 750369\u003d0 out of 1 people found this review useful. 210 of 1487, 761381\u003d213 of 1487, 222458\u003d1 out of 2 people found this review useful. 64 of 1487, 524488\u003d0 out of 1 people found this review useful. 144 of 1487, 32102\u003d16 out of 16 people found this review useful. 9 of 1487, 585719\u003d0 out of 1 people found this review useful. 162 of 1487, 1081422\u003d299 of 1487, 136456\u003d3 out of 4 people found this review useful. 40 of 1487, 475045\u003d0 out of 2 people found this review useful. 130 of 1487, 855127\u003d237 of 1487, 272589\u003d1 out of 1 people found this review useful. 77 of 1487, 798246\u003dThere is no dorm life that I am aware of. I did enjoy dorm life when I attended junior college back in 1992-4., 926418\u003d258 of 1487, 439324\u003d1 out of 1 people found this review useful. 117 of 1487, 171139\u003d2 out of 3 people found this review useful. 49 of 1487, 1103767\u003d306 of 1487, 944883\u003d262 of 1487, 904094\u003d252 of 1487, 98668\u003d3 out of 4 people found this review useful. 28 of 1487, 643157\u003d179 of 1487, 1096084\u003d303 of 1487, 767227\u003d215 of 1487, 497243\u003d0 out of 1 people found this review useful. 137 of 1487, 107880\u003d3 out of 4 people found this review useful. 31 of 1487, 54403\u003d8 out of 8 people found this review useful. 15 of 1487, 216632\u003d1 out of 2 people found this review useful. 63 of 1487, 82633\u003d5 out of 9 people found this review useful. 2 people found it offensive. 3 people found this inaccurate. 23 of 1487, 75340\u003d6 out of 7 people found this review useful. 21 of 1487, 447738\u003d1 out of 1 people found this review useful. 119 of 1487, 492349\u003d0 out of 1 people found this review useful. 136 of 1487, 72135\u003d6 out of 7 people found this review useful. 20 of 1487, 791467\u003d221 of 1487, 635008\u003d1 person found this inaccurate. 176 of 1487, 1057562\u003d293 of 1487, 227291\u003d1 out of 2 people found this review useful. 65 of 1487, 528696\u003d0 out of 1 people found this review useful. 146 of 1487, 116577\u003d3 out of 4 people found this review useful. 34 of 1487, 661365\u003d185 of 1487, 717007\u003d0 out of 1 people found this review useful. 201 of 1487, 1113054\u003d308 of 1487, 318643\u003d1 out of 1 people found this review useful. 88 of 1487, 839910\u003d233 of 1487, 286604\u003d1 out of 1 people found this review useful. 80 of 1487, 1170315\u003d322 of 1487, 179769\u003d2 out of 3 people found this review useful. 52 of 1487, 978274\u003d271 of 1487, 868303\u003d241 of 1487, 1046549\u003d290 of 1487, 823891\u003d228 of 1487, 168085\u003d2 out of 3 people found this review useful. 48 of 1487, 601787\u003d0 out of 1 people found this review useful. 167 of 1487, 486654\u003d0 out of 1 people found this review useful. 134 of 1487, 78805\u003d6 out of 6 people found this review useful. 22 of 1487, 682563\u003d0 out of 1 people found this review useful. 191 of 1487, 1038974\u003d288 of 1487, 380831\u003d1 out of 1 people found this review useful. 104 of 1487, 817967\u003d226 of 1487, 687393\u003d192 of 1487, 16901\u003d23 out of 23 people found this review useful. 5 of 1487, 251473\u003d1 out of 1 people found this review useful. 71 of 1487, 1010216\u003d279 of 1487, 443260\u003d1 out of 1 people found this review useful. 118 of 1487, 861776\u003d239 of 1487, 852083\u003d236 of 1487, 664163\u003d186 of 1487, 294889\u003d1 out of 1 people found this review useful. 82 of 1487, 982613\u003d272 of 1487, 192420\u003d2 out of 3 people found this review useful. 56 of 1487, 377668\u003d1 out of 1 people found this review useful. 103 of 1487, 244312\u003d1 out of 1 people found this review useful. 69 of 1487, 61529\u003d7 out of 7 people found this review useful. 17 of 1487, 510407\u003d0 out of 1 people found this review useful. 140 of 1487, 959823\u003d266 of 1487, 770457\u003d216 of 1487, 210357\u003d1 out of 2 people found this review useful. 62 of 1487, 96061\u003d3 out of 4 people found this review useful. 27 of 1487, 1167048\u003d321 of 1487, 301672\u003d1 out of 1 people found this review useful. 84 of 1487, 355580\u003d1 out of 1 people found this review useful. 98 of 1487, 373953\u003d1 out of 1 people found this review useful. 102 of 1487, 705441\u003d0 out of 1 people found this review useful. 198 of 1487, 1015147\u003d281 of 1487, 991837\u003d274 of 1487, 502142\u003d0 out of 1 people found this review useful. 138 of 1487, 531887\u003d0 out of 1 people found this review useful. 147 of 1487, 458422\u003d0 out of 2 people found this review useful. 122 of 1487, 101662\u003d3 out of 4 people found this review useful. 29 of 1487, 331391\u003d1 out of 1 people found this review useful. 92 of 1487, 113780\u003d3 out of 4 people found this review useful. 33 of 1487, 850497\u003d235 of 1487, 160003\u003d3 out of 3 people found this review useful. 46 of 1487, 799086\u003dKeep in contact with your academic and financial advisors and try to get at least $2000 in scholarships if you do not qualify for grants as the students loans often are pro-rated your last semester and you will be close to a full class short on tuition., 755005\u003d0 out of 1 people found this review useful. 211 of 1487, 736710\u003d0 out of 1 people found this review useful. 207 of 1487, 1066805\u003d296 of 1487, 1155231\u003d318 of 1487, 556903\u003d0 out of 1 people found this review useful. 154 of 1487, 153371\u003d3 out of 3 people found this review useful. 44 of 1487, 483409\u003d0 out of 1 people found this review useful. 133 of 1487, 341925\u003d1 out of 1 people found this review useful. 95 of 1487, 1139006\u003d314 of 1487, 537945\u003d0 out of 1 people found this review useful. 149 of 1487, 505959\u003d0 out of 1 people found this review useful. 139 of 1487, 480010\u003d0 out of 1 people found this review useful. 132 of 1487, 1161194\u003d320 of 1487, 1025309\u003d284 of 1487, 177404\u003d2 out of 3 people found this review useful. 51 of 1487, 323672\u003d1 out of 1 people found this review useful. 90 of 1487, 467150\u003d0 out of 2 people found this review useful. 127 of 1487, 934591\u003d260 of 1487, 652489\u003d1 person found this inaccurate. 183 of 1487, 591369\u003d0 out of 1 people found this review useful. 163 of 1487, 143431\u003d3 out of 3 people found this review useful. 42 of 1487, 365387\u003d1 out of 1 people found this review useful. 100 of 1487, 624375\u003d0 out of 1 people found this review useful. 173 of 1487, 628205\u003di rate it as a college that i would recommend to others if they wanted a school to go to! i love this school i have been enrolled since july and i love it., 469431\u003d0 out of 2 people found this review useful. 128 of 1487, 431928\u003d1 out of 1 people found this review useful. 116 of 1487, 122716\u003d3 out of 4 people found this review useful. 36 of 1487, 1146150\u003d315 of 1487, 1064380\u003d295 of 1487, 812927\u003dMy husband was attending a college in Colorado and although they claimed to provide a better everything, he shortly found out he was paying a lot more for a lot less. He transferred to the University of Phoenix (UOP) after two semesters, and he will not only finish his degree six months earlier, but he has learned so much more through UOP that he can take and apply in his industry on a day-to-day basis. In 2011 a huge study was done on private college costs, and UOP was rated as one of the top cheapest universities., 690239\u003d193 of 1487, 1108299\u003d307 of 1487, 174311\u003d2 out of 3 people found this review useful. 50 of 1487, 90587\u003d5 out of 6 people found this review useful. 25 of 1487, 604760\u003d1 person found this inaccurate. 168 of 1487, 596030\u003d0 out of 1 people found this review useful. 165 of 1487, 709412\u003d0 out of 1 people found this review useful. 199 of 1487, 1017005\u003d282 of 1487, 157100\u003d3 out of 3 people found this review useful. 45 of 1487, 997397\u003d275 of 1487, 1006328\u003d278 of 1487, 289597\u003d1 out of 1 people found this review useful. 81 of 1487, 895005\u003d249 of 1487, 44705\u003d11 out of 11 people found this review useful. 12 of 1487, 720283\u003d0 out of 1 people found this review useful. 202 of 1487, 938570\u003d261 of 1487, 207323\u003d1 out of 3 people found this review useful. 61 of 1487, 964896\u003d267 of 1487, 647284\u003d181 of 1487, 887848\u003d247 of 1487, 306904\u003d1 out of 1 people found this review useful. 85 of 1487, 132978\u003d3 out of 4 people found this review useful. 39 of 1487, 391440\u003d1 out of 1 people found this review useful. 107 of 1487, 37136\u003d14 out of 15 people found this review useful. 10 of 1487, 940767\u003dI like many other people who are in middle-age are focusing on improving their knowledge through education. I have been advocating for individuals with mental health issues since 1985, and would like to combine my Business Management and Human Services Management skills and education to better serve the community., 968252\u003d268 of 1487, 781055\u003dmake use of the many tools the university of phoenix offers you. these tools can help you learn how to write better, understand complex concepts, and grasp grammar and spelling rules easier. this is a great school for a student who has a busy schedule and desires to increase their education level., 255119\u003d1 out of 1 people found this review useful. 72 of 1487, 923282\u003d257 of 1487, 949477\u003d263 of 1487, 521114\u003d0 out of 1 people found this review useful. 143 of 1487, 620766\u003d0 out of 1 people found this review useful. 172 of 1487, 883384\u003d246 of 1487, 1087644\u003d301 of 1487, 678645\u003d0 out of 1 people found this review useful. 190 of 1487, 1011807\u003d280 of 1487, 1091429\u003d302 of 1487, 699515\u003d196 of 1487, 836129\u003d232 of 1487, 1049618\u003d291 of 1487, 649348\u003d182 of 1487, 857814\u003d238 of 1487, 1003476\u003d277 of 1487, 729517\u003d0 out of 1 people found this review useful. 205 of 1487, 281923\u003d1 out of 1 people found this review useful. 79 of 1487, 333984\u003d1 out of 1 people found this review useful. 93 of 1487, 396184\u003d1 out of 1 people found this review useful. 108 of 1487, 265144\u003d1 out of 1 people found this review useful. 75 of 1487, 314439\u003d1 out of 1 people found this review useful. 87 of 1487, 914260\u003d254 of 1487, 975935\u003d270 of 1487, 1133573\u003d313 of 1487, 1043155\u003d289 of 1487, 898001\u003d250 of 1487, 421134\u003d1 out of 1 people found this review useful. 113 of 1487, 973230\u003d269 of 1487, 350213\u003d1 out of 1 people found this review useful. 97 of 1487, 820931\u003d227 of 1487, 51324\u003d9 out of 9 people found this review useful. 14 of 1487, 40994\u003d12 out of 12 people found this review useful. 11 of 1487, 68086\u003d6 out of 6 people found this review useful. 19 of 1487, 1116881\u003d309 of 1487, 880720\u003d245 of 1487, 94031\u003d4 out of 5 people found this review useful. 26 of 1487, 415779\u003d1 out of 1 people found this review useful. 112 of 1487, 513528\u003d0 out of 1 people found this review useful. 141 of 1487, 916871\u003d255 of 1487, 195347\u003d1 out of 2 people found this review useful. 57 of 1487, 86757\u003d5 out of 6 people found this review useful. 24 of 1487, 427103\u003d1 out of 1 people found this review useful. 115 of 1487, 1001342\u003d276 of 1487, 110870\u003d3 out of 4 people found this review useful. 32 of 1487, 383952\u003d1 out of 2 people found this review useful. 105 of 1487, 230645\u003d1 out of 2 people found this review useful. 66 of 1487, 805191\u003d224 of 1487, 139764\u003d3 out of 4 people found this review useful. 41 of 1487, 574112\u003d0 out of 1 people found this review useful. 159 of 1487, 1129765\u003d312 of 1487, 80460\u003dI have been out of the school setting for may years. After I lost my husband in 2006 in a work-related accident I decided to try and start over where I had left off . I decided I would do something for me this time and get my degrees in Medical Administration something I had dreamed of for many years., 777558\u003d218 of 1487, 774556\u003d217 of 1487, 105227\u003d3 out of 4 people found this review useful. 30 of 1487, 552756\u003d0 out of 1 people found this review useful. 153 of 1487, 263143\u003d1 out of 1 people found this review useful. 74 of 1487, 746460\u003d209 of 1487, 267931\u003d1 out of 1 people found this review useful. 76 of 1487, 1033868\u003d286 of 1487, 248478\u003d1 out of 1 people found this review useful. 70 of 1487, 726636\u003d0 out of 1 people found this review useful. 204 of 1487, 233052\u003d1 out of 2 people found this review useful. 67 of 1487, 629159\u003d0 out of 1 people found this review useful. 174 of 1487, 695217\u003d195 of 1487, 833969\u003d231 of 1487, 900561\u003d251 of 1487, 951311\u003d264 of 1487, 276501\u003d1 out of 1 people found this review useful. 78 of 1487, 655645\u003d0 out of 1 people found this review useful. 184 of 1487, 526757\u003d0 out of 1 people found this review useful. 145 of 1487, 186194\u003d2 out of 3 people found this review useful. 54 of 1487, 845878\u003d234 of 1487, 345377\u003d1 out of 1 people found this review useful. 96 of 1487, 741246\u003d0 out of 1 people found this review useful. 208 of 1487, 1054152\u003d292 of 1487, 200555\u003d1 out of 2 people found this review useful. 59 of 1487, 593866\u003d0 out of 1 people found this review useful. 164 of 1487, 423039\u003d1 out of 1 people found this review useful. 114 of 1487, 321105\u003d1 out of 1 people found this review useful. 89 of 1487, 921722\u003d256 of 1487, 371231\u003d1 out of 1 people found this review useful. 101 of 1487, 668252\u003d187 of 1487, 546555\u003d0 out of 1 people found this review useful. 151 of 1487, 763432\u003d214 of 1487, 672681\u003d0 out of 1 people found this review useful. 188 of 1487, 1172293\u003d323 of 1487, 460190\u003d0 out of 2 people found this review useful. 123 of 1487, 164536\u003d2 out of 3 people found this review useful. 47 of 1487, 580950\u003d0 out of 1 people found this review useful. 161 of 1487, 989914\u003d273 of 1487, 311855\u003d1 out of 1 people found this review useful. 86 of 1487, 411485\u003d1 out of 1 people found this review useful. 111 of 1487, 549265\u003d0 out of 1 people found this review useful. 152 of 1487, 1124915\u003d311 of 1487, 456497\u003d0 out of 2 people found this review useful. 121 of 1487, 612461\u003d0 out of 1 people found this review useful. 170 of 1487, 119622\u003d3 out of 4 people found this review useful. 35 of 1487, 1152160\u003d317 of 1487, 1084698\u003d300 of 1487, 237759\u003d1 out of 1 people found this review useful. 68 of 1487, 675596\u003d0 out of 1 people found this review useful. 189 of 1487, 826860\u003d229 of 1487, 782720\u003d219 of 1487, 566887\u003d0 out of 1 people found this review useful. 157 of 1487, 542635\u003d0 out of 1 people found this review useful. 150 of 1487, 258876\u003d1 out of 1 people found this review useful. 73 of 1487, 325376\u003d1 out of 1 people found this review useful. 91 of 1487, 599925\u003d0 out of 1 people found this review useful. 166 of 1487, 339205\u003d1 out of 1 people found this review useful. 94 of 1487, 25387\u003d20 out of 21 people found this review useful. 7 of 1487, 724870\u003d0 out of 1 people found this review useful. 203 of 1487, 872617\u003d243 of 1487, 909507\u003d253 of 1487, 929201\u003d259 of 1487, 955180\u003d265 of 1487, 65012\u003d6 out of 7 people found this review useful. 18 of 1487, 534942\u003d0 out of 1 people found this review useful. 148 of 1487, 129428\u003d3 out of 4 people found this review useful. 38 of 1487, 609599\u003d1 person found this inaccurate. 169 of 1487, 202397\u003d1 out of 2 people found this review useful. 60 of 1487, 1062345\u003d294 of 1487, 560772\u003d0 out of 1 people found this review useful. 155 of 1487, 701804\u003d197 of 1487, 402413\u003d1 out of 1 people found this review useful. 110 of 1487, 645045\u003d180 of 1487, 1098585\u003d304 of 1487, 811491\u003d225 of 1487, 463502\u003d0 out of 2 people found this review useful. 125 of 1487, 878012\u003d244 of 1487, 488971\u003d0 out of 1 people found this review useful. 135 of 1487, 471265\u003d0 out of 2 people found this review useful. 129 of 1487, 714766\u003d0 out of 1 people found this review useful. 200 of 1487, 183428\u003d2 out of 3 people found this review useful. 53 of 1487}","textBeforeTable":"07/17/2009 Reviewer is A current student here. 93 out of 95 people found this review useful. 2 people found this inaccurate. 1 of 1487 Shana\u0027\u0027e from Indianapolis, IN Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display(\u0027div-gpt-ad-1414696943434-2\u0027); }); cpx.googleAds.customAdData \u003d {}; cpx.googleAds \u003d {}; var cpx \u003d cpx || {}; } } } xmlhttp \u003d new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp \u003d new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state \u003d\u003d \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp \u003d new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp \u003d new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe(\u0027edge.remove\u0027, }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp \u003d new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp","textAfterTable":"Login to rate or flag the reviews Casandra from Warrensburg, MO 01/14/2011 Reviewer is Accepted here and planning to attend soon. Reviewer has not been to campus. 34 out of 36 people found this review useful. 1 person found this inaccurate. 3 of 1487 Categories Comments Great for these types of students The AXIA Online program for UOPX is a great program for students who have trouble getting to class on time, do not have reliable transportation, or who like to work with computers. This program was best for me because with the online program, I am able to log onto my classroom discussion and assignments on my own time. It is very helpful in keeping my daily priorities organized and in the correct order. Tips for prospective students It is helpful to stay motivated and have a stable back up plan. If online, make sure to always have access to the internet and classrooms. If on campus, it is good to be self-motivated and keep track of materials and schedules. Bang for the","hasKeyColumn":true,"keyColumnIndex":0,"headerRowIndex":0}