{"relation":[["Team","Western New Eng.","Roger Williams","Endicott","Gordon","U. of New England","Salve Regina","Nichols","Curry","Wentworth"],["Conf","8-0","7-1","6-2","5-3","4-4","3-5","2-6","1-7","0-8"],["All","16-3","12-5","11-6","11-8","7-10","7-9","5-11","6-11","4-9"],["GF","291","251","185","233","201","141","170","159","104"],["GA","211","153","159","215","210","194","245","211","194"]],"pageTitle":"Lacrosse Magazine","title":"","url":"https://laxmagazine.com/college_women/DIII/teams/anna_maria/index","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"RELATION","tableNum":2,"s3Link":"common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986423.95/warc/CC-MAIN-20150728002306-00070-ip-10-236-191-2.ec2.internal.warc.gz","recordEndOffset":884064219,"recordOffset":884042814,"tableOrientation":"HORIZONTAL","TableContextTimeStampAfterTable":"{9775\u003dMay 27, 2015 Nike/LM Division III Women\u0027s Top 20 No. 1 briefly early in the year, Cortland takes the top spot for the final rankings of the season after taking down Trinity in decisive fashion in the NCAA final., 39332\u003dMarch 7, 2015 Big Second Half Lifts Bowdoin Over Top-Ranked Amherst, 40185\u003dMarch 7, 2015 Trinity Outpaces Williams In 14-7 Win, 28209\u003dApril 25, 2015 WD3 Notes: Small College Shows Up in Tewaaraton LIsts, 55350\u003dOctober 10, 2014 30 in 30: Missy Foote\u0027s Farewell Tour at Middlebury A mainstay in DIII women\u0027s lacrosse for over three decades and with over 400 wins, Middlebury coach and Hall of Famer Missy Foote rides off into the sunset after this spring\u0027s season., 56683\u003dJune 23, 2014 Ness Named First Coast Guard Women\u0027s Coach, 21124\u003dMay 10, 2015 MIddlebury Dominates MIT, 19-9, 15550\u003dMay 17, 2015 Middlebury Advances To Final Four With 10-8 Victory Over York, 26286\u003dMay 2, 2015 Catholic Dominates Susquehanna To Win Landmark Conference Title, 26960\u003dMay 2, 2015 Gettysburg Dominates Haverford To Advance To CC Championship, 38246\u003dMarch 11, 2015 WD3 Notes: Brice Queener Leads Rhodes to Hot Start Brice Queener, a former Georgetown and MLL standout midfielder, is the latest in the long line of successful coaches in his family, coaching Rhodes to a 7-0 record thus far., 21385\u003dMay 10, 2015 Mount Union Overwhelms Albion, 18-0, 39078\u003dMarch 7, 2015 Bates Downs Wesleyan, 12-6, 9244\u003dJune 1, 2015 Early Top 10 for 2016 (WD3): Cortland Reloading? With a tremendous core of returning players from the program\u0027s first-ever NCAA champion, Cortland is going to be a tall order for the DIII women\u0027s championship hopefuls in 2016., 32055\u003dMarch 28, 2015 Late Run Lifts Middlebury Past Amherst, 9-5, 27924\u003dApril 29, 2015 Yates Anchors as W\u0026L Edges Lynchburg, 22236\u003dMay 10, 2015 TCNJ Advances With 10-7 Win Over St. John Fisher, 44027\u003dFebruary 24, 2015 No. 1 Salisbury Women Rally to Edge Stevenson in OT, 7676\u003dJune 5, 2015 Young Guns Anchor LM\u0027s DIII Women\u0027s All-Americans The top dogs in the women\u0027s DIII game are largely going to be back for another turn, as our starting lineup for the 2015 season earns its nod., 25996\u003dMay 2, 2015 Bowdoin Overwhelms Middlebury, Advances To NESCAC Final, 58349\u003dNo date WD3 Notes: Catholic Flying High After Salisbury Upset Handing Salisbury its first loss since 2013 rocketed Catholic up the charts to No. 5. How are the Cardinals prepping for their next step?, 22840\u003dMay 10, 2015 Washington And Lee Advances With 18-4 Win Over Sewanee, 17319\u003dMay 16, 2015 Franklin \u0026 Marshall Rolls Into Elite Eight With 17-8 Win Over Tufts, 12893\u003dMay 24, 2015 Gallery: Trinity Runs Past F\u0026M, Into NCAA Finals (WD3) An extended 9-0 run powered Trinity to the NCAA finals Sunday after a 10-4 win over Franklin \u0026 Marshall. Photos by Rich Barnes., 41818\u003dMarch 1, 2015 No. 11 Colby Takes Opening Win Over No. 2 Trinity, 8164\u003dJune 4, 2015 Double Repeats: Final Thoughts on the Small College Season What a pair of title repeats mandates in the small school ranks along with another look at the committee\u0027s efforts and the perils of Division I moving its championship date., 7082\u003dJune 6, 2015 Shot Clock “Renaissance”: Clarifications, Reactions and More With the proposed possession clock, women\u0027s lacrosse is following a trend all NCAA sports have - increase the pace of play. Why did the committee makes this change, among others? How have coaches responded?, 38775\u003dMarch 9, 2015 Four Teams Earn No. 1 Votes in IWLCA WD3 Poll, 12372\u003dMay 24, 2015 Gallery: Cortland Downs Middlebury; Into WD3 Final Cortland earned its first-ever NCAA finals trip with a win Saturday over Middlebury at PPL Park. Photos by Rich Barnes, 21957\u003dMay 10, 2015 Quick Start Helps York Down Union, 11-6, 62202\u003d\u0026copy2014 Copyright US Lacrosse, Inc. 113 West University Parkway | Baltimore, MD 21210 Telephone: 410.235.6882 | Fax: 410.366.6735 E-mail: | About LM | Contact, 22538\u003dMay 10, 2015 Trinity Advances With 16-6 Win Over St. Joseph\u0027s, 17661\u003dMay 16, 2015 Fredonia State Downs Washington \u0026 Lee, Advances To Quarterfinals, 31250\u003dApril 4, 2015 MIddlebury Holds Off Colby, 7-5, 39635\u003dMarch 7, 2015 Middlebury Thumps Connecticut College, 19-2, 32345\u003dMarch 28, 2015 Trinity Earns Eighth Straight Victory With 11-6 Win Over Bowdoin, 28518\u003dApril 23, 2015 Tewaaraton Names 25 Final Nominees for \u002715 Awards 25 men\u0027s and 25 women\u0027s players have been announced as nominees for the Tewaaraton Award, including returning winners Lyle Thompson and Taylor Cummings., 53032\u003dNovember 15, 2014 #BestOfLax: Women\u0027s Player: Finalist Breakdown Two top sophomores with Team USA connections, the newly minted all-time NCAA scoring leader, the (arguably) best goalie in the game and the DI leading goal-scorer... Make your pick!, 36965\u003dMarch 14, 2015 Middlebury Tops Wesleyan, 15-8, 58834\u003dNo date Gallery: St. Mary\u0027s Edges No. 19 Washington College (WD3) St. Mary\u0027s (Md.) recorded its first win over a Top 20 team since 2010 in edging Washington College on Saturday afternoon. Photos by Kevin P. Tucker, 51122\u003dDecember 2, 2014 Hamline (Minn.) to Add Women\u0027s Lacrosse for 2016 Hamline University in St. Paul, Minnesota has announced it will offer women\u0027s lacrosse as a varsity sport for the 2016 spring season., 20258\u003dMay 10, 2015 Fredonia State Drops Denison, Advances to Third Round, 5908\u003dJuly 16, 2015 NCAA Rules Oversight Panel Approves Possession Clock After discussing the proposals recommended by the NCAA rules committee on a conference call Wednesday, the NCAA playing rules oversight panel approved all 17 rules proposals, including the 90-second possession clock., 23135\u003dMay 9, 2015 Salisbury Dominates Stevenson in Oft-Delayed D3 Showdown Salisbury was delayed more than three hours after an accident on Maryland\u0027s Bay Bridge, but they showed little rust in rolling to the DIII quarterfinals with a win at Stevenson that ended after midnight Saturday., 26618\u003dMay 2, 2015 Franklin \u0026 Marshall Advances To CC Final With Win Over Washington, 37228\u003dMarch 14, 2015 Salisbury Downs York, 10-7, 19054\u003dMay 10, 2015 Augustana Advances with 19-13 Win Over Concordia, 55876\u003dOctober 2, 2014 30 in 30: Coaching Carousel Movement in Small College Major moves - like Adelphi\u0027s Rob Grella resigning shortly after taking Adelphi to the Women\u0027s DII title - littered the off-season in small college lacrosse., 13429\u003dMay 23, 2015 WD3 Semis: Cortland, Trinity Advance to Final Ashley Gentile scored five goals as Cortland reached its first NCAA final with a 19-12 win over Middlebury in what was the last game in Missy Foote\u0027s 35-year tenure as Panther coach. (Rich Barnes), 31515\u003dApril 2, 2015 WD3 Notes: Rhodes, Sewanee Battle for Supremacy in South Both the Lynx and Tigers are undefeated going into Friday\u0027s matchup, but the winner will likely determine SAA championship. Plus, No. 1 Trinity is holding its own atop the rankings., 33821\u003dMarch 19, 2015 I Am The Official Lax Girl Somewhere between Zimbabwe and Tennessee, in the span of 140 characters, an unlikely lacrosse icon came to life., 56363\u003dSeptember 23, 2014 Cortland Names Lickert-Orr Women\u0027s Lacrosse Head Coach, 37483\u003dMarch 14, 2015 St. John Fisher Overcomes Buffalo State, 14-9, 57777\u003dMay 30, 2014 WD3 Notes: Salisbury Still Finds Fuel From \u002712 Loss For the second straight year, Salisbury toppled Trinity in the NCAA finals. And they were still motivated by the year before that, when the Bantams bested the Gulls in the finals., 30988\u003dApril 5, 2015 Trinity Outruns Hamilton, 15-7, 40995\u003dMarch 6, 2015 Gallery: F\u0026M Downs Stevenson in Top 20 Battle (WD3) Eighth-ranked Franklin \u0026 Marshall downed No. 15 Stevenson 13-8 on Wednesday behind four goals from Kathryn Merrick. Photos by John Strohsacker., 10662\u003dMay 25, 2015 Gallery: Cortland Runs Past Trinity for First Title (WD3) First-time finalist Cortland wasted no time against the Trinity team that had eliminated it in three straight semifinals, jumping to an 8-2 lead at half and running away for its first ever NCAA DIII women\u0027s lacrosse championship. Photos by Rich Barnes., 39923\u003dMarch 7, 2015 Stevenson Tops Haverford, 14-6, 45323\u003dFebruary 19, 2015 #LMRanks DIII Women\u0027s Preview: No. 3 Middlebury It\u0027s the last hurrah for Hall of Fame coach Missy Foote. Can the Panthers send her off on a championship note?, 41498\u003dMarch 1, 2015 Catholic Stuns No. 1 Salisbury for First Loss Since \u002713, 21656\u003dMay 10, 2015 Pomona-Pitzer Earns First-Ever NCAA Win Over Occidental, 34810\u003dMarch 16, 2015 IWLCA DIII Poll: Franklin \u0026 Marshall Stands Alone, 51588\u003dDecember 1, 2014 Lacrosse Magazine\u0027s Best of Lacrosse 2014 The votes are in - here are your choices for the Best of Lacrosse in 2014!, 24275\u003dMay 9, 2015 FDU-Florham Downs Cabrini To Earn First NCAA Tournament Win, 18299\u003dMay 16, 2015 Trinity Cruises Past Pomona-Pitzer, 16-2, 18580\u003dMay 16, 2015 York Upsets Gettysburg to Earn First QF Berth A school-record 15th win came in OT against top seed Gettysburg as York earned its first-ever NCAA quarterfinal berth., 36713\u003dMarch 14, 2015 Messiah Edges TCNJ, 12-11, 57282\u003dJune 2, 2014 Early Top 10 for 2015 (WD3): Gulls Still Soaring? Can Salisbury make it three in a row in 2015? Cortland and Trinity still loom, but the Sea Gulls are the logical thought to be No. 1 at this point., 35617\u003dMarch 14, 2015 Bowdoin Tops Hamilton in OT, 8-7, 42116\u003dFebruary 28, 2015 Roanoke Women Forfeits Five Games for Hazing, 30475\u003dApril 9, 2015 WD3 Notes: Middlebury Stays Strong After Opening Day Loss Middlebury suffered a one-goal loss to open the season, but has been on a hot streak as of late with a 9-0 run. Plus Sewaane remains undefeated., 45783\u003dFebruary 18, 2015 #LMRanks DIII Women\u0027s Preview: No. 4 Cortland Their head coach is gone, and with her the DIII Attacker of the Year. But the last team to beat two-time defending champion Salisbury is still a force to be reckoned with., 37775\u003dMarch 14, 2015 Top-Ranked Cortland Handles No. 2 Gettysburg, 14-11 The Red Dragons earned a key non-conference road win, topping No. 2 Gettysburg in Pennsylvania on Saturday afternoon., 48653\u003dFebruary 4, 2015 #LMRanks DIII Women\u0027s Preview: Best Bet All-Americans Only three return from last spring\u0027s All-America selection for DIII women\u0027s, meaning a wide-open field awaits the best of 2015. Who do we project leading the way for their teams?, 54398\u003dOctober 21, 2014 30 in 30: Is Augustana DIII\u0027s Best in the Midwest? In just its fourth year, Augustana has made a case for already being the best program in the midwest, but faces new challenges with a new coach in 2015., 15875\u003dMay 17, 2015 Trinity Reaches Fourth Final Four In A Row With Win Over TCNJ, 14443\u003dMay 18, 2015 IWLCA Honors 48 as DIII All-America Selections The women\u0027s Division III All-America selections have been announced by the IWLCA, featuring 48 of the game\u0027s best., 29514\u003dApril 16, 2015 Gallery: Trinity Overcomes Early Deficit to Beat TCNJ (WD3) Down four goals early, top-ranked Trinity responded to rally past The College of New Jersey 15-8 on Wednesday evening. Photos by Kevin P. Tucker., 53538\u003dOctober 28, 2014 Concordia-Chicago To Add M\u0026W in 2016, 25449\u003dMay 4, 2015 D-III Women\u0027s Bracket Breakdown: No Guaranteed Path to PPL Cortland, Trinity, Gettysburg and Franklin \u0026 Marshall earned the top seeds in their sides of the bracket, but there\u0027s plenty of danger lurking for all in their path to championship weekend., 54886\u003dOctober 15, 2014 30 in 30: The Other Fall Ball For some athletes at Bowdoin, lacrosse isn\u0027t their only sport. Mettler Growney and Kelsey Gallagher, sophomores on Bowdoin’s field hockey and lacrosse teams, make it a point to continue a legacy., 29011\u003dApril 17, 2015 WD3 Notebook: Sweet Briar Rides Emotional Roller Coaster The Sweet Briar Vixens are playing this season as if it\u0027s their last, plus who will take the lead in the NESCAC and Centennial Conference?, 48145\u003dFebruary 5, 2015 Bethany Baer: DIII Women\u0027s Preseason Player of the Year She\u0027s knotted with her brother, having won two titles already in her collegiate career. Can she pull ahead by leading Salisbury to a third straight crown?, 15207\u003dMay 17, 2015 Franklin \u0026 Marshall Heads To Semifinals After Downing Fredonia, 16-9, 32677\u003dMarch 27, 2015 WD3 Notes: Salisbury Back in Form With Big Week Two-time defending Champion Salisbury stumbled out of the gate with two losses. They\u0027ve looked more like expected of late, topping the No. 1 team in back-to-back weeks., 42429\u003dFebruary 27, 2015 No. 7 TCNJ Survives Scare from FDU-Florham, 52477\u003dNovember 20, 2014 Middlebury Coach Foote Headlines IWLCA Honors Dinner Coaches from Division I, II and III all convened in Orlando, Fla., for their annual convention, which is highlighted by the awards banquet honoring coaches for their impact on the growth of the women\u0027s game., 47190\u003dFebruary 12, 2015 #LMRanks DIII Women\u0027s Preview: No. 9 Geneseo Making the NCAA\u0027s quarterfinal round for the first time a year ago, the Knights hope to build and grow with a young but talented lineup., 8690\u003dJune 4, 2015 Women’s Lacrosse Rules Committee Recommends Shot Clock If approved, the rule (a 90-second possession clock) would be effective in 2017 for Division I and 2018 for Divisions II and III. Plus updates to stick checks, alternating possessions and overtimes., 46755\u003dFebruary 14, 2015 #LMLive Gameday: Valentine\u0027s Lacrosse Central A killer doubleheader in Georgia headlines the Saturday action in lacrosse, as Duke and Denver face off, followed by Northwestern and Virginia., 49185\u003dFebruary 1, 2015 #LMRanks DIII Women\u0027s Preview: No. 20-11 Breakdown Plenty of danger lurks outside of the Top 10 in DIII women\u0027s lacrosse this spring. We kick off their portion of our #LMRanks preseason coverage with a look at the bottom half of the Nike/LM Top 20., 16190\u003dMay 17, 2015 #LMLive Gameday: Final Three Spots for Final Four Three DI bids to the DI final four remain, with Maryland-Northwestern women and Syracuse-JHU men battling at noon and Maryland-UNC men at 2:30 to determine whose season continues, along with the WD2 final, WD3 QFs and last MD2 and MD3 semis., 14006\u003dMay 23, 2015 #LMLive: DIII Women\u0027s Semifinals Live Cortland vs. Middlebury. Franklin \u0026 Marshall vs. Trinity. The finals spots for the DIII women\u0027s championship Sunday will be decided this afternoon at PPL Park., 44341\u003dFebruary 24, 2015 #LMRanks DIII Women\u0027s Preview: No. 8 Franklin \u0026 Marshall An underclassmen-heavy roster should be strong at the midfield, but can the Diplomats challenge for an NCAA crown?, 44819\u003dFebruary 20, 2015 #LMRanks DIII Women\u0027s Preview: No. 2 Trinity The Bantams have had a tremendous run of success, but with former coach Kate Livesay back at her alma mater Middlebury, how will they fare under new leadership?, 19357\u003dMay 10, 2015 Bowdoin Rolls Past Bridgewater State, 22-9, 19961\u003dMay 10, 2015 Franklin \u0026 Marshall Cruises Past Rhodes, 21-3, 33195\u003dMarch 22, 2015 Early Six-Goal Lead Pushes No. 13 Gulls past No. 1 Cortland St., 35122\u003dMarch 16, 2015 Top-Ranked Cortland Hands No. 12 Catholic First Loss Freshman Kristen Ohberg had a career-high six goal game as Cortland handed Catholic its first defeat of the year on the road Monday., 11301\u003dMay 24, 2015 Cortland Exorcises Final Four Demons With First Title Three times, Cortland\u0027s seniors had made it to the women\u0027s DIII final weekend, but lost to Trinity. On Sunday, the Red Dragons got the Bantams back, taking the school\u0027s first women\u0027s title with a 17-6 thrashing at PPL Park., 27602\u003dMay 1, 2015 WD3 Notes: Gettysburg Riding Hot Streak Into Postseason, 43583\u003dFebruary 24, 2015 #LMRanks DIII Women\u0027s Preview: No. 7 Gettysburg With a determined group of seniors, can the Bullets can back to the final four?, 43277\u003dFebruary 26, 2015 Molloy Becomes Arcadia\u0027s All-Time Leading Scorer, 16730\u003dMay 16, 2015 Big Second Half Sparks TCNJ Past Bowdoin, 36412\u003dMarch 14, 2015 Griffin Scores 5 To Lead Trinity Over Bates, 15-8, 42724\u003dFebruary 26, 2015 Tewaaraton Watchlist Features Five Returning Finalists Returning Tewaaraton winners Taylor Cummings and Lyle Thompson were among the 50 selected for the first watchlist for the annual award, announced in New York City Thursday evening., 53827\u003dOctober 28, 2014 30 in 30: Salisbury Builds With \"Nestor\u0027s Boot Camp\" The recent run of Salisbury\u0027s women is built upon one of the toughest fall programs around, and with coach Jim Nestor no longer coaching soccer, life hasn\u0027t gotten any easier for the Sea Gulls, or their spring opponents., 24599\u003dMay 9, 2015 MIT Cruises To 19-5 Victory Over Regis, 23988\u003dMay 9, 2015 Castleton Dominates Morrisville State, 19-10, 40455\u003dMarch 7, 2015 Washington \u0026 Lee Upsets Salisbury, 9-8, 33527\u003dMarch 21, 2015 Middlebury Earns 14-8 Road Victory At Bowdoin, 56975\u003dJune 20, 2014 Assistant Dissinger Promoted to Trinity Head Post, 20841\u003dMay 10, 2015 Hamilton Upsets Salisbury in Double OT, 10218\u003dMay 26, 2015 Highlight Reel: NCAA Championship Videos Five NCAA titles were captured over the Memorial Day weekend, with Denver and Maryland headlining as DI champions. NCAA.com has highlights from all the action., 25146\u003dMay 9, 2015 St. Joseph\u0027s Advances With 13-9 Win Over Keene State, 17975\u003dMay 16, 2015 Middlebury Defeats Hamilton, Advances To NCAA Quarterfinals, 17017\u003dMay 16, 2015 Cortland State Dominates Augustana, 21-2, In NCAA Third Round, 40740\u003dMarch 7, 2015 York Holds Off Ithaca, 9-7, 20546\u003dMay 10, 2015 Gettysburg Drops FDU-Florham In Second Round, 49737\u003dJanuary 4, 2015 Lifestyles: \"Out Front\" With CNN\u0027s Erin Burnett Engaging a national audience each week via her CNN show, Erin Burnett opens up about her work and lacrosse past as a member of Middlebury\u0027s heartbreaking 1996 team., 11869\u003dMay 24, 2015 #LMLive: Cortland-Trinity For the Women\u0027s DIII Crown Cortland is in its first-ever NCAA finals, while Trinity hopes to earn its second DIII women\u0027s title in its fourth straight championship appearance. Who will cut the nets?, 24881\u003dMay 9, 2015 Rhodes Knocks Off Meredith, 16-12, 34239\u003dMarch 18, 2015 DIII Women\u0027s Notes: Dragons Roaring Under New Coach It took a little while, but top-ranked Cortland finally began down it\u0027s path toward defending its SUNYAC title and trying to improve on last year\u0027s 22-1 season that ended with an NCAA semifinal loss to Trinity., 47669\u003dFebruary 11, 2015 #LMRanks DIII Women\u0027s Preview: No. 10 Williams Questions abound on the defensive end, but Williams should be able to score goals in 2015. Will that be enough in the always-tough NESCAC, 51933\u003dNovember 20, 2014 Best Of Lacrosse - Best Milestone Moment Breakdown Its a pretty tight race for the top milestone achievement of the year, with five worthy choices - Miles Thompson\u0027s record-breaking goal, Missy Foote\u0027s 400th win and the first ever co-Tewaaraton among them., 14910\u003dMay 17, 2015 Cortland State Holds Off Catholic, Advances To Final Four, 19642\u003dMay 10, 2015 Cortland State Advances With Dominant Win Over Castleton, 27286\u003dMay 2, 2015 Trinity Advances To NESCAC Semis With OT Win Over Tufts, 36142\u003dMarch 14, 2015 Cortland Defeats Gettysburg, 14-10, 50216\u003dDecember 21, 2014 Fan Vote: DIII Women\u0027s Preseason Player of Year Lacrosse Magazine has narrowed the field to five finalists. Now it\u0027s time to make your choice for NCAA Division III women\u0027s Preseason Player of the Year., 23706\u003dMay 9, 2015 Bridgewater State Downs St. Joseph\u0027s, 16-9, 6485\u003dJune 11, 2015 U.S. Women\u0027s Tryouts Preview: You Won’t Get Noticed for Speed Friday marks the first day of tryouts for the U.S. women\u0027s national team and coach Ricky Fried shares some insight into what he\u0027s looking for from the 108-player pool. Plus, a breakdown of players by position, college and graduation year., 46295\u003dFebruary 17, 2015 #LMRanks DIII Women\u0027s Preview: No. 5 Amherst With a small but notable class gone after last year\u0027s semifinal run, how will Amherst recover for 2015\u0027s NESCAC gauntlet?, 30019\u003dApril 15, 2015 Top-Ranked Trinity Dispatches No. 8 TCNJ Martha Griffin factored in on nearly half of Trinity\u0027s goals as the Bantams breezed past the Lions, 15-8 on Wednesday evening., 35885\u003dMarch 14, 2015 Colby Overcomes Tufts, 11-6, 50718\u003dDecember 12, 2014 Fan Vote: Your Preseason Player of the Year Picks? With the season inching closer, we look at the candidates for LM\u0027s Preseason Player of the Year honors across the divisions. Who gets your nod?}","textBeforeTable":"Wentworth Curry Nichols Salve Regina U. of New England Gordon Endicott Roger Williams Western New Eng. Commonwealth Coast Standings All times Eastern Links Time/Status Result Opponent Date 0-0 0-0 0-0 - .000 0-0 .000 0-0 Neutral Away Home Streak Pct. Conf. Pct. Overall Team Schedule Anna Maria Amcats }); }); $(this).toggleClass(\u0027active\u0027).next(\u0027ul\u0027).toggleClass(\u0027active\u0027); $(\u0027.secondary-nav \u003e h1\u0027).click(function() { $(function() { })(jQuery); }); }); $(\u0027.has-submenu.active\u0027).removeClass(\u0027active\u0027); $(document).on(\u0027click\u0027, function(e) { }); return false; $(this).parent().toggleClass(\u0027active\u0027); $(\u0027.has-submenu \u003e a\u0027, \u0027#nav\u0027).on(\u0027click\u0027, function() { }); return false; $(\u0027#nav\u0027).removeClass(\u0027active\u0027); $(\u0027#jump-to-nav\u0027).removeClass(\u0027active\u0027); $(\u0027#nav .close\u0027).click(function(e) { }); $(\u0027#nav\u0027).toggleClass(\u0027active\u0027); $(this).toggleClass(\u0027active\u0027); e.preventDefault(); $(\u0027#jump-to-nav\u0027).click(function(e)","textAfterTable":"headlines July 16, 2015 NCAA Rules Oversight Panel Approves Possession Clock After discussing the proposals recommended by the NCAA rules committee on a conference call Wednesday, the NCAA playing rules oversight panel approved all 17 rules proposals, including the 90-second possession clock. June 11, 2015 U.S. Women\u0027s Tryouts Preview: You Won’t Get Noticed for Speed Friday marks the first day of tryouts for the U.S. women\u0027s national team and coach Ricky Fried shares some insight into what he\u0027s looking for from the 108-player pool. Plus, a breakdown of players by position, college and graduation year. June 6, 2015 Shot Clock “Renaissance”: Clarifications, Reactions and More With the proposed possession clock, women\u0027s lacrosse is following a trend all NCAA sports have - increase the pace of play. Why did the committee makes this change, among others? How have coaches responded? June 5, 2015 Young Guns Anchor LM\u0027s DIII Women\u0027s All-Americans The top dogs in the women\u0027s DIII game are largely going to be back for another turn, as our starting lineup for the 2015 season earns its nod. June 4, 2015 Double Repeats: Final Thoughts on","hasKeyColumn":true,"keyColumnIndex":0,"headerRowIndex":0}