{"relation":[["GO ID","GO:0000287","GO:0002020","GO:0004672","GO:0004674","GO:0004713"],["Qualified GO term","magnesium ion binding","protease binding","protein kinase activity","protein serine/threonine kinase activity","protein tyrosine kinase activity"],["Evidence","IDA","TAS","","TAS",""],["PubMed IDs","14607334","24522549","--","24522549","--"]],"pageTitle":"PINK1 Gene - GeneCards | PINK1 Protein | PINK1 Antibody","title":"","url":"http://www.genecards.org/cgi-bin/carddisp.pl?gene\u003dPINK1\u0026ace\u003d368","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"RELATION","tableNum":0,"s3Link":"common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987662.63/warc/CC-MAIN-20150728002307-00272-ip-10-236-191-2.ec2.internal.warc.gz","recordEndOffset":96517395,"recordOffset":96439676,"tableOrientation":"HORIZONTAL","TableContextTimeStampBeforeTable":"{72556\u003dProtects against mitochondrial dysfunction during cellular stress by phosphorylating mitochondrial proteins. Involved in the clearance of damaged mitochondria via selective autophagy (mitophagy) by mediating activation and translocation of PARK2. Targets PARK2 to dysfunctional depolarized mitochondria through the phosphorylation of MFN2. Activates PARK2 in 2 steps: (1) by mediating phosphorylation at Ser-65 of PARK2 and (2) mediating phosphorylation of ubiquitin, converting PARK2 to its fully-active form (PubMed:24660806, PubMed:24751536, PubMed:24784582, PubMed:25527291)., 74833\u003dThis gene encodes a serine/threonine protein kinase that localizes to mitochondria. It is thought to protect cells from stress-induced mitochondrial dysfunction. Mutations in this gene cause one form of autosomal recessive early-onset Parkinson disease. [provided by RefSeq, Jul 2008]}","textBeforeTable":"Gene Ontology (GO) - Molecular Function for PINK1 Gene EC 2.7.11.1 4 Enzyme Numbers (IUBMB) for PINK1 Gene PINK1_HUMAN,Q9BXM7 UniProtKB/Swiss-Prot Function: Protects against mitochondrial dysfunction during cellular stress by phosphorylating mitochondrial proteins. Involved in the clearance of damaged mitochondria via selective autophagy (mitophagy) by mediating activation and translocation of PARK2. Targets PARK2 to dysfunctional depolarized mitochondria through the phosphorylation of MFN2. Activates PARK2 in 2 steps: (1) by mediating phosphorylation at Ser-65 of PARK2 and (2) mediating phosphorylation of ubiquitin, converting PARK2 to its fully-active form (PubMed:24660806, PubMed:24751536, PubMed:24784582, PubMed:25527291). PINK1_HUMAN,Q9BXM7 UniProtKB/Swiss-Prot CatalyticActivity: ATP + a protein \u003d ADP + a phosphoprotein. Molecular function for PINK1 Gene Flow Cytometry In Situ Assay Cell Line Clone Inhibitory","textAfterTable":"Genes that share ontologies with PINK1: view Phenotypes for PINK1 Gene MGI mutant phenotypes for PINK1: inferred from 9 alleles endocrine/exocrine gland phenotype cellular phenotype growth/size/body phenotype homeostasis/metabolism phenotype behavior/neurological phenotype immune system phenotype nervous system phenotype no phenotypic analysis taste/olfaction phenotype GenomeRNAi human phenotypes for PINK1: Increased G1 DNA content Decreased cell spreading","hasKeyColumn":true,"keyColumnIndex":1,"headerRowIndex":0}