{"relation":[["Stat","HP","Atk","Def","SpA","SpD","Spe"],["Max-","-","72","80","94","108","94"],["Max","126","81","89","105","121","105"],["Max+","-","89","97","115","133","115"]],"pageTitle":"Capturing RSE Legendaries - Smogon University","title":"","url":"http://www.smogon.com/ingame/guides/capturing_rse_legendaries","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"RELATION","tableNum":16,"s3Link":"common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992543.60/warc/CC-MAIN-20150728002312-00289-ip-10-236-191-2.ec2.internal.warc.gz","recordEndOffset":720296119,"recordOffset":720271464,"tableOrientation":"HORIZONTAL","lastModified":"Sat, 30 May 2015 12:58:08 GMT","textBeforeTable":"Kyogre\u0027s Maximum Stats (Level 45) After headlining in Sapphire, Kyogre decides to make a splash in Emerald, but in a new home that is constantly changing location. Kyogre can be caught in Marine Cave after defeating the Elite Four by speaking to a scientist on the second floor of the Weather Institute on Route 119. When you speak with him, the scientist will inform that it is raining heavily on a certain route. Immediately head to the route the scientist mentioned, as it will change if you let too much time pass, and don\u0027t forget to bring a Pokémon with Dive. Upon your arrival, you will notice heavy rain, indicating that Marine Cave is in the area. Search for a dark patch on the water and Dive to enter Marine Cave. Kyogre is at level 70 when you battle it; remember to save before stepping directly in front of Kyogre. Kyogre is the mascot for Pokémon Sapphire, and is located at the bottom of the Cave of Origin in Sootopolis City in that game. Kyogre will arrive at the Cave of Origin once Archie awakens it at the Seafloor Cavern on Route 128. Head over to Sootopolis City once the events at the Seafloor Cavern have passed. When you arrive, you will be led to the Cave of Origin by Steven and Wallace and asked to confront Kyogre to end the perpetual rainfall. The Cave of Origin itself is a simple 5-floor dungeon. The first four floors are shrouded in","textAfterTable":"Kyogre\u0027s Minimum Speed (Level 45) Min- Min Min+ 77 86 94 Kyogre\u0027s Moveset (Level 45) Body Slam (15 PP) Calm Mind (20 PP) Ice Beam (10 PP) Hydro Pump (5 PP) Total PP \u003d 50 The biggest threat in Kyogre\u0027s arsenal is Hydro Pump with its 120 Base Power, coupled with Kyogre\u0027s massive Special Attack and the perpetual rain caused by Drizzle. With the boost from rain, Hydro Pump can tear through most Pokémon, especially at this point in the game, where your team is likely not at a high level. Luckily, Hydro Pump only has 5 PP, so Kyogre won\u0027t get too many chances to KO your Pokémon with it. Calm Mind makes Hydro Pump more lethal and Ice Beam a serious threat after some boosts. Body Slam won\u0027t be doing as much damage compared to any of Kyogre\u0027s other moves, but it does have a decent 30% chance of inflicting paralysis. Kyogre\u0027s Maximum Stats (Level 70) Stat Max- Max Max+ HP - 241 - Atk 149 166 182 Def 136 152 167 SpA 212 236 259 SpD 199 222 244 Spe 136 152 167 Kyogre\u0027s Minimum Speed (Level 70) Min- Min Min+ 117 131 144","hasKeyColumn":false,"keyColumnIndex":-1,"headerRowIndex":0}