{"relation":[["Name","McKenzie Adams","Dana Cranston","Johnna Fouch","Andrea Hannasch","Liz Harden","Emily Hartong","Casey Hinger","Kayla Neto","Chisom Okpala","Megan Plourde","Jodi Purdy","Chantale Riddle","Mita Uiato","Kristin Winkler"],["School","UTSA","Colorado State","San Diego State","San Diego State","Boise State","Hawai\u0027i","CSU-Northridge","CSU-Fullerton","Long Beach State","Colorado State","Wyoming","New Mexico","Hawai\u0027i","UC Irvine"],["Pos.","OH","OH","S","MB","RS","OH","MB","OH","MB","MB","OH","RS","S","L"],["Yr.","Jr.","Sr.","Jr.","Sr.","Sr.","Jr.","So.","Sr.","So.","Sr.","Sr.","So.","Jr.","Sr."]],"pageTitle":"Hays Earns West Region Honorable Mention Honors - NMStateSports.com - The Official Website of New Mexico State Athletics","title":"","url":"http://www.nmstatesports.com/ViewArticle.dbml?DB_OEM_ID\u003d1900\u0026ATCLID\u003d205820716","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"RELATION","tableNum":2,"s3Link":"common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989043.35/warc/CC-MAIN-20150728002309-00171-ip-10-236-191-2.ec2.internal.warc.gz","recordEndOffset":616597675,"recordOffset":616581741,"tableOrientation":"HORIZONTAL","TableContextTimeStampAfterTable":"{16420\u003dHays, the reigning West Region Freshman of the Year, was named MVP of the WAC Tournament after leading the fourth-seeded Aggies to the title and a berth in the NCAA Tournament. She ranked third in the WAC in kills (3.92) and points (4.48) and fifth in service aces (0.28) per set. A first team All-WAC selection, she was named WAC Player of the Week once this season. Those named to the all-region teams are now eligible for All-America honors, which will be announced next week during the AVCA Convention. 2012 AVCA Division I West Region Team, 15894\u003dLEXINGTON, Ky. - New Mexico State sophomore Meredith Hays has earned honorable mention honors on the 2012 All-West Region team that was announced by the American Volleyball Coaches Association (AVCA), Tuesday, Dec. 4. She is one of three WAC volleyball players to be selected to the team.}","textBeforeTable":"Hays, the reigning West Region Freshman of the Year, was named MVP of the WAC Tournament after leading the fourth-seeded Aggies to the title and a berth in the NCAA Tournament. She ranked third in the WAC in kills (3.92) and points (4.48) and fifth in service aces (0.28) per set. A first team All-WAC selection, she was named WAC Player of the Week once this season. Those named to the all-region teams are now eligible for All-America honors, which will be announced next week during the AVCA Convention. 2012 AVCA Division I West Region Team The outside hitter and native of Hereford, Texas joins Utah State\u0027s Shay Sorenson as an honorable mention honoree, while UTSA\u0027s McKenzie Adams was selected to the team. LEXINGTON, Ky. - New Mexico State sophomore Meredith Hays has earned honorable mention honors on the 2012 All-West Region team that was announced by the American Volleyball Coaches Association (AVCA), Tuesday, Dec. 4. She is one of three WAC volleyball players to be selected to the team. Sign Up For Free Email Updates Related Links","textAfterTable":"Honorable Mention Name School Pos. Yr. Taylor Formico UC Santa Barbara L Fr. Meredith Hays New Mexico State OH So. Janisa Johnson Long Beach State OH Sr. Brieon Paige Colorado State MB Sr. Tara Roenicke Long Beach State S Jr. Shay Sorensen Utah State RS Sr. ‹ New Mexico State Volleyball","hasKeyColumn":true,"keyColumnIndex":0,"headerRowIndex":0}