{"relation":[["Citing Patent","US7662101","US7664546","US7699785 *","US8005540","US8055348 *","US8180442","US8190256","US8401636","US8475388","US8515535","US8568330","US8571656","US8579834","US8750992","US8805493","US8812428","US8936556","US8954146","US8983572","US8983611","US9002671","US9030294","US9050471","US20040215239 *","US20040215258 *","US20110166470 *","US20120184825 *","US20120277614 *"],["Filing date","Aug 31, 2004","Sep 15, 2004","Feb 23, 2005","Jul 14, 2010","Mar 26, 2007","Dec 14, 2007","Jul 23, 2009","Aug 15, 2011","Jul 30, 2010","Jan 28, 2010","Mar 8, 2012","Dec 13, 2010","Jan 6, 2011","Aug 15, 2013","Mar 19, 2013","Sep 19, 2011","Sep 22, 2009","Apr 16, 2014","Oct 28, 2011","Sep 25, 2012","Apr 30, 2012","Sep 20, 2011","Apr 30, 2009","Apr 8, 2004","Apr 8, 2004","","Jan 16, 2012","Aug 19, 2010"],["Publication date","Feb 16, 2010","Feb 16, 2010","Apr 20, 2010","Aug 23, 2011","Nov 8, 2011","May 15, 2012","May 29, 2012","Mar 19, 2013","Jul 2, 2013","Aug 20, 2013","Oct 29, 2013","Oct 29, 2013","Nov 12, 2013","Jun 10, 2014","Aug 12, 2014","Aug 19, 2014","Jan 20, 2015","Feb 10, 2015","Mar 17, 2015","Mar 17, 2015","Apr 7, 2015","May 12, 2015","Jun 9, 2015","Oct 28, 2004","Oct 28, 2004","Jul 7, 2011","Jul 19, 2012","Nov 1, 2012"],["Applicant","Cardiac Pacemakers, Inc.","Cardiac Pacemakers, Inc.","Sleep System Laboratory Inc.","Cardiac Pacemakers, Inc.","Medtronic, Inc.","Greatbatch Ltd.","Cardiac Pacemakers, Inc.","Cardiac Pacemakers, Inc.","Cardiac Pacemakers, Inc.","Cardiac Pacemakers, Inc.","Pulsaw Informatics, Inc.","Cardiac Pacemakers, Inc.","Medtronic, Inc.","Cardiac Pacemakers, Inc.","Cardiac Pacemakers, Inc.","Pulsar Informatics, Inc.","Cardiac Pacemakers, Inc.","Cardiac Pacemakers, Inc.","Inspire Medical Systems, Inc.","Cardiac Pacemakers, Inc.","Pulsar Informatics, Inc.","Pulsar Informatics, Inc.","Medtronic, Inc.","Mike Favet","Lovett Eric G.","New York University","Meir Ben David","Benjamin Horowitz"],["Title","Therapy control based on cardiopulmonary status","Posture detection system and method","Method for determining sleep stages","Monitoring of chronobiological rhythms for disease and drug management using one or more implantable device","Detecting sleep to evaluate therapy","Deriving patient activity information from sensed body electrical information","Methods and devices for implementing time of day pacing adjustments","Monitoring of chronobiological rhythms for disease and drug management using one or more implantable device","Detection of disordered breathing","Implantable cardiac device with dyspnea measurement","Composite human physiological stress index based on heart beat and sleep and/or activity history data including actigraphy","Ventricular pacing to augment atrial natriuretic hormone production","Display of detected patient posture state","Implantable cardiac device with dyspnea measurement","Monitoring of chronobiological rhythms for disease and drug management using one or more implantable device","Systems and methods for assessment of fatigue-related contextual performance using historical incident data","Minute ventilation-based disordered breathing detection","Implantable cardiac device with dyspnea measurement","System and method for patient selection in treating sleep disordered breathing","Neural control of central sleep apnea","Systems and methods for latency and measurement uncertainty management in stimulus-response tests","Systems and methods for collecting biometrically verified actigraphy data","Posture state display on medical device user interface","Implantable sudden cardiac death prevention device with reduced programmable feature set","Subcutaneous cardiac rhythm management","System and Method for Diagnosis and Treatment of a Breathing Pattern of a Patient","Method for detecting and analyzing sleep-related apnea, hypopnea, body movements, and snoring with non-contact device","High-Frequency Oscillatory Ventilation Monitoring Method and System"]],"pageTitle":"Patent US7189204 - Sleep detection using an adjustable threshold - Google Patents","title":"","url":"http://www.google.com/patents/US7189204?ie\u003dISO-8859-1\u0026dq\u003d6,243,373","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"RELATION","tableNum":6,"s3Link":"common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988310.3/warc/CC-MAIN-20150728002308-00302-ip-10-236-191-2.ec2.internal.warc.gz","recordEndOffset":482581363,"recordOffset":482554536,"tableOrientation":"HORIZONTAL","TableContextTimeStampBeforeTable":"{6485\u003dFIG. 8 is a graph of baseline trending for an MV signal. Historical data of minute ventilation of a patient is graphed over an 8 month period. The MV signal trending data is used to determine the MV signal level associated with sleep. In this example, a composite MV signal using the historical data indicates a roughly sinusoidal shape with the relatively low MV levels occurring approximately during the period from hours 21:00 through 8:00. The low MV levels are associated with periods of sleep. The MV signal level associated with sleep is used to implement sleep threshold adjustment.}","textBeforeTable":"Patent Citations Various modifications and additions can be made to the preferred embodiments discussed hereinabove without departing from the scope of the present invention. Accordingly, the scope of the present invention should not be limited by the particular embodiments described above, but should be defined only by the claims set forth below and equivalents thereof. Additional sleep-related signals may be sensed and used to improve the sleep detection mechanism described above. For example, a posture sensor may be used to detect the posture of the patient and used to confirm sleep. If the posture sensor indicates a vertical posture, then the posture sensor signal may be used to override a determination of sleep using the sleep detection and threshold adjustment signals. Other signals may also be used in connection with sleep determination or confirmation, including the representative set of sleep-related signals associated with sleep indicated above. illustrates adjustment of the accelerometer sleep threshold using the MV signal. The initial sleep threshold 910 is established using the baseline accelerometer signal data acquired as discussed above. If the patient\u0027s MV signal is low relative to an expected MV level associated with sleep, the accelerometer sleep threshold is increased 920. If the patient\u0027s MV signal level is high relative to an expected MV level associated with sleep, the accelerometer sleep threshold is decreased 930. When the patient\u0027s MV level is high, less activity detected by the accelerometer is","textAfterTable":"US8571656 Dec 13, 2010 Oct 29, 2013 Cardiac Pacemakers, Inc. Ventricular pacing to augment atrial natriuretic hormone production US8579834 Jan 6, 2011 Nov 12, 2013 Medtronic, Inc. Display of detected patient posture state US8750992 Aug 15, 2013 Jun 10, 2014 Cardiac Pacemakers, Inc. Implantable cardiac device with dyspnea measurement US8805493 Mar 19, 2013 Aug 12, 2014 Cardiac Pacemakers, Inc. Monitoring of chronobiological rhythms for disease and drug management using one or more implantable device US8812428 Sep 19, 2011 Aug 19, 2014 Pulsar Informatics, Inc. Systems and methods for assessment of fatigue-related contextual performance using historical incident data US8936556 Sep 22, 2009 Jan 20, 2015 Cardiac Pacemakers, Inc. Minute ventilation-based disordered breathing detection US8954146 Apr 16, 2014 Feb 10, 2015 Cardiac Pacemakers, Inc. Implantable cardiac device with dyspnea measurement US8983572 Oct 28, 2011 Mar 17, 2015 Inspire Medical Systems, Inc. System and method for patient selection in treating","hasKeyColumn":false,"keyColumnIndex":-1,"headerRowIndex":0}