{"relation":[["Original Title","Blague à Part[5][6][7]","Caméra Café","Des soucis et des hommes[9][10][11]","Fais pas ci, Fais pas ça[12][13][14]","H","Kaamelott","La Famille Guérin","Le Bébête Show","Les Filles d\u0027à côté[15][16][17]","Les Guignols de l\u0027info","Les Nouvelles Filles d\u0027à côté[18][19][20]","Mes pires potes[21][22][23]","Samantha oups!","SAV des émissions","Scènes de ménages[24][25][26]","Soda","Une famille formidable","Vive la colo !","Vous les femmes","WorkinGirls[27][28][29]"],["English Title (or Literal Meaning)","(lit. Joke Aside), meaning all kidding aside.[8]","(lit. Coffee Camera)","Partners, Fathers, Lovers (lit. Worries and men)","Desparate Parents (lit. Don\u0027t do this, Don\u0027t do that)","N/A","N/A (Intentional misspelling of Camelot, which is spelt the same in both French and English.)","(lit. The Guérin Family)","","(lit. The Girls next door)","(lit. The Puppets of info)","(lit. The New Girls next door)","(lit. My worst buddies)","(lit. Samantha oops!)","","","","A Wonderful Family","(lit. Live the colony !)","WOMEN! (lit. You the women)","N/A"],["Year","1998-2003","2001-2004","2012","2007–present","1998–2002","2004-2009","2002","1982-1995","1993-1995","1988–present","1995-1996","2000-2001","2004-2007","2005-2012","2009–present","2011–present","1992–present","2012-2013","2007-2011","2012–present"],["Country of Origin","France","France","France","France","France","France","France","France","France","France","France","France","France","France","France","France","France","France","France","France"],["Original Language","French","French","French","French","French","French","French","French","French","French","French","French","French","French","French","French","French","French","French","French"],["Summary","A sitcom depicting the daily lives of Psychiatrist Isabelle and Comedian Nicolas, a married couple and their friends.","Series consisting of seven minute episodes taking place in an office. All action is shot from the point of view of the coffee machine.","Also known in English as Partners, Fathers and Lovers.","Two couples, the free spirited Bouleys and the conservative-authoritarian Lepics, agree to star in a reality program along with their children. The focus is mainly on the differences between how both sets of parents raise their children and how the children differ from their parents expectations. The first season is a mockumentary/pretend reality show. From the second season on all documentary aspects are discarded and the two families have become next-door neighbors.","A surrealistic comedy series about the daily lives of the wacky staff and interns at a hospital in a Paris suburb.","Medieval fantasy, comedy about the legendary King Arthur and his quest for the Holy Grail. The episodes range in duration from three and a half minutes to forty-four minutes, getting longer as the series progresses.","","","","Satirical news show with puppets.","","Simon inherited a house in a Parisian suburb and now lives there with his three friends who crash his car, use his money to buy bad sculptures, have many sexual partners over and so on.","The daily lives of two young women, Samantha Lo and Chantal Matieu, played by two young male actors, David Strajmayster and Guillaume Carcaud.","Also known as Le Service après-vente des émissions. Each episode is approximately two minutes, fifteen seconds long.","","","","35 year-old Morgane has just broken up with her significant other and her father has been hospitalized. She goes to fill in for her father as director of a summer camp for 10 to 14 year-olds.","Sketch comedy series written by and starring Judith Siboni and Olivia Côte. The two play various women from all walks of life in ordinary circumstances that often turn absurd.","The daily lives of six off-beat women who work in an office. Karine is the sadistic tyrant of a boss who hates disabled people and gay people, her employees suspect she is gay. Déborah is a sex addict who has had complaints made against her for sexual harassment. Hélène is a recluse who often lies to try to get friends. Nathalie has many children. The two receptionists, Sophie and Sophie are lazy, rude to the clients and very critical of their coworkers."]],"pageTitle":"List of French television series - Wikipedia, the free encyclopedia","title":"","url":"http://en.wikipedia.org/wiki/List_of_French_television_series","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"RELATION","tableNum":2,"s3Link":"common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986423.95/warc/CC-MAIN-20150728002306-00197-ip-10-236-191-2.ec2.internal.warc.gz","recordEndOffset":78953087,"recordOffset":78907997,"tableOrientation":"HORIZONTAL","lastModified":"Tue, 28 Jul 2015 12:19:58 GMT","textBeforeTable":"Action-Drama[edit] Original French Programs[edit] 4 References 3 See also 2 French Adaptations of Television Series from Other Countries 1.16 Variety Show 1.15 Talk Show 1.14 Supernatural/Sci-Fi/Fantasy/Horror 1.13 Soap Opera 1.12 Religious 1.11 Reality Show 1.10 Police/Crime Drama 1.9 News 1.8 Game Show 1.7 Drama 1.6 Documentary Series 1.5 Comedy-Drama 1.4 Comedy 1.3 Animated 1.2 Adult 1.1 Action-Drama 1 Original French Programs Contents This television-related list is incomplete; you can help by expanding it. Most of the programs on this list are original French creations. However,","textAfterTable":"2009–present France French Soda 2011–present France French Une famille formidable A Wonderful Family 1992–present France French Vive la colo ! (lit. Live the colony !) 2012-2013 France French 35 year-old Morgane has just broken up with her significant other and her father has been hospitalized. She goes to fill in for her father as director of a summer camp for 10 to 14 year-olds. Vous les femmes WOMEN! (lit. You the women) 2007-2011 France French Sketch comedy series written by and starring Judith Siboni and Olivia Côte. The two play various women from all walks of life in ordinary circumstances that often turn absurd. WorkinGirls","hasKeyColumn":false,"keyColumnIndex":-1,"headerRowIndex":0}