{"relation":[["Column name","PROCEDURE_CAT","PROCEDURE_SCHEM","PROCEDURE_NAME","NUM_INPUT_PARAMS","NUM_OUTPUT_PARAMS","NUM_RESULT_SETS","REMARKS","PROCEDURE_TYPE"],["Description","The catalog that contains the procedure. The value is NULL if this table does not have catalogs.","Name of the schema that contains the stored procedure.","Name of the procedure.","Number of input (IN) parameters for the stored procedure.","Number of output (OUT) parameters for the stored procedure.","Number of result sets returned by the stored procedure.","Any comments about the stored procedure.","Always returns 1, indicating that the stored procedure does not return a return value."]],"pageTitle":"PHP: db2_procedures - Manual","title":"","url":"http://us1.php.net/manual/en/function.db2-procedures.php","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"RELATION","tableNum":0,"s3Link":"common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986423.95/warc/CC-MAIN-20150728002306-00069-ip-10-236-191-2.ec2.internal.warc.gz","recordEndOffset":262629124,"recordOffset":262620922,"tableOrientation":"HORIZONTAL","lastModified":"Wed, 29 Jul 2015 04:07:00 GMT","textBeforeTable":"Returns a statement resource with a result set containing rows describing the stored procedures matching the specified parameters. The rows are composed of the following columns: Return Values The name of the procedure. This parameter accepts a search pattern containing _ and % as wildcards. procedure The schema which contains the procedures. This parameter accepts a search pattern containing _ and % as wildcards. schema A qualifier for DB2 databases running on OS/390 or z/OS servers. For other databases, pass NULL or an empty string. qualifier A valid connection to an IBM DB2, Cloudscape, or Apache Derby database. connection Parameters Returns a result set listing the stored procedures registered in a database. string $procedure ) string $schema , string $qualifier , resource $connection , db2_procedures ( resource Description db2_procedures — Returns a result set listing the stored procedures registered in a database (PECL ibm_db2 \u003e\u003d 1.0.0) db2_procedures Report a Bug Edit","textAfterTable":"See Also db2_column_privileges() - Returns a result set listing the columns and associated privileges for a table db2_columns() - Returns a result set listing the columns and associated metadata for a table db2_foreign_keys() - Returns a result set listing the foreign keys for a table db2_primary_keys() - Returns a result set listing primary keys for a table db2_procedure_columns() - Returns a result set listing stored procedure parameters db2_special_columns() - Returns a result set listing the unique row identifier columns for a table db2_statistics() - Returns a result set listing the index and statistics for a table db2_table_privileges() - Returns a result set listing the tables and associated privileges in a database db2_tables() - Returns a result set listing the tables and associated metadata in a database add a note User Contributed Notes There are no user contributed notes for this page. IBM DB2 Functions db2_​autocommit db2_​bind_​param","hasKeyColumn":true,"keyColumnIndex":0,"headerRowIndex":0}