{"relation":[["Release date","May 23, 2013","May 15, 2013","May 15, 2013","May 15, 2013","May 15, 2013","May 15, 2013","May 15, 2013","May 10, 2013","May 8, 2013","May 8, 2013","May 7, 2013","May 6, 2013","May 4, 2013","May 2, 2013","May 1, 2013","May 1, 2013","May 1, 2013","May 1, 2013","May 1, 2013","May 1, 2013","May 1, 2013"],["Release","See, Hear Rich History from the Minnesota River Valley in Expanded Mobile Tour","Explore Nature, American Indian History and More at the Jeffers Petroglyphs Historic Site in June","Learn About the Fur Trade, the Art of Moccasin Making and Stone Tools in June at the North West Company Fur Post","Dakota Dance, Bread and Butter Day and Summer Camp this June at Historic Forestville","Free Family Day and Living History Tours at the Charles A. Lindbergh Historic Site","Forest Edibles and the Lumberjack Life This June at the Forest History Center","Dream Catcher Kids Craft and Birch Bark Harvest Workshop at Mille Lacs Indian Museum and Trading Post in June","MEDIA ALERT: Free Admission Sunday at History Center for Museums May","Split Rock Light House Rings in June With Open House and Children\u0027s Day","Dancing on the \u0027Powwow Trail\u0027 Focus of New Photography Exhibit at Mille Lacs Indian Museum, May 15 - Aug. 18","Hear Hibbing History in New Audio Tour","Winners of the 2013 State History Day Competition Announced","Winners Announced Today for \u0027Dear President Lincoln\u0027 Student Writing Contest","PHOTO OPP: Join in the Frenzy at the State History Day Competition Saturday","Learn About 1857, Alexander Ramsey: Secretary of War, Vintage Bicycles and Summer Camps Offered in June","Celebrate the Return of Summer With WWII Events and Summer Camps at Historic Fort Snelling in June","Explore the Historic Summit Avenue Neighborhood and Discover Hidden History at the James J. Hill House this June","Meet the Animals, Celebrate Father\u0027s Day and Children\u0027s Day at the Oliver H. Kelley Farm in June","Architecture, Food and Pub Crawls Plus Kids Activities at the History Center in June","Mill City Museum Offers a Variety of Tours in June","New Minnesota Museums App Makes Finding Fun Easier Than Ever"]],"pageTitle":"News Releases | Minnesota Historical Society","title":"May 2013","url":"http://www.mnhs.org/media/news/release.cfm?ID\u003d1690","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"RELATION","tableNum":26,"s3Link":"common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989891.18/warc/CC-MAIN-20150728002309-00119-ip-10-236-191-2.ec2.internal.warc.gz","recordEndOffset":592629183,"recordOffset":592580840,"tableOrientation":"HORIZONTAL","TableContextTimeStampAfterTable":"{313861\u003dFunding provided by the State of Minnesota, the Legacy Amendment through the vote of Minnesotans on Nov. 4, 2008, and our generous donors and members.}","lastModified":"Mon, 03 Aug 2015 13:24:49 GMT","textBeforeTable":"- Any -Alexander Ramsey HouseBirch Coulee BattlefieldCharles A. Lindbergh Historic SiteComstock HouseFolsom HouseForest History CenterFort RidgelyGale Family LibraryHarkin StoreHistoric ForestvilleHistoric Fort SnellingJames J. Hill HouseJeffers PetroglyphsLac qui Parle MissionLower Sioux AgencyMarine MillMill City MuseumMille Lacs Indian Museum and Trading PostMinnehaha DepotMinnesota History CenterMinnesota State CapitolNorth West Company Fur PostOliver Kelley FarmSibley Historic SiteSplit Rock LighthouseTraverse des SiouxW.W. Mayo House Location Search by word or phrase News Releases Jobs Volunteers Fellowships \u0026 Residencies Internships","textAfterTable":"April 29, 2015 Minnesota Historical Society Volunteer Program Earns National Honor April 27, 2015 JEFFERS PETROGLYPHS: Lead Release April 27, 2015 JEFFERS PETROGLYPHS: Plan A Visit April 27, 2015 JEFFERS PETROGLYPHS: History of the People April 27, 2015 JEFFERS PETROGLYPHS: History of the Petroglyphs April 27, 2015 JEFFERS PETROGLYPHS: Education Resources April 27, 2015 JEFFERS PETROGLYPHS: Experts to Interview April 27, 2015 JEFFERS PETROGLYPHS: Images April 27, 2015 JEFFERS PETROGLYPHS: Feature Article April 22, 2015 2015 Summer Travel Season Gets Underway","hasKeyColumn":false,"keyColumnIndex":-1,"headerRowIndex":0}