{"relation":[["Rating","Positive","Positive","Positive","Positive","Positive","Positive"],["Content","On Oct 23, 2013, michaelhickman from Durban South Africa wrote: Gladiolus dalenii grows naturally along the subtropical east coast of South Africa and are very plentiful in and around Durban having both a spring as well as an autumn flowering form. I have been researching Gladiolus dalenii for suitability to be grown on green roofs and have found them to be very suitable giving a blaze of colour on rooftops that are not too subjected to high wilds that can blow the flower spikes over. I have more information at the following web addresses for those who would like to know more about this very attractive plant for use on green roof applications. http://www.ecoman.co.za/green/green_docs/gladiolus_dalenii.h... ... read morer /\u003e","On Jun 8, 2013, Handed from Armidale Australia (Zone 8b) wrote: Nothing but praise for this plant as it flowers in mid to late Autumn and even slightly into early winter when there are no bright flowers to compete with it. I have it under Viburnum plicatum tomentosum, which drops its leaves just in time to show this Gladi growing up through the horizontal branches (which hold it up and stop it flopping), and it grows so tall the flower heads reach above the top branches, though eventually I may have to relocate them if shrub gets taller. It\u0027s taller than I am! It multiplies slowly and doesn\u0027t show invasive tendencies here (zone 8a).","On May 26, 2011, DebinSC from Georgetown, SC (Zone 8a) wrote: Love it. I found them last year growing wild at the edge of some woods. Dug a few and they are doing better than any other variety I\u0027ve purchased.","On May 2, 2010, elder85 from Bucyrus, OH wrote: I purchased Parrot Gladiola last year from an internet seller in Florida. They bloomed very well the first year, survived the winter with mulching, and as of May 1 are pushing up new growth. It was a mild winter with heavy snowfall. The lowest temperature was 2 degrees above zero F. Corms were planted both along building foundations and in the open garden. I am curious to see how they do over a colder winter, but have read that Gladiolus dalenii is Zone 6 hardy.","On Mar 4, 2009, GreeneLady from Oak Island, NC (Zone 8a) wrote: I live in zone 8a. I found this one glad growing in the field behind my house. I dug it up, moved it to my garden and it is doing beautiful! It is absolutely gorgeous. I will be looking for more! The flowers also seem to last longer than most glads - nearly 3 weeks!","On May 12, 2006, BamaBelle from Headland, AL (Zone 8a) wrote: Beautiful plant that grows wild in this area. I found mine growing by the roadside. I found a web entry that said it was \u0027rare\u0027 and they were charging $20 per plant...I found other websites that said it was noxious and considered a weed because it can become invasive. However, I didn\u0027t see it as being any more invasive than any other gladiolus. I love the bright orange and yellow bicolor flowers with the yellow speckles in the orange. The blooms are smaller than the commerical glads, but the color is so showy, that it just jumps out at you when you see it by the road. and it is very hardy in the SE Alabama/ SWGeorgia heat."]],"pageTitle":"PlantFiles: Detailed information on Parrot Gladiola, African Parrot Gladiola Gladiolus dalenii","title":"","url":"http://davesgarden.com/guides/pf/go/131977/","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"RELATION","tableNum":1,"s3Link":"common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992543.60/warc/CC-MAIN-20150728002312-00122-ip-10-236-191-2.ec2.internal.warc.gz","recordEndOffset":62511151,"recordOffset":62495013,"tableOrientation":"HORIZONTAL","TableContextTimeStampAfterTable":"{3368\u003dOn Mar 4, 2009, GreeneLady from Oak Island, NC (Zone 8a) wrote:, 1550\u003dOn Jun 8, 2013, Handed from Armidale Australia (Zone 8b) wrote:, 233\u003dOn Oct 23, 2013, michaelhickman from Durban South Africa wrote:, 2714\u003dOn May 2, 2010, elder85 from Bucyrus, OH wrote:, 2801\u003dI purchased Parrot Gladiola last year from an internet seller in Florida. They bloomed very well the first year, survived the winter with mulching, and as of May 1 are pushing up new growth. It was a mild winter with heavy snowfall. The lowest temperature was 2 degrees above zero F. Corms were planted both along building foundations and in the open garden. I am curious to see how they do over a colder winter, but have read that Gladiolus dalenii is Zone 6 hardy., 22055\u003d[ Home | About | Advertise | Media Kit | Mission | Featured Companies | Submit an Article | Terms of Use | Tour | Rules | Privacy Policy | Cookie Policy | Contact Us ] Back to the top Copyright © 2000-2015 Dave\u0027s Garden, an Internet Brands company. All Rights Reserved.  , 3873\u003dOn May 12, 2006, BamaBelle from Headland, AL (Zone 8a) wrote:, 2334\u003dOn May 26, 2011, DebinSC from Georgetown, SC (Zone 8a) wrote:}","textBeforeTable":"negatives 0 neutrals 0 positives 6 Gardeners\u0027 Notes: Upload an image Print this article Bookmark Stumble Upon Twitter Pinterest Facebook show all Kalama, Washington Spring, Texas Richmond, Texas Houston, Texas Athens, Texas Erwin, Tennessee Summerville, South Carolina Orangeburg, South Carolina Bucyrus, Ohio Logansport, Louisiana Independence, Louisiana Harlem, Georgia Saint Petersburg, Florida Pensacola, Florida Jacksonville, Florida Brooksville, Florida Alford, Florida Hattieville, Arkansas Wetumpka, Alabama Semmes, Alabama Headland, Alabama Daleville, Alabama This plant has been said to grow in the following regions: Regional Allow pods to dry on plant; break open to collect seeds Seed Collecting: From seed; sow indoors before last frost By dividing rhizomes, tubers, corms or bulbs (including offsets) Propagation Methods: Unknown - Tell us Patent Information: 6.6 to 7.5 (neutral) 6.1 to 6.5 (mildly","textAfterTable":"Post a comment about this plant Popular Plants More Plants African Violets Apples Azaleas and Rhododendrons Beans Begonias Brugmansias Camellias Cannas Carrots Clematis Coleus Corn Crepe Myrtles Cucumbers Daffodils Dahlias Daylilies Fuchsias Gladiolus Hardy Geraniums Heucheras Hibiscus Hostas Hydrangeas Iris Japanese Maples Lettuce Lilies Melons Onions and Garlic Orchid Cactus Peaches Pelargoniums Peonies Peppers Plumeria Potatoes Roses Salvias Squash Strawberries Tomatoes Tulips Waterlilies Iris Peppers Hydrangeas Hostas Daylilies Hibiscus Japanese Maples Roses Salvias","hasKeyColumn":false,"keyColumnIndex":-1,"headerRowIndex":0}