{"relation":[["Release date","December 18, 2013","December 18, 2013","December 18, 2013","December 18, 2013","December 18, 2013","December 18, 2013","December 18, 2013","December 18, 2013","December 11, 2013","December 11, 2013","December 4, 2013","December 4, 2013","December 4, 2013"],["Release","Mille Lacs Indian Museum and Trading Post Hosts Crafts for Kids and Adults in January and February","Free History Film Series at Charles A. Lindbergh Historic Site","Winter Frolic and Queen Charlotte\u0027s Ball Bring Winter Fun to North West Company Fur Post","Details are Focus of Family History Classes at Minnesota Historical Society Library Jan. 18","Civil War, Art and Artists and Architecture Tours at the Minnesota State Capitol in January and February","Celebrate Winter on the Hill at James J. Hill House, Two Weekends Only","History Theatre RAW Stages Comes to the Minnesota History Center in January","History of Hip Tackles Booze, Bootlegging and Beer in 2014","Meet Veterans of the Eastern Front at Historic Fort Snelling\u0027s WWII History Roundtable Jan. 9","Scratch vs. Mix Brownies and White vs. Whole Wheat at Mill City Museum in January","Alexander Ramsey House January Programs Include Time Capsule, Ramsey After Dark and History Happy Hour","History of Hip, History Forum, History Lounge and A Toast to Prohibition at History Center in January","The \u0027Original Gangsters\u0027 Topic of Free History Lounge Program at Minnesota History Center Jan. 28"]],"pageTitle":"News Releases | Minnesota Historical Society","title":"December 2013","url":"http://www.mnhs.org/media/Kits/release.cfm?newsID\u003d1888\u0026SiteID\u003d15","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"RELATION","tableNum":19,"s3Link":"common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987662.63/warc/CC-MAIN-20150728002307-00279-ip-10-236-191-2.ec2.internal.warc.gz","recordEndOffset":114498071,"recordOffset":114455133,"tableOrientation":"HORIZONTAL","TableContextTimeStampAfterTable":"{313861\u003dFunding provided by the State of Minnesota, the Legacy Amendment through the vote of Minnesotans on Nov. 4, 2008, and our generous donors and members.}","textBeforeTable":"- Any -Alexander Ramsey HouseBirch Coulee BattlefieldCharles A. Lindbergh Historic SiteComstock HouseFolsom HouseForest History CenterFort RidgelyGale Family LibraryHarkin StoreHistoric ForestvilleHistoric Fort SnellingJames J. Hill HouseJeffers PetroglyphsLac qui Parle MissionLower Sioux AgencyMarine MillMill City MuseumMille Lacs Indian Museum and Trading PostMinnehaha DepotMinnesota History CenterMinnesota State CapitolNorth West Company Fur PostOliver Kelley FarmSibley Historic SiteSplit Rock LighthouseTraverse des SiouxW.W. Mayo House Location Search by word or phrase News Releases Jobs Volunteers Fellowships \u0026 Residencies Internships","textAfterTable":"May 2015 Release date Release May 13, 2015 July 2015 Events, Classes And Exhibits May 3, 2015 Winners of 2015 State History Day Competition Announced April 2015 Release date Release April 29, 2015 Minnesota Historical Society Volunteer Program Earns National Honor April 27, 2015 JEFFERS PETROGLYPHS: Lead Release April 27, 2015 JEFFERS PETROGLYPHS: Plan A Visit April 27, 2015 JEFFERS PETROGLYPHS: History of the People April 27, 2015 JEFFERS PETROGLYPHS: History of the Petroglyphs April 27, 2015 JEFFERS PETROGLYPHS: Education Resources","hasKeyColumn":false,"keyColumnIndex":-1,"headerRowIndex":0}