{"relation":[["Character","Amal Nagchaudhuri","Nazari","Nelson","Jean-Claude Nesbitt","Tony Nesbitt","Sir Hakon Nessler","Willard Neufsteiler","Francis \u0027Frank\u0027 Ney","Nico","Nimitz (Laughs Brightly)","Agnes Nordbrandt","Eugene Nordbrandt"],["Affiliation","RMN","-","SKM","RH","RH","RMN/SKM","SKM","SKM","SKM","SKM","TC","RMN"],["Description","Lieutenant Commander; Hexapuma\u0027s communications officer. Desc.- \"tall, almost albino-pale\"","skipper on RMMS Chantilly","Treecat in Nimitz\u0027s Grayson immigrant clan","Security Chief to Sec. of State Giancola, cousin of Tony Nesbitt. (Alleged to be a Mesan Agent; citation needed!)","Secretary of Commerce","Ensign (Resigned), Royal Manticoran Navy. Fourteenth Earl of Greatgap. Undertook an expedition, along with his mentor Edith Mincio, to Hope (fmr. Salamis) in the outskirts of the Solarian League to study the Alphane Worlds. While there he took command of the Melungeon light-cruiser Colonel Araby, rechristened the HMS Ajax and crewed by the thirty-seven survivors of the destroyer HMS L\u0027Imperieuse. He and \"his\" crew and tracked down and destroyed the heavy-cruiser the PNS Rienzi which was attacking RMN ships in Sollie space.","Honor Harrington\u0027s chief financial manager","personal bodyguard of Prime Minister Allen Summervale, died in the assassination at Grayson.","A servant in White Haven, likely a footman or possibly the junior butler","Treecat. Adopted Honor Harrington at the age of 13 (14??), attended RMN Naval Academy on Saganami Island with her, and has been with her ever since, save while imprisoned aboard Tepes with Cordelia Ransom. His injuries in connection with that episode have prevented him from telepathically speaking to other treecats. Mate of Samantha and father of Jason, Achilles, Andromeda, and Cassandra, who were taken to Grayson to grow up, along with a party from Nimitz\u0027 Bright Water Clan.","Leader of the Kornati National Redemption Party (NRP) and as such was a close ally of current President Vuk Rajkovic; organizer and leader of the Freedom Alliance of Kornati (FAK), a terrorist group backed unknowingly by Mesa through a contact named \"Firebrand\".","Lieutenant, Bad Penny‍ \u0027​s com officer"],["Appeared in","Storm from the Shadows, Ch. 5","War of Honor","In Enemy Hands, Echoes of Honor, Ashes of Victory","War of Honor?, At All Costs","War of Honor, At All Costs","More Than Honor","Field of Dishonor, Honor Among Enemies through At All Costs","Ashes of Victory","War of Honor, At All Costs","","The Shadow of Saganami","Ashes of Victory"]],"pageTitle":"List of characters in the Honorverse - Wikipedia, the free encyclopedia","title":"","url":"https://en.wikipedia.org/wiki/Oscar_Saint-Just","hasHeader":true,"headerPosition":"MIXED","tableType":"RELATION","tableNum":78,"s3Link":"common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989043.35/warc/CC-MAIN-20150728002309-00250-ip-10-236-191-2.ec2.internal.warc.gz","recordEndOffset":877851327,"recordOffset":877747260,"tableOrientation":"HORIZONTAL","lastModified":"Tue, 21 Jul 2015 16:28:32 GMT","textBeforeTable":"Abbot to Adams[edit] A[edit] VE: Verge system TQ: See TC TC: region near one of the SKM wormhole terminals Talbott Cluster, same as Talbott Quadrant. SUT: Sustained Use Thruster (usually in context of EVA suit thrusters) SO: Senior Officer SIS: Special Intelligence Service (SKM term) SCPO: Senior Chief Petty Officer SBA: Sick Bay Attendant (in RMN) SC: Silesian Confederacy SAR: Search and Rescue ROE: Rules of Engagement PO: Petty Officer OCTO: Officer Candidate Training Officer MO: Monica star system MN: Monican Navy ME: Mesa star system MA: Masada star system LAC: Light attack craft (not hyper capable) KT: Star Kingdom of Torch JNMTC: Joint Navy Military Transport Command (SKM) INS: Interstellar News Service HH: Honor Harrington EW: Electronic Warfare (also Energy Weapons?) EVA: Extra-Vehicular Activity (derived from ancient NASA term) ER: Erewhon star system EN: Erewhon Navy ECM: Electronic CounterMeasures (methods to confuse enemy sensors) DCC: Damage Control Center CPO: Chief Petty Officer CN: Caliphate (Zanzibaran) Navy COLAC: Commanding Officer, LACs CO: Commanding Officer CIP: Council for an Independent Prism ATO: Assistant Tac Officer Other abbreviations: other Mantie other Peep Parliamentary Medal of Valor PMV Royal Manticoran Navy RMN State Security SS Royal Manticoran Merchant Ship RMMS Republic of Haven Naval Ship RHNS Royal Manticoran Marine Corps RMMC Republican","textAfterTable":"Adcock to Albertson[edit] Character Affiliation Description Appeared in Adcock, Jonas RMN Vice Admiral of the Green, RMN. Fourth Space Lord of the Royal Manticoran Navy and head of the Bureau of Weapons In Enemy Hands Addison, Calvin PRH People\u0027s Commissioner to Citizen Captain Joanne Hall aboard PNS Schaumberg Echoes of Honor Adenauer, Dominica RMN Commander; operations officer, Battlecruiser Squadron 106; later operations officer, 10th Fleet. Not previously known to Henke before serving under her command. Storm from the Shadows, Ch. 8+11 Adib RMN Captain, CO of HMS Hydra Ashes of Victory Adolfsson, George TC Planetary President of Pontifex The Service of the Sword Agard PN Citizen Lieutenant, Crewmember of a Havenite pinnace Echoes of Honor Agnelli, Federico SS Citizen Admiral, SS. Citizen Admiral in State Security\u0027s Navy. Reverted to warlordism after the fall of the People\u0027s Republic War of Honor Agnelli, Joanna RMN Chief Steward to Aivars Terekhov. The Shadow of Saganami; Storm from the Shadows, Ch. 5 Ainspan, Victor RMN Commander, A prisoner in Hades, former commanding officer of the light cruiser HMS Adonai Echoes of Honor al-Fanudahi, Daud ibn Mamoun SLN Captain, a Battle Fleet analyst assigned to the Office of Operational Analysis. Storm from the Shadows al-Salil,","hasKeyColumn":true,"keyColumnIndex":0,"headerRowIndex":0}