{"relation":[["Style","Flat","Flat"],["Beds","1","2"],["Ba","1","2"],["1/2 Ba","0","0"],["Sq. Ft.","800","1000"],["Rent","$825-$965","$945-$1025"],["Term","Per Month","Per Month"],["Deposit","$200","$200"]],"pageTitle":"Somerset Apartments - Fort Walton Beach, FL 32548 | Apartments for Rent","title":"","url":"http://www.apartmentguide.com/apartments/Florida/Fort-Walton-Beach/Somerset-Apartments/8455/","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"RELATION","tableNum":0,"s3Link":"common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986423.95/warc/CC-MAIN-20150728002306-00030-ip-10-236-191-2.ec2.internal.warc.gz","recordEndOffset":294122343,"recordOffset":294098520,"tableOrientation":"HORIZONTAL","TableContextTimeStampBeforeTable":"{13436\u003d940 Santa Rosa Boulevard, Fort Walton Beach, FL 32548}","TableContextTimeStampAfterTable":"{29035\u003dSchool and Demographic data copyright © 2009 Onboard Informatics. School content provided by Onboard Informatics. Information is deemed reliable but not guaranteed. Schools listed above are based on distance from the selected location and are just a sampling of the schools in the area. To find a particular school district, and how it relates to a specific apartment, please contact the apartment manager., 28499\u003d© 2015 RentPath, Inc. All rights reserved. All photos, videos, text and other content are the property of RentPath, Inc. APARTMENT GUIDE and the APARTMENT GUIDE Trade Dress are registered trademarks of RentPath, Inc. or its affiliates.}","textBeforeTable":"Prices and availability subject to change without notice. Check Availability 2 Baths: 2 Beds: 1000 Sq Ft: $200 Deposit: $945-$1025 / mo Rent: Flat View Floor Plan - 1 Floor Plan 2 Bedrooms Check Availability 1 Baths: 1 Beds: 800 Sq Ft: $200 Deposit: $825-$965 / mo Rent: Flat View Floor Plan - 1 Floor Plan 1 Bedroom Does your furniture fit? Pick a floor plan below and design your new","textAfterTable":"Prices and availability subject to change without notice. Move-in Specials! Coupon Awesome Community!!! Great Location!! Call Today For Full Details!! Take advantage of this fantastic offer today! Call (850) 398-4917 (866) 455-4875 (850) 659-7385 or click |  Activate Coupon General Directions From Highway 98, turn west on Santa Rosa Boulevard. Somerset is 2 miles by the water tower on the gulf side. Apartment Features Air Conditioning Balcony Cable Ready Ceiling Fan(s) Dishwasher Some Paid Utilities View Washer \u0026 Dryer Connections Community Features Clubhouse Emergency Maintenance Extra Storage Laundry Facility Swimming Pool Special Features No Pets Additional Features Application Fee $50 per person (non-refundable) Turn-over Fee $200 Non Refundable 7-month Lease Option - $25 more per month Located on the beach Newly remodeled Ceiling fans Disposal Frost-free refrigerator Icemaker Mini-blinds 7 month leases Military clause accepted Lighted tennis court Professionally managed Friendly atmosphere","hasKeyColumn":true,"keyColumnIndex":0,"headerRowIndex":0}