{"relation":[["","1","2","3","4","5","6","7","8","9","10","11"],["Name","Bad Indication","Bully Bully","Automatic","Hang On for Love","Stay In Time","Full Moon Turn My Head Around","Drop Me a Line","I Belong to Me","Showdown","U.S. Girls","She Said"],["Artist","Off Broadway","Off Broadway","Off Broadway","Off Broadway","Off Broadway","Off Broadway","Off Broadway","Off Broadway","Off Broadway","Off Broadway","Off Broadway"],["Time","3:41","4:11","4:49","4:43","2:52","6:59","3:30","3:17","3:59","4:30","4:26"],["Price","$0.99","$0.99","$0.99","$0.99","$0.99","$0.99","$0.99","$0.99","$0.99","$0.99","$0.99"],["","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes","View In iTunes"]],"pageTitle":"iTunes - Music - Live At Fitzgerald\u0027s by Off Broadway","title":"","url":"https://itunes.apple.com/us/album/live-at-fitzgeralds/id35969379","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"RELATION","tableNum":0,"s3Link":"common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988310.3/warc/CC-MAIN-20150728002308-00339-ip-10-236-191-2.ec2.internal.warc.gz","recordEndOffset":871364907,"recordOffset":871336952,"tableOrientation":"HORIZONTAL","TableContextTimeStampAfterTable":"{118996\u003dCopyright © 2014 Apple Inc. All rights reserved., 20956\u003dIn 1979, Off Broadway nipped at the heels of fellow, midwestern power pop sensations Cheap Trick. Unable to eclipse Rick Nielsen and company, they setteled in comfortably with a few domestic top 40 hits, Full Moon and Stay In Time. This live recording from the legendary Fitzgerald\u0027s outside of Chicago, is the perfect sampler for casual or new listeners. The songs have a harder edge than the originals from 27 years ago.}","lastModified":"Fri, 31 Jul 2015 18:26:03 GMT","textBeforeTable":"Open iTunes to preview, buy, and download music. View More by This Artist Off Broadway Live At Fitzgerald\u0027s iTunes for Mac + PC Already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from Live At Fitzgerald\u0027s by Off Broadway, download iTunes now. iTunes is the world\u0027s easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn\u0027t open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn\u0027t open, click the iTunes application icon in your Dock or on your Windows desktop. Opening the iTunes Store.","textAfterTable":"11 Songs Customer Reviews Midwestern favorite           by midwest music In 1979, Off Broadway nipped at the heels of fellow, midwestern power pop sensations Cheap Trick. Unable to eclipse Rick Nielsen and company, they setteled in comfortably with a few domestic top 40 hits, Full Moon and Stay In Time. This live recording from the legendary Fitzgerald\u0027s outside of Chicago, is the perfect sampler for casual or new listeners. The songs have a harder edge than the originals from 27 years ago. Off Broadway - Live at Fitzgerald\u0027s           by OB @ Fitz Simply stated - Off Broadway is the best Power Pop band to emerge from the great Chicago music scene of the late 70\u0027s/early 80\u0027s. Cheap Trick may have attained more notoriety and international acclaim, but for some more prudent management OB could well have seen similar support. Cliff Johnson\u0027s hook-laden songs are well crafted and the twin guitar attack of Rob Johnson and John Ivan are spectacular, not","hasKeyColumn":true,"keyColumnIndex":1,"headerRowIndex":0}