{"relation":[["Terms","Miriam Lord, The Best of Miriam Lord","Roisin Ingle, Róisín Ingle","Ross, Rock, Ross o carroll kelly, ross o\u0027carroll kelly, ross o carroll, ross o\u0027carroll","Conor Pope","Fintan O\u0027Toole, fintan otoole, fintan o\u0027toole,25 years of Irish Life through the columns of Fintan O\u0027Toole","Michael Harding","Deaths, death notices, family notices, births deaths \u0026 marriages, obituaries","weather forecast","Letters to the editor","Pricewatch, Conor Pope","Crossword, crosswords, simplex, crosaire, crossaire, xword","Jobs","Property, commercial property","Property, Homes, home, new to market","Property, Homes, home,Myhome,myhome.ie","Competitions","Podcast, Podcasts, Inside Politics, Hugh Linehan","Podcast, Podcasts, World View, Denis Staunton","Podcast, Podcasts, Off Topic Show, Off Topic Podcast","Podcast, Podcasts, Róisín Ingle, Róisín Meets, Roisin Ingle, Roisin Meets","Podcast, Podcasts, Business Podcast, Ciarán Hancock","Subscriptions, digital subscriptions, standard digital subscriptions, premium digital subscriptions, premium subscriptions, Gifts","Podcast, Podcasts, Second Captains","pagesales, page sales, front page, front page sales, page reprint, reprint, reprints,gifts","photosales, photo sales, photographs, photographer, photography, buy photos,gifts","Ancestors, Irish ancestors","Irish Times books, The Irish Times 150 years of influence, Wison on wine, Turner\u0027s Taoisigh, The Best of Miriam Lord, More Simplex, The Times we lived in, The Irish Times Book of the year 2014,gifts","You Are What You Read, Irish Times ads","Rewarding Times","Reader offers","Travel offers","Dating","Subscriptions, digital subscriptions, standard digital subscriptions, premium digital subscriptions, premium subscriptions","newspaper, delivery, weekend newspaper, digital subscription, print subscription","Home delivery, Delivery, newspaper","Digital Edition, epaper, replica edition, newspaper","Newspaper Archive, replica","Irish Times eBooks, The Best of Miriam Lord, An Irishman\u0027s diary, 25 years of Irish Life through the columns of Fintan O\u0027Toole, Do the think we\u0027re eejits?, Ireland and Me: reflections by emigrants, Scotland\u0027s Moment - The story of the referendum, Fall of the Wall - 25 years on","obituaries, deaths","Memorable Moments, Birthday Books, Anniversary Books,gifts","Sports diary 2015, Sports diary, Sports calendar 2015, Sports calendar, Sports events, fixtures"],["Title","Miriam Lord","Roisin Ingle","Ross O\u0027Carroll Kelly","Conor Pope","Fintan O\u0027Toole","Michael Harding","Family Notices","Weather","Letters","Pricewatch","The Crossword Club","Jobs","Commercial Property","Homes \u0026 Property","MyHome.ie","Competitions","Inside Politics Podcast","World View Podcast","Off Topic Podcast","Róisín Meets Podcast","Business Podcast","Gift Subscriptions","Second Captains Podacst","Page Sales","Photo Sales","Irish ancestors","Irish Times books","You Are What You Read","Rewarding Times","Reader offers","Travel Offers","Irish Times Dating","Digital subscriptions","Print + Digital subscriptions","News delivery","ePaper","Irish Times Newspaper Archive","Irish Times eBooks","Obituaries","Memorable Moments","Sports Diary 2015"],["Summary","Miriam Lord is a colour writer and columnist with The irish Times.","Roisin Ingle is a journalist for The Irish Times contributing features, news, colour and a weekly column in the Saturday magazine","Ross O\u0027Carroll Kelly is a satirical finctional Irish character, a wealthy Dublin 4 rugby union jock created by journalist Paul Howard.","Conor Pope is The Irish Times Consumer Affairs Correspondent and edits the Pricewatch Column.","Fintan O\u0027Toole is literary editor of The Irish Times and has been an op-ed columnist since 1988.","Michael Harding is a playwright and novelist.","Deaths, Weddings, Births and other family notices","Irish and International weather forecasts including a five-day forecast, tides and weather warnings","Readers\u0027 Letters to the Editor of The Irish Times","Consumer advice column written by Conor Pope","Play up to 10 years of Irish Times simplex and crosaire crosswords on your computer or iPad","Featured jobs, jobsearch and career advice","Irish construction and property market news","Latest Irish Homes \u0026 Property News, Reviews, Tips and Advice","Find Thousands of Houses and Apartments for Sales and Rent across Ireland and much more with MyHome.ie, Ireland\u0027s Leading Property Portal. .","Win excellent prizes from The Irish Times and selected partners","Weekly politics podcast presented by Hugh Linehan","Weekly foreign affairs podcast presented by Denis Staunton","Off Topic is a weekly culture and ideas podcast","Weekly podcast presented by Róisín Ingle","Weekly business podcast presented by Ciarán Hancock","The Irish Times news subscription is available to buy as a gift. Standard and premium digital subscriptions available.","Weekly sports podcast from the Second Captains team","Commemorate a birthday, christening, anniversary or other special day with a framed page of The Irish Times","Choose from an extensive range of photographs taken by Irish Times photographers","Use The Irish Times database of family records to trace your Irish ancestry","A selection of some of the best writing from The Irish Times journalists and superb images from our photographers","Our new ad campaign is designed to tell the stories of what makes The Irish Times unique: our writers. Here we want to celebrate the people behind the stories, starting with Harry McGee and Conor Pope.","Rewarding Times features exclusive weekly offers from selected Irish Times partners","Special offers and discounts for readers of The Irish Times","From beach holidays and city breaks, to escorted tours and cruises, our travel offers have something for everyone","Start your free membership today","Find the subscription bundle that\u0027s right for you","Subscribe to The Irish Times newspaper and website","Choose from a range of Ireland’s most popular newspapers and magazines delivered to your home or office before 7.30am each day. Choose the publications and delivery days that suit your requirements.","Read full editions of The Irish Times in true printed format and get all your latest news across multiple devices.","Browse full issues from 1859 to present day, see all articles, photos and ads as they originally appeared","The Irish Times eBooks offer a selection of some of the best writing from The Irish Times journalists","Obituaries from The Irish Times","Commemorate any special date with a beautifully recreated edition of The Irish Times from that day.","Browse the major sporting events of 2015"],["URL","//www.irishtimes.com/profile/miriam-lord-7.1010638","//www.irishtimes.com/profile/r%C3%B3is%C3%ADn-ingle-7.1837386","//www.irishtimes.com/profile/ross-o-carroll-kelly-7.1837434","//www.irishtimes.com/profile/conor-pope-7.1008780","//www.irishtimes.com/profile/fintan-o-toole-7.1010663","//www.irishtimes.com/profile/michael-harding-7.1837459","//notices.irishtimes.com","//www.irishtimes.com/weather","//www.irishtimes.com/opinion/letters","//www.irishtimes.com/news/consumer","//www.irishtimes.com/games/crosswords","//www.irishtimes.com/jobs","//www.irishtimes.com/business/commercial-property","//www.irishtimes.com/life-and-style/homes-and-property","//www.myhome.ie","//www.irishtimes.com/competitions","//www.irishtimes.com/news/politics/inside-politics","//www.irishtimes.com/news/world/world-view","//www.irishtimes.com/culture/off-topic","//www.irishtimes.com/life-and-style/people/r%C3%B3is%C3%ADn-meets","//www.irishtimes.com/business/business-podcast","//www.irishtimes.com/gift","//www.irishtimes.com/sport/second-captains","//www.irishtimes.com/pagesales","//www.irishtimes.com/photosales","//www.irishtimes.com/ancestor","//www.irishtimes.com/offers/irish-times-books","//www.irishtimes.com/you-are-what-you-read","//www.rewardingtimes.ie","//readeroffers.irishtimes.com","//traveloffers.irishtimes.com","//dating.irishtimes.com","//www.irishtimes.com/digital-subscriptions","//www.irishtimes.com/digital-print-subscriptions","//www.newsdelivery.ie","//www.irishtimes.com/epaper","//www.irishtimes.com/archive","//www.irishtimes.com/more/ebooks","//www.irishtimes.com/life-and-style/people/obituaries","//www.memorablemoments.ie","//www.irishtimes.com/sport/sports-diary-2015"]],"pageTitle":"Search","title":"","url":"http://www.irishtimes.com/search/search-7.1213540?article\u003dtrue\u0026tag_person\u003dTim%2BParks","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"RELATION","tableNum":0,"s3Link":"common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989043.35/warc/CC-MAIN-20150728002309-00330-ip-10-236-191-2.ec2.internal.warc.gz","recordEndOffset":526737171,"recordOffset":526718159,"tableOrientation":"HORIZONTAL","TableContextTimeStampAfterTable":"{18453\u003d[1859-PRESENT], 18236\u003d[1996-PRESENT]}","lastModified":"Sun, 02 Aug 2015 12:28:26 GMT","textBeforeTable":"THE NEWSPAPER [1859-PRESENT] IRISHTIMES.COM [1996-PRESENT] Refine Results » Relevance Oldest Newest Sort: Date: Keywords: X The website has been optimised for modern web browsers; for the best experience, please update your browser now.","textAfterTable":"Suggested results: We’re Flying: Stories, by Peter Stamm Books June 8, 2013, 01:00 Everyone is on their own. This emerges as the prevailing reality of the Swiss writer Peter Stamm’s outstanding, often bleak and always unsettling fict(...) FILTER RESULTS BY: Clear All SECTIONS Clear Books 1 Culture 1 Irish Times 1 TOPICS Clear George Orwell 1 Michael Hofmann 1 Tim Parks 1","hasKeyColumn":true,"keyColumnIndex":1,"headerRowIndex":0}