{"relation":[["Categories","Campus Safety","Clubs and Activities","Great for these types of students","Share any unusual traditions or locations on campus","Bang for the buck","What to do for fun","Food and Dining","Academic Rigor","Tips for prospective students","In three sentences"],["Comments","Public Safety communicates with the entire campus via email to alert us of new procedures and precautions to take. I feel very well looked after.","From social issues to academic to creative issues, there\u0027s a club for everyone!","All types. Fresh out of high school, older students already in the depths of their careers, international students, etc.","There\u0027s music everywhere! There\u0027s quiet spaces in the library to do work, but the environment on this campus is unlike any other. The halls are overflowing with talent.","Berklee is pricey, because you\u0027re paying for some of the best of the best. Another reason to work extra hard! Berklee offers tuition payment plans which are a great option for some!","Sooooooo many great concerts in the metro area, and Berklee students get discounts tickets to some of them! Berklee students also have FREE access to the Fine Arts Museum, which is lovely. When the weather is nice, there are beautiful bike trails and parks for recreational fun. And the beach is only 45 minutes away. There are almost endless options for dancing and nightlife to suit your tastes!","On campus cafeteria (where there are often late night performances and concerts by fellow students. Dining doesn\u0027t get much better than that!) There are tons of nearby and affordable places to grab food between classes!","Be ready to work hard towards your goals. These teachers take you seriously as a musician. Do yourself a favor and take yourself seriously, as well. Learning here is fun!","Be sure to prep well for your audition and interview! Remember that Berklee looks for your potential, and knows everyone is coming to the school with a different skill set. They have your best academic interests at heart. Have fun and stay open!","Berklee has incredibly thorough teachers. There are countless opportunities for learning and growth outside the classroom including workshops and physical fitness programs. Berklee is incredibly welcoming to all students, regardless of age, experience, and place of origin."]],"pageTitle":"Berklee College of Music Reviews: Student Reviews and Ratings | Cappex","title":"","url":"https://www.cappex.com/colleges/Berklee-College-of-Music/reviews?_escaped_fragment_\u003d/show/90481","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"RELATION","tableNum":35,"s3Link":"common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988310.3/warc/CC-MAIN-20150728002308-00225-ip-10-236-191-2.ec2.internal.warc.gz","recordEndOffset":909716507,"recordOffset":909654498,"tableOrientation":"HORIZONTAL","TableContextTimeStampAfterTable":"{42123\u003dI attended the summer program in 2011. There was alot to it but everyone helped each other which made the program really fun. I hear the curriculum is rigorous but definitely worth the effort., 126940\u003dThe Berklee Beach is the area right in front of the 150 Mass Ave building where everybody who smokes, smokes. We call all of our buildings by their street address numbers like 150, 7, 1140, except for the building with the administration offices in it, that\u0027s the Uchida Building., 97566\u003dBerklee doesn\u0027t really have any weird traditions and the campus is comprised of a handful of buildings within the Boston Back Bay area, so there aren\u0027t any particular locations of interest really. Although the 1140 Boylston St. building is the oldest and first Berklee building that existed., 275482\u003d© 2015, Cappex.com, LLC, 114094\u003dBerklee College is a great place, but always remember to stay focus. May get really easy to get side track from your art form. Everyone is wonderful though, never a dull moment., 129531\u003dI never lived in the dorms, and they are building new ones that will be ready in Fall 2013 I believe but the dorms aren\u0027t horrible. You get a mini fridge and you can bring in a microwave and they have practice rooms in the dorms and the ones in the 150 Mass Ave building don\u0027t have community bathrooms, they\u0027re all private ones in the rooms which is a plus!, 37392\u003di haven\u0027t experienced the dorm life yet but will in september., 7124\u003dDon\u0027t decide to come to Berklee in April. You must decide well before that for several reasons. Take time to get the money you will need to attend. Also, spend much time getting ready for your audition. It\u0027s worth it.}","textBeforeTable":"07/12/2009 Reviewer is A current student here. 26 out of 29 people found this review useful. 1 of 61 Lynne from Suisun City, CA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display(\u0027div-gpt-ad-1414696943434-2\u0027); }); cpx.googleAds.customAdData \u003d {}; cpx.googleAds \u003d {}; var cpx \u003d cpx || {}; } } } xmlhttp \u003d new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp \u003d new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state \u003d\u003d \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp \u003d new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp \u003d new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe(\u0027edge.remove\u0027, }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp \u003d new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code","textAfterTable":"Bang for the buck It\u0027s totally worth every penny, even though it\u0027s extremely expensive. Am enjoying being here I do like is here. There is just so much music everywhere and so many people into the same styles as you. It\u0027s great meeting people and have awesome jam sessions. Am learning a lot There is so much to offer here and all the faculty is there for you. They are so kind and helpful in whatever you need. All the classes you take really seem to mesh with each other. Which is really helpful when doing the work. The teachers are extremely knowledgeable and will make you a better player! Login to rate or flag the reviews Logan from Edmond, OK 10/24/2009 Reviewer is A current student here. 13 out of 13 people found this review useful. 3 of 61 Categories Comments Great for these types of students","hasKeyColumn":true,"keyColumnIndex":0,"headerRowIndex":0}