{"relation":[["Name/Contact","Dean of Students","Asian American Resource Center","Campus Life","Career Development Office","Draper Center","Queer Resource Center","Smith Campus Center","Women\u0027s Union"],["Title","Dean of Students Office","The Asian American Resource Center","The Office of Campus Life","The Career Development Office","The Draper Center for Community Partnerships","The Queer Resource Center","The Smith Campus Center","The Women\u0027s Union"],["Phone","(909) 607-3615","(909) 621-8639","(909) 607-2239","(909) 621-8144","(909) 607-8575","(909) 607-1269","(909) 621-8611","(909) 621-8017"],["Fax","(909) 607-7288","(909) 607-7288","(909) 607-7288","(909) 607-7288","(909) 607-7288","(909) 607-7288","(909) 607-7288","(909) 607-7288"]],"pageTitle":"Division of Student Affairs - Pomona College","title":"Staff","url":"http://www.pomona.edu/administration/student-affairs/","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"RELATION","tableNum":0,"s3Link":"common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986423.95/warc/CC-MAIN-20150728002306-00269-ip-10-236-191-2.ec2.internal.warc.gz","recordEndOffset":665295220,"recordOffset":665287018,"tableOrientation":"HORIZONTAL","TableContextTimeStampAfterTable":"{8010\u003dThe Student Affairs Mission Statement was endorsed by the Student Affairs Committee on campus and the Student Affairs Committee of the Board of Trustees in March 2010, 11973\u003dMailing AddressPomona College, Student Affairs, 550 N. College Avenue, Claremont, CA 91711}","textBeforeTable":"The Student Affairs Mission Statement was endorsed by the Student Affairs Committee on campus and the Student Affairs Committee of the Board of Trustees in March 2010 Building intergenerational College connections supports student development and life-long opportunities  Developing a sustainable campus environment encourages life-long learning and innovation Fostering opportunities for sustained interaction and dialogue on campus among students, faculty, and staff builds community, self awareness, and mutual trust Learning how to be accountable develops maturity as well as personal and social responsibility Meaningful community engagement and experiential learning off campus prepares students for leadership in a diverse and rapidly changing world Co-curricular education develops skills for academic, personal, work, and life success A thriving, diverse student body enhances the learning experience of all students A living and learning environment that is safe, healthy, intellectually stimulating, and emotionally supportive is at the core of a residential, liberal arts college experience Student services will meet specific goals and be informed by student learning outcomes, as well as Student Affairs and other relevant theory and practice Student services will be of the highest quality and responsive to appropriate student needs Towards this end, we work collaboratively with students, faculty and staff with these core principles guiding us: Student Affairs at Pomona College fosters the holistic development of students by focusing on personal and social responsibility, co-curricular education, and community engagement on and off campus. Student Affairs Mission Statement Welcome to Pomona College!  Pomona College is a residential, liberal","textAfterTable":"Mailing AddressPomona College, Student Affairs, 550 N. College Avenue, Claremont, CA 91711 Phone(909) 621-8017 Fax(909) 607-7288 Campus LocationAlexander Hall Emailstudentaffairs@pomona.edu Student Affairs Student Affairs Offices Conferences and Events Small College Dean\u0027s Meeting Hotel and Travel Contact Us Federal Compliance \u0026 Student Consumer Information Learning Outcomes Assessment in Student Affairs Academic Support Resources 333 N. College Way | Claremont, CA 91711 | (909) 621-8000 Emergency Giving Employment Sustainability Diversity Privacy Feedback","hasKeyColumn":true,"keyColumnIndex":0,"headerRowIndex":0}