{"relation":[["Date","Jan 4, 2012","Jan 4, 2012","Jan 4, 2012","Jan 4, 2012","Jan 4, 2012","Jan 4, 2012","Jan 4, 2012","Jan 4, 2012","Jan 4, 2012","Jan 4, 2012","Jan 4, 2012","Jan 4, 2012","Jan 4, 2012","Jan 4, 2012","Jan 4, 2012","Jan 4, 2012","Jan 4, 2012","Jan 4, 2012","Jan 4, 2012","Jan 4, 2012","Jan 4, 2012","Jan 4, 2012","Jan 4, 2012","Jan 4, 2012","Jan 4, 2012","Jan 4, 2012","Jan 4, 2012","Jan 4, 2012","Jan 5, 2012","Jan 5, 2012","Jan 5, 2012","Jan 5, 2012","Jan 5, 2012","Jan 5, 2012","Jan 5, 2012","Jan 5, 2012","Jan 5, 2012","Jan 5, 2012","Jan 5, 2012","Jan 5, 2012","Jan 5, 2012","Jan 5, 2012","Jan 5, 2012","Jan 5, 2012","Jan 5, 2012","Jan 6, 2012","Jan 6, 2012","Jan 6, 2012","Jan 6, 2012","Jan 6, 2012","Jan 6, 2012","Jan 6, 2012","Jan 6, 2012","Jan 6, 2012","Jan 6, 2012","Jan 6, 2012","Jan 6, 2012","Jan 6, 2012","Jan 6, 2012","Jan 7, 2012","Jan 7, 2012","Jan 7, 2012","Jan 7, 2012","Jan 7, 2012","Jan 7, 2012","Jan 7, 2012","Jan 8, 2012","Jan 8, 2012","Jan 9, 2012","Jan 9, 2012","Jan 9, 2012","Jan 10, 2012","Jan 10, 2012","Jan 10, 2012","Jan 10, 2012","Jan 10, 2012","Jan 13, 2012","Jan 14, 2012","Jan 15, 2012","Jan 15, 2012","Jan 17, 2012","Jan 17, 2012","Jan 19, 2012","Jan 23, 2012","Jan 26, 2012","Jan 26, 2012","Jan 27, 2012","Jan 27, 2012","Jan 28, 2012","Jan 31, 2012","Feb 2, 2012","Feb 2, 2012","Feb 2, 2012","Feb 3, 2012","Feb 9, 2012","Feb 10, 2012","Feb 13, 2012","Feb 14, 2012","Feb 15, 2012","Feb 15, 2012","Feb 18, 2012","Feb 19, 2012","Feb 19, 2012","Feb 23, 2012","Feb 24, 2012","Feb 24, 2012","Feb 26, 2012","Feb 26, 2012","Feb 26, 2012","Feb 27, 2012","Feb 29, 2012","Mar 1, 2012","Mar 1, 2012","Mar 6, 2012","Mar 7, 2012","Mar 11, 2012","Mar 12, 2012","Mar 14, 2012","Mar 14, 2012","Mar 19, 2012","Mar 21, 2012","Mar 22, 2012","Apr 2, 2012","Apr 3, 2012","Apr 6, 2012","Apr 8, 2012","Apr 15, 2012","Apr 21, 2012","May 8, 2012","May 11, 2012","May 11, 2012","May 18, 2012","May 30, 2012","Jun 1, 2012","Jun 3, 2012","Jun 3, 2012","Jun 16, 2012","Jun 25, 2012","Jun 26, 2012","Jul 2, 2012","Jul 4, 2012","Jul 15, 2012","Jul 15, 2012","Jul 16, 2012","Jul 19, 2012","Jul 29, 2012","Jul 31, 2012","Aug 1, 2012","Aug 24, 2012","Aug 27, 2012","Sep 9, 2012","Sep 17, 2012","Oct 5, 2012","Oct 5, 2012","Oct 11, 2012","Oct 14, 2012","Oct 19, 2012","Oct 24, 2012","Oct 27, 2012","Nov 23, 2012","Nov 30, 2012","Jan 7, 2013","Mar 6, 2013","Apr 5, 2013","Apr 27, 2013","Sep 8, 2013","Sep 23, 2013","Oct 18, 2013","Nov 16, 2013","Nov 21, 2013","Apr 10, 2014","May 10, 2014","Jun 2, 2014","Jul 5, 2014","Nov 3, 2014"],["Comments","Amazing!!!!!!! Princess Donna, I genuinely have feelings for you lol","I can only say WOW ! I mean WOW ! !","it was a good scene,creampie and squirting would be perfect","Fair?! Are you KIDDING me? Some people will just very be satisfied...This is more like mind-blowing.","the best DP Gangbang ever !!!! (until now). Princess Donna i love you !","Donna how can I not admire you. Awesome!!!","Fantastic, maybe a little on the rough side for my liking, but i guess that\u0027s how Princess Donna likes it, so it\u0027s all good. Nice touch with Rain and Iona as cocksucking sidekicks. Really enjoyed when Donna was tied up on the chair and got her sexy ass fucked. Absolutely one of the best videos in here, Thanks Princess Donna and all the boys n girls, Excellent job","i came twice by only looking at the pictures! im gonna watch the vid now....its gonna be a looooooong night. LOVE YOU PRINCESS DONNA YOU ARE AMAZING!!!! \u003c3 \u003c3 \u003c3","\"Will leave you speechless\". Yeah, i\u0027m speechless. I subscribed this site only to see Donna Dolore ( \"pain\" in Italian)and can only say \"WOW!!!\"","I busted a nut, not once nor twice but thrice! Nuf Said...","what a beautiful production!! Princess Donna has a perfect and willing body and I could see that she really loves beeing treated by all these cocks! I enjoyed also the two women beside the main scene, they also new very good how to suck a cock and to give pleasure to men around her. What a pitie, I wasn\u0027t there! Now I will replay and then I can choose the scene for my very pleasure so faraway. Thank you, this is a very good fucking movie.","BAAAMMMMMM!!!!! 10 loads and counting!","Donna was great also I liked having Rain \u0026 Gracie as fluffers. More of the same please!!","really great ,,,,but i wish there were a foot worship in the whole process","The best GangBang ever !!!, gorgeous Donna.","Donna is un-real!! There should be a better rating than \"Great\". This is way better than Great. Thanks to all!!!","what can you possibly say after seeing a shoot like that? There are no words big enough, no thanks can be written heartfelt enough, simply no way to portray how wonderful it was. What you gave us Princess Donna was truly inspirational! It made me cry. Thank you thank you thank you. Every one of the guys gave it their all thank you thank you thank you. The ladies were a delight thank you thank you thank you. James Dean outdid himself thank you thank you thank you.You are all better than the best,every camera angle was perfect, the sound quality was awesome, the fantasy, perfection. Thank you thank you thank you. P. S. a special note for Princess Donna: if you place one drop of oil of cloves onto a teaspoon of honey and suck it slowly it will ease your throat. I hope there are a thousand hands to soothe you, and that you know there are thousands of virtual hands that wish they could. THANK YOU","UNFREAKING BELIEVABLE!!!i\u0027m amazed nobody didn\u0027t call 911 this is like the end of an era,how the hell can you possibly top this mayhem? Princess Donna,i hope you heal well,you gotta be hurting.GREAT SHOOT.","best scene ever, thx!","matt is simply the best there is. Donna too of course.","Greater than GREAT! Unbelievable that she endured that, and actually enjoyed it. This shoot is the reason I rejoined BGB, and it was worth the price of admission for the month. It will certainly be hard to top, or even equal this one. This kind of spoils us for anything in the future. Thank you Donna. You are fantastic!","I\u0027ve had to pause at two different parts, and I\u0027m still only just about at the end at 54th minute. Only thing to say is WOW. Just Wow. Um. Wow.Uhhh....\"Whoa.\" Princess, you are now a Queen/King. The realest moments are the hottest when you heard about getting two cocks and could barely muster \"Two...cocks?\" At other times (and I say this with no offense and in a positive way) absolute drivel was coming out of your mouth in fragments. Epic jibberish that Billy Madison would bow his cap to. lol.","WOW!","Foot worship? Really? Got a one track mind there... Donna is amazing, as always, and having the other girls there really added to the fun. You have now set the bar very high, and I hope that the folks at the Armory are up to the challenge.","Anyone that wanted something else, or thought this was lacking, must have died some time ago. This was fantastic!! When Donna is starring in a film, it is guarenteed outstanding. I think I will have to watch this about 20 times so I can decide my favorite part. It\u0027s a tough job but I\u0027m up to it (pun intended).","in the interview at the end she is in shock. that face got beat too hard its swelling up. probably looked like prizefighter the next day.","Outstanding shoot! Kudos to all and especially Princess Donna.","one of the Best scene ever!!","I liked the scene. No doubt. But I prefer PD as a mistress. If only another slave-girl could have endured what PD did here....I love PD to suffer things for sure...but I would love that to be just a part of her mistress role. Brilliant scene anyway","this is the holy mother of all gangbangs! they need to make a new rating for this \"Princess Donna\" words can not describe this shoot! I bow down to the princess of porn.","PRINCESS DONA always sets the standards when she is in the shoot and she did with this one, It was almost to realistic you had to remind your self were it was being filmed and that MATT was there and everyone was looking out for each other and they are all profesinals and very good at what they do,PRINCESS DONA was fantastic and has shown us that she is a very sppecial young lady many thanks to all that made it happen jh/uk.","This was a great scene. Good to see that Princess Donna take as good as she gives.","awesome, Princess Donna, you are the most incredible role player. I\u0027d love to see you gangbanged by eight dildo toting gals next","Very intense scene with hard face slapping!!!","Awesome show!! Is this what happens to every girl who drinks Old Milwaukee beer? LOL Just kidding. Thanks to all the folks at Kink.com who made this show possible. I loved the takedown the best.","This is why i dont leave this sight. The best yet.","Words can\u0027t adequately describe how great this production is; but they are all. I\u0027ve. Got. When someone as sexy as Iona is more of a side dish than a main course, it\u0027s a great production. James Deen is amazing at somehow keeping tension and focus going among all the other talented guys. Not sure if this would work, but after seeing Nacho Vidal on S\u0026S (Another amazing shoot!) I wonder how his super-aggressive style would work when paired with James\u0027s almost playful approach to topping. Can\u0027t wait for next week!","Uh. Well. Really what can you say except for \"thank you Donna\" for putting yourself out there like that for us. It was crazy good.","I joined just for this scene and wasn\u0027t disappointed. I LOVED the unrelenting violent and frenzied sex and how Princess Donna was brutally manhandled and beaten and used as a \"fuck thing\". Face slapping is a favorite too so this update was extra special. Princess Donna - thank you so much! It may be asking too much but I hope this scene sets a benchmark for future updates!","That\u0027s what i call ROUGH SEX. PRINCESS DONNA, Fantastic shoot,great, great performances. I have never doubt that you are brave to face this challenge. It is hotter and sexiest than i have dreamed. A master piece or the best gang bang ever seen. Thank you so much PRINCESS DONNA and thanks to all the crew. special thanks to RAIN and IONA.","Wow. That was so hot. That\u0027s the best shoot since Elise Graves. By the way, (in my opinion) the upside down, full throatfucking on the chair was what I\u0027ve been waiting for - It would be cool to get some underneath shots of her upside-down face and eyes while she\u0027s having a cock fucking her throat. Congrats Donna!","Thank you Princess. You\u0027re Gorgeous!","I cannot WAIT to watch this one! This is the gold standard we\u0027ve all been wishing for since the very beginning. Thanks Donna!","holy shmokes. i\u0027ve been corrupted to my very core.","OH MY HOLY FUCKIN SHIT ... PRINCESS DONNA you are AMAZING.... seeing u tied up would have been an extreme turn on for me and would have really pushed you and i know you could have taken it.... You r my Favorite as a sub and mistress and greatest turn on and always will be... GODDESS DONNA is more apropriate...","Girl takes a hell of a beating Fucking A","Amazing! What a trooper Princess Donna is! Unbelievably hot...","That was just amazing and Donna you set the bar 100 times higher than anyone ever thought. Rain and Gracie your efforts added to the shoot. Thanks everyone and I am betting no one can top that shoot???","OMG! Saying Amazing isn\u0027t doing this justice!! Great! Stupendous! Fantastic! Stupendous! Great job! Thank you for this one!","Have to agree with someone else who said poor Donna looked pretty rough at the end. She could barely speak. Hope she rested up afterwards. I sometimes wish I could sit down and talk with her and some of the other girls on here to see what they really think about doing these videos and bdsm in general. I can\u0027t say I\u0027ve ever been in a situation like this (and it is a wonder she wasn\u0027t gang raped in real life) but I do have some extreme fantasies myself as a woman. I gotta say though, I\u0027m not sure I could ever handle anything this rough. It was pretty out there. Still, in a weird way I see it as something to aspire to. But maybe the sex and submission shoots would be more my pace right now in real life, lol! Anyway, great job Princess, but I gotta give the video itself just a \u0027good\u0027 rating as this was a bit over the top. Hey, I\u0027m not dumb. I know most of your subscribers are guys. Still, there are some of us girls out there who do have gangbang or other bdsm fantasies. I guess I\u0027d like to see more shoots with good stories catering to us where the action isn\u0027t quite so extreme. I may not be explaining myself very well. Nothing in and of itself in this shoot was too extreme, I guess, but taken all together it seemed a bit much. Lots of choking, face slapping, being tossed around hard, etc--too over the top when it was all put together. Then again, I know that is Donna\u0027s style moreso than anyone else on here (except maybe Lorelei). Ok, I\u0027ll quit rambling now. I think the scene messed with my head a bit too much.","Speechless.","Awesome","Donna you are the dirtiest slut ever!!! Great show!!!","Big respect to the uncrowned Queen of BDSM. Great performance by Princess Donna again as in all of the shoots she does for you as always.","did u not have a mersee sign or word ,,,or did u not bother to use it... wow great fuck down","Princess Pain knows how to take as well as dish out. most real attitude out there. much props to the Princess","An inspiration. I really have to 2+ this year","I am impressed shitless! Another milestone!","I\u0027ve a feeling chills all along this shoot intensive,phenomenal!Thank you Princess.XXXXXXXXXXXXXXXXXXXXXX","really hot. slapping. atp. atm. love the dp moaning wailing. so submissive. I want to see a lot more of Princess Donna like this ! I\u0027m going to be hard all year now !","Whole lotta love for DONNA! Great++5* is not enough! Manny of us dream about Donna in kinky gangbang Manny of us ask kink.com for Donna in gangbang kink in comments Manny of us write for it at kinky Santa Klaus And Donna did it! Rough as possible, most impressive is how Princess donna take part of her long time experience with those reliables partners to push herself closer to her limits. (Look for small stop and start signs from Donna during hotest moments). For shure customer ask for more...??? With the success of this session and the number of new or renewed membership it drags to Kink.com the site can pay for Donna\u0027s upper-course in double anal and double vaginal...clamp games and other but its more an \"Armory style\"..... Even if kink is the style put in the \"glamour\" part of pictures some classical \"full-exposed\" model front and back, wide open,with a clear background just something like an agency pornstar book... And a chalenge for all of us: run the pornstars website with a shop section offering \"custom video\": give her a link to Donna\u0027s bound gangbang and ask for the same show; then report us the start list for girl ready to try it...","Great shoot, nothing much to add. One small issue though and I might be out numbered... but much less of the eye cum stuff would be great. Insta-boner killer.","I agree with fishguy. The eye thing may be submissive, butisn\u0027t at all sexy. Otherwise great sex!. The addition of the 2 other girls was a bit distracting. How do a bunch of guys crash a party and take advantage of the hostess, then when ththey take her inside, there\u0027s 2 girls already being fucked? Loved the face slapping! Go Donna!","Give credit to the guys who challenged Princess to the max. That made her rebellion all the hotter, because she was asking for MORE INTENSITY! Cumming in the eyes is a Japanese bukake thing and a turn-on. The Princess is the Queen, setting the standard for other subs!!!","I am at a complete loss for words. I never would have thought I would find a video shoot of this content and intensity so erotic. Then again, we had the worlds hottest adult film star, the worlds most talented director, surrounded by the best talent in the industry. OK, that explains it. Most sincere thanks to all involved. bkmax052","Incredible, amazing... just wow. My dom bought me a membership on this site for Christmas and this video does not disappoint. Even from a girly point of view it was incredibly. I love you Princess Donna!! xoxoxo","c\u0027est énorme !!!!","That\u0027s really, really the best ! Great job Donna ! Thanx to everybody beeing involved making this great film, and thanx to the house of course. It\u0027s a wonderful family of kinky people! P.","just one step more, schave er head!","I was breathless at the end. I had to stop several times to breathe. Beautiful work, in fact the best!","awesome scene. having 8 guys and the fisting were great. also the set up was the best, great abduction. only bad things i can say is no double anal and the like the girl inverter better","awesome performance by Princess Donna. She gives everything to her role and really gets into it to make it as realistic as possible. A fantastic role model to all others. Fantastic stuff!","a very good destruction! just one regret, next time make her full nude: schave her head!","\"make me\" Then pow pow/ slap slap.. Goddamn woman!! Epic!!","Absolutely fantastic scene - you have here clearly got past a certain limit in intensity and violence. Great to see Karlo Karrera and Christian Wilde being part of that scene. It is a pity though that Christian stays a little aside from the rest of the gang. Don\u0027t be shy, you are as fantastic as them - even more sometimes.","The best rapefantasy i ever seen. Love the hard and intence faceslappin. Only distaction,the two other sluts","awesome!!!!!!!!!!!!!!!!","Princess Donna that was damn fine piece of work.","Donna, you are simply awesome. My panties are drenched...","Why do these women only exist in these sites I want to experience this to for the first tiime how do I find one in my area or gett involved in your site exp. Im in phx az ericvirak@yahoo.com","I\u0027m a gay guy who used to subscribe to Bound Gods and out of out of curiosity found myself viewing some trailers on this site. Fuck me!! I thought Bound Gods had some good stuff but after watching this I\u0027m now hooked and have subscribed. Great looking guys and girls and some seriously hot stuff that anyone can get off to. It makes the gay stuff look tame! Truly incredible.","OUTFUCKINGSTANDING!!!!! I dropped my membership a couple of months ago because I thought it had gotten to tame but when I saw the trailer for this scene I had to resubscribe.PD you have just delivered one of the best if not THE BEST performances in the history of porn!! The intensity of the shoot was unbelievable and I truly thank you for taking one for the team.LOVED the faceslapping!! If the rest of the updates are as half as good as this one then I\u0027ll be a member for life. Again THANK YOU!!","been watching gangbangs for years...this is by far the best EVER i have seen....","this video was epic princess Donna Dolore you were near perfection i now have to recreate a similar scene with my submissive pet i may bring in her friends as fluffers as well JUST FUCKING EPIC","Not keen on the face slapping. Everything else was excellent!","Donna you made me proud!! You a hard core gang bang bitch now honey, yeaah!!!","Cum in eyes ! Stop that imediately !","Princess Donna you are Simply Amazing!!","Slapping face, pulling around by grabbing her hair, fucking all her dirty holes, using her like a big piece of sexflesh - and all that with the incredibly beautiful Princess Donna - I am overwehelmed. Every time when I switch one of the downloaded videos on, I only need several seconds to have a stiff one - and not many seconds later I shoot a huge load! Thank you, Donna. You don\u0027t know me, but I am a German man adoring you!","I have never, repeat NEVER, witnessed that level of brutality in a fantasy forced-sex scenario. I\u0027m at a loss as to how Princess Donna - or anyone for that matter - could possibly have endured it. I noticed her using the safe sign with her right hand several times during the chair scene when she was clearly unable to breathe and wonder whether this might not just have been too extreme, even for consensual participants. At the end she appeared distressed, notwithstanding her comments. All in all way too heavy for my taste.","DoctorDan, Thank you for expressing your concern for my well being. However, like I said in the end interview, I had the time of my life. Thanks xo Donna","Princess Donna ,you rock","Princess Donna - you are the Rafael Nadal of porn and have taken things to a whole new level. Legendary shoot. RESPECT.","Princess Donna needs to swallow the cum in her next scene","One of my *many* kinks (lucky me :) - is beautiful women who enjoy crossing the sexual boundaries - playing arousing games to ecstatic extremes - mind and body totally immersed in the experience. Male-female partnership can make the worst fantasy scenario glamorous - that\u0027s why its erotic to me - because I know its been set up so - Hollywood handsome hung men plus gorgeous girls - I can relax and sink into the dark side of erotica with intense pleasure - yet still feel comfortable that I\u0027m the chivalrous hero in rl. Thank you Princess Donna! Brilliant set, wonderful courage to play the game. Love you and the Freedom Frontier you\u0027ve created here.","Indeed one of the best ones in this series! More like this, please, more brutal!!!!!!","Yowsuh!","I don\u0027t know If I\u0027m gonna watch porn again. This Gang Bang flipped a switch. I am into cute love story porn from the 70\u0027s now.","Can you say perfect for my eyes! What turns me on is grunting because I\u0027ve done it myself with a partner. All the way through just grunting so into it makes want to get it that hard. If anyone can bring it like that I\u0027m game. But this Donna is so truly hot it made me wet and actually want to touch myself. It had a little bit of everything and I enjoyed it so much but that was the best of the best!!!","Freaking amazing. Definition of hardcore; Princess Donna.","No ONE is better than Princess Donna...love you girl","What i love about this one is it actually looks like a real gang bang. Awesome job!","She did really good, but it was a little too hardcore for my liking. I felt bad for her when they came her eyes. I hope she went home \u0026 took a long hot bath after that. Good job Donna.","WOW!!!! I\u0027m not done yet I lost it about minute 24 when she squirted all over the place, damn that was hot, tied up facefucked and squirting. Thanks again, this is the best site I have ever joined.","oh my goodnessssss WOW amazing scene ever!!!! i love you princess Donna","Truly incredible.","Princess Donna this was . . .in the strict terms of a gangbang, I can\u0027t imagine anything going farther and not being a crime. I\u0027m awesomely impressed...I think. This is a level of commitment that\u0027s rather stunning. At the same time I\u0027m a bit disturbed that only one other person mentioned that this was rather brutal. Don\u0027t get me wrong, within certain lines I full on believe consenting adults can do whatever the hell they want. It\u0027s more so the perception of it I guess. You get 20 people in a room and ask anything you\u0027d get like 18 opinions. Without fail, everyone here gave a great with only one other raising the fair suggestion that this was a bit . . .rough. There has to be a demarcation point between .... I guess I\u0027m asking where\u0027s the line? Not saying this was it; again the consenting adults thing, but wow.","I know what it is! With the different sites, we get accustomed to the personalities you guys put forth. In some sense it makes us feel we know you all on some level; particularly when people reoccur. For myself, I like it when a DOM plays the sub every so often. It\u0027s bad ass when one is put through their paces, but the familiarity, accurate or not, breeds a certain level of concern. As a gangbang, this was amazing. As a person watching it... a bit concerned. I guess it was the character break when you called James by his name. I imagine you all know each other though and he wouldn\u0027t knowingly injure you. Sorry for the second reply. Crossed my mind after the fact.","about time!! My wifes life fantacy!! She wants to join this site to participate live!! How does one go about it??? From Australia??","Best gangbang ever done ! And nothing will ever be as hard as this was ! But Tell me donna, is it only me ? But you and your girls seems a little sad at then end we kinda feel a strange vibe ... were you feeling good after it ? I guess its a normal reaction ... Love you ! xxx","OMG. wow, princess donna u are a maniac. i love it. i just wish i coulda have participated in one of the best gangbangs i have seen. you r amazing and i want to thank you for what you do and keep up the great work. mike","very nice but i can not donwload how must i do ?","Wow that is good stuff","WOW. Princess Donna you are amazing. Not so sure I could go to the limits you have but damn you make a girl want to try! Thanks for the wonderful video!","Princess your are the best. I enjoy to see film with you very hard I saw often you in public disgrace. Very excinting keep goinng i am waiting fot a new gang kiss you i love you","some guys too much into choking than fucking, too much into slapping just to do it, not as punishment, but just to be doing it. I like forced performance better. This scene way too rough, no matter how much she got paid. Want my money back. I need to back down to four stars instead of five star shows. You guys play way to rough for me, though I like it pretty rough.","Super, i am wainting a new gang whith princess donna she is fantastic realy sexy and a good slut Alix from Belgium kiss for you Donna wpf2@hotmail.com","the action in my opinion move to o fast to focus ones attention and hence ones eyes upon any consistent energy flow, The actors were terrific and so on , my greatest critique is as a piece of mastabatory fantsy i ,personally prefer slowed action sustained energy and less of a frenetic pace.","for those curious to know how much I got paid to do this shoot, the answer is NOTHING! I did it for FREE because getting fucked like that was payment enough for me! :)","i love it. i think the best part of it is when she fights back. shes trying to get them to play more rough. she likes it to hurt. i came within minutes and im a lady. :]","wow wow","Donna is without compare with this shoot. I cannot imagine anyone doing a better role play, this shoot is worth the price of membership by itself.Thank you Donna and all the KINK staff.This shoot sets the standard,which makes it tough on the other fine shoots.","Amazing!Mind- blowing. I could barely see 25 minutes of the movie and I came twice!! Great movie- really hard to find this quality out there.. Princess Donna- well done.. ;)","In ancient history Genghis Khan would after invading countries set about impregnating the female population personally. Genetic tests prove this to be so. Princess you and the girls and boys went some way of replicating these historical scenes. We think you are all so fantastic!!","Impresive.","Great, but some of the hardcore scenes should be left to the pros. Amateurs may hurt each-other way too much. As Rain said mind-blowing. I stand in awe.","You\u0027re so hot, Princess Donna!","best","excelent!","just watching the trailer for this shoot made me subscribe and i was in no way dissapointed. this was the best shoot ive ever seen and it will take alot to beat it, but im sure that kink and princess donna can come up with something rougher and sexier, i dont think we saw the princess pushed to her limits, i cant wait to see whats next","Princess, i would love to see you leading a gang of guys in abusing a girl who offended you but then the guys turn on you and abuse you both, could this ever happen? is there another model like you who can take that much abuse?","full on!","Uhhh...WOW! That\u0027s all...hard to think straight. Wow. Princess Donna, you are like the Superhero of Kink. Never have I seen a woman portray such strength and endurance while looking so fucking sexy. Why the hell is there no higher rating than weak-ass \"Great\"? You are \"God Mode\" level. Respect and lust, all coming your way, Mighty Goddess.","Honestly Great does not do this justice! Princess Donna you are Amazing! As a woman myself who love rough sex, all I can say is you are my idol! I had to rejoin this site just to see the video! I don\u0027t know how anyone could eve top this! I hope you do another one soon!","love this update because the princess is realy a great bdsm-wommen like her body like her intense work at kink and love the thousends sides of a realy goddess","Long live Princess Donna! Long live the Princess!","Just the perfect scene to my eyes--beautiful woman getting pounded mercilessly. Princess Donna is beautiful and the anal and dp pounding she takes is just unbelievable. Thanks to all for producing one of the best mind blowing scenes!","Princess Donna, I have been looking at you online for some time now and feel it appropriate to thank you for the pleasure that you have given me over the years. As a southerner where courtesy matters, it seems appropriate to thank you for the pleasure you have brought to me and to all who have watched you. Princess, I try not to spent too much time or much money on porn sites, yet time and again I find most often that when I do spend money here it is most frequently on a shoot that you are in. There are hundreds of beautiful and luscious young women on the Kink sites, each of whose bodies would be a delight to use. Yet the truth is that most of them are completely interchangeable and of no more than simply a body. Very few call strongly in any was or evoke any real interest or passion. Once you have watched them in a scene and moved on to the next body in the next scene, they are eminently forgettable. Yet that is not the case with you. What is it about a face or a person that calls so strongly to us? While I hardly can answer that in any definitive way it seems clear that two things area obvious. First is a sense of a strong personality, a powerful presence; a person of character, with a clear sense of who they are and their worth. It is what makes you watch one actor or dancer whenever they appear on stage or in a film no matter how many others are present. If I may quote to you a small part from a poem of mine from several years ago, perhaps this best explains my thoughts. When ancient Warriors Returned from Battle It was not some fearful Timid begging girl, Some palace slave, Broken and crying That they wished to drag Naked and crying In chains behind their Chariot. No, it was a Queen, Haughty and Tearful with Anger, Proud and defiant of her fate, Her exposed breasts thrust forward, Her head high, Wearing the ropes that bind her As if they were queenly garments Chosen with care to best Proclaim her Beauty. It is such a captive Queen, A fierce and prized Jewel Dazzling to the Eye, Beyond compare or Price That would best proclaim For all to see, The Power of the Warrior Whose chains she wore. It is such a Queen Dangerous with Lust That would fill the gazing eyes With envy for the Warrior Who held her captive. Surely Princess Donna that is you. Whether you are acting as a Dominant Mistress or are being enslaved, raped and abused, that is you. Your power and your presence always proclaim you as a force to be dealt with in whatever scene you are in or whatever role you are playing. You are the focus of our attention whenever you are on camera no matter in what role. In a scene with others, it is difficult to pay attention to anyone except you. The second thing that calls strongly is a face. Not some flawlessly beautiful yet bland face, but rather one that has both character, some sense of a unique and strong individuality and some honest and open vulnerability. What do I most want to SEE as you are being raped and tortured? Your face. The pain in it, the height of passion and desire it is capable of expressing, the tears and innocence as you beg whatever master is abusing you to please only give you more. The Innocence. What a strange word to use here, and yet that is exactly the right word. When you are helpless before others, your face is completely open and without guile. You do not hide your pain or your pleasure, or your desire, but rather let it take you completely. Your tears and your screams are completely unguarded and unrestrained. Nothing is more moving. What beauty! There is nothing more beautiful than your exhausted, tear-streaked face, especially when it is covered in Cum. Again thank you. As always I wait to see on screen again.","Amazing, mere words in ANY human language can\u0027t describe what a great gangbang slut Princess Donna is. She definately takes it as well as she dishes it out.","A work of art, a very well thought out shoot, with extras like the Cecil B De Mille of porn. The psychological element of there being two other women already held is a really horny idea which reinforces the idea that Donna doesn\u0027t stand a chance and Donna putting in a performance the equal of a prize fighter; what a woman.","Amazing!!!","Truly awesome, thank you to all involved...downloaded it and jacked off to it. Nuff said.","Such stuff as perfect wet dreams are made of. My dick stayed hard for a week just thinking of this Gone with the Wind epic porn. For a darkside rookie I am amazed and awed. And an instant devotee of this site. The cum in the open eye did make me wince, but I\u0027ve learned to fast forward quickly to keep my dick still throbbing. Princess Donna? Fuck no. She should be the Queen of Queens Donna.","Fucking amazing! Donna you are the Queen of erotica. This was brutally artistic and despite the content deserves to be viewed as such.","That\u0027s the HOTTEST scene... I have ever seen..Congrats ..Donna..","Iona is the best model ever. Uncool she hasn\u0027t been the main attraction on BG so far... fucked in the ass, bare soles facing the camera...","This is a great update! Princess Donna plays the perfect girl in a bad situation. When she realizes she\u0027s \"alone\" at the party, her facial expression is priceless. You can see the fear she\u0027s feeling! Great work!! I wish you had more like this.","That is the best video... I have ever seen period...","Fantastic!","Mind-blowing! Donna, you are the Dark-Princess of hardcore. Never before have I seen a porn-shoot that exceeded my wildest fantasies, you are a Sex-Goddess. You should get paid and worshipped everytime we stream or d-load this movie...you\u0027re a magnificent \"CUNT\".","Donna\u0027s gotten her just praise for being a wonderful piece of fuckmeat, but let\u0027s hear it for the fellas, shall we? Now, that is how MEN take down a bitch. Just top notch work, like watching a team of male athletes make play after glorious play and just dominate the field. Every feminist should have to watch this so as to properly adjust their perspective. This is place where the curtain is forcefully drawn back and they get to witness the naked truth of what it means to be a split-tail.","The only thing missing was double anal still a great scene though!","like the sadistic way of James Deen and would like to serve Him myself","although i\u0027m gay, i get a stiff one, seeing the sadistic way of James Deen. would like to submit to him, if not physically, than financially","Great Shoot..... mmmmmm You know how to please Princess Donna...... love what i have seen so far...","awesome!!!","PD sets the bar too high,not even Rain can approach her on this site.I cannot imagine any other shoot equaling the intensity/stimulation value of this shoot thanks to PD.","hot how the slut in 31th minute is forced to her climax...","After seeing the previews i was excited.... now after seeing the full shoot it was more than what i was expecting...... it was awesome..... how Princess Donna cumz like that is a real turn on.......loved the scene setting and background action too....can only say EXCELLENT SHOOT ...","Donna great that you take it,decent..Your a slut..Next take more cum up your tail..thanx..","HOLY FUCKING SHIT!!!!! NO ONE IS BETTER THAN DONNA!!!!!!!!!!!!!","Princess Donna, I love all the liquids dumped on you during the beginning blowjob. A woman soaking wet while giving a blowjob or getting fucked is so hot. The slapping and spitting was a major turn on as well; and the final bukkake finish was to die for. Great job!!!","This was the soul reason I joined this site and I couldn\u0027t be anymore pleased. Just... art I could watch it over and over. Now all i need is to get Donna on Public Disgrace and I will be able to die happy.","princess Donna .. you are the absolute best .. you are the hottest ..this is the best scenario ... I LOVED CHOCKING .. SLAPPING ... OH HELL YEAH ...","james dean is the shit","My tribute eo James Deen , Mr. Pete , John Strong , Christian Wilde , Tee Reel , Jon Jon , Karlo Karrera and Ramon Nomar! They really knows how to use this fantadtic whore.","The unofficial first entry into the Princess Donna gangbang trilogy. Some of the most hardcore fucking on the internet. Extremely satisfying hopefully a fourth entry is planned..","no offense to princess donna...i love porn more than ever because of her...she just doesnt do it for me. plus shes the effin boss talking to and taking care of all the girls....so you hear her in almost every production, so there is no mystery on the woman acting the role here. the scenes are a lot less believable when Donna Dolore participates. she hot but like i said no mystery. you guys recruit amazing girls too...all shapes and sizes from all over...Remy Lacroix is my fave girl since i saw my first porno at 6 years old.","THIS IS WHAT I WANT OUT OF THIS SITE. Awesome. I am so jealous! Didn\u0027t like all the slapping but that\u0027s just personal preference. Loved the fisting though a little short. This performance sets the bar - very high. Thankyou so much - I cum twice watching this. Nearly three but started giggling out of jealousy in the best possible way. Plus donna you are gorgeous, just how I like my ladies. Tall, slim brunette with real boobs and a beautiful face. You looked fucked at end, like you just had the best sex ever. Congratulations and well done. Xx","Fantastic best ever!","Greatest shoot in porn history! You are the best Donna.","the best","Nice, great, fantastic, confratulations","Even years later I keep returning to this shoot. It is simply the most compelling I have ever seen. Nothing, absolutely nothing is as compelling as Donna\u0027s Face when she is fucked and tortured to exhaustion and her face is destroyed, dazed and covered with Cum.","Donna you have no equal on this site!"],["Name","aswain","DARTHVEDA","macload","raindegrey","mmystery2","skyrocket","loftxx","afrooman","Tonymiles","9username","wolfie-lupo","afrooman","ramon1","slave122367","dibste","patpuddin","switchbitch","chaz1637","Willem58","pp-hivdoc","Nort12","ahyeah","looniearndt23426","DaunBurnel","Bamaking","zambot3","richa333","oppa8899","sisla76","littlebratt33","R1YAM","racerx20","sinc11","hfd54hg165e","assfix","loveroflife2","alludar","loon","minbari1","spider59","Justinianus565","davrom96","bee_hill","mike1151","fish74","snatchhunter","lotusdrops","richm1957","lonewolf82007","kinkysubslut","siya1369","simplyq51","sotomoto64","menips","Albertaman","strangeheadz","3cockguy","Katrin_Horn","woolfdenice","BONNIEDP","phane951","fishguy","heavyhand","drummer5","bkmax052","PleaseFillMyAssMister","Ph33Dp","SIRPE","ledresseur","justhiny","atlass420","rudifahrer","ledresseur","iwantjamesdeen","claude40","lenjan","lsea","sgd8202","wetvenus","ericedv","johnnyb40","jailbird73","abhikm","wolfmaster86","dkidd","gangbangbitch","trodou","spider1971","Bukkakefan01","DoctorDan","princessdonna","firehosefreddie","bigbadbootydaddy","rimmeyd","CyPh1","dom4slut9","Skydawg","kris1983","sharlenesueparkman","perv69","mistresslela","phaz","rockyhorrorpictureshow","satyr1968","muttcha","ironman92","bnewbie","bnewbie","fredanddragon","Hellavenger","mikeyjmikey","alixnox","ffats","subgirl2abuse","alixnox","Yobster","alixnox","drtony","princessdonna","punkrawkchicka","antbank01","flowerto","victoriaperga","Bristol40","monalizamo","tyu689jkl","eloque","pathosandethos","Micro333","dumbass154","dumbass154","freeborn2","Reddwarf12","ScorpionSlut","winfried666","kake310","vinpin08","silktiedancer","seeker61","CockandMe","Wautschi","necromancing777","ironnick","rdstrkr","sbutler","cfdocr","illk95588","sbutler","Wautschi","AnalHolic01","Cervixbuster","knicks30","jhvdv","jhvdv","brina100","pieterkarel","flowerto","jhvdv","brina100","sinacastic","lickmeclean","Talos84","mike25box","themasterpiece","naturally","lenjan","Mutantmo","rockish","Analslut123","jinifre","threesome9736","grandmastertop","Poezwoef","silktiedancer","flowerto"],["","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""],["Vote","Great! (5)","Great! (5)","Fair (3)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Good (4)","Great! (5)","Great! (5)","Good (4)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Good (4)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Poor (1)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Good (4)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Below average (2)","Great! (5)","Fair (3)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Fair (3)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","Fair (3)","Great! (5)","Great! (5)","Great! (5)","Great! (5)","-","Great! (5)","Great! (5)"]],"pageTitle":"The Party Starring Princess Donna","title":"","url":"http://www.boundgangbangs.com/site/shoot/15913-The-Party-Starring-Princess-Donna.html","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"RELATION","tableNum":1,"s3Link":"common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987662.63/warc/CC-MAIN-20150728002307-00237-ip-10-236-191-2.ec2.internal.warc.gz","recordEndOffset":66501523,"recordOffset":66460764,"tableOrientation":"HORIZONTAL","TableContextTimeStampBeforeTable":"{7548\u003dJan 4, 2012 - Performers: Princess Donna Dolore , James Deen , Mr. Pete , John Strong , Christian Wilde , Tee Reel , Jon Jon , Karlo Karrera and Ramon Nomar}","TableContextTimeStampAfterTable":"{108204\u003dsatyr1968, 18531\u003dslave122367, 52412\u003drichm1957, 80966\u003dlenjan, 3862\u003dYou\u0027ve seen Princess Donna submit. You\u0027ve seen her abducted. You\u0027ve even seen her utterly destroyed. But you\u0027ve never seen anything like this... For the first time ever, Princess Donna is brutally dominated, double penetrated, fisted and humiliated by 8 merciless thugs in the most intense gangbang you will ever witness. She endures extreme pain, strict bondage and hard, depraved fucking that will leave you speechless. The most epic gangbang in Kink history arrives January 4th. Watch Donna do her very first gangbang the only way she knows how - 100% hardcore with no holds barred. Do not miss it. Directed by Matt Williams, 53330\u003dlonewolf82007, 92206\u003dspider1971, 56470\u003dsiya1369, 48613\u003dmike1151, 22992\u003dchaz1637, 102421\u003dkris1983, 189843\u003d18 U.S.C. 2257 Record-Keeping Requirements Compliance Statement   All material shown on this website is consensual. No model was harmed during the filming of these movies.  Copyright ©2015 Kink.com}","textBeforeTable":"kink.ratings.ajaxRatingSubmitInit(); // INIT // } }); return false; }); } $(\u0027.knk-shoot-rating-error\u0027).fadeIn(); error: function (xhr, status, errorThrown) { }, $(\u0027.knk-shoot-rating-help\u0027).fadeIn(); success: function (data, status, xhr) { dataType: \u0027json\u0027, data: \"shootId\u003d\" + 15913 + \"\u0026rating\u003d\" + $(\u0027select[name\u003drating]:first\u0027).val(), url: \"/site/rating_submit.jsp;jsessionid\u003d4960CB51531C5FB827382EA7181DB6D1\", $.ajax({ e.preventDefault(); ratingSubmitBtn.on(\u0027click\u0027, function (e) { var ratingSubmitBtn \u003d $(\".knk-rating-submit-btn:first\"); kink.ratings.ajaxRatingSubmitInit \u003d function () { // Ratings // kink.ratings \u003d kink.ratings || {}; var kink \u003d kink || {};","textAfterTable":"Stay Connected: Kink.com BDSM/Bondage Fetish Gay Femdom Kink On Demand Pay Per View Kink Live Live Shows and Cams Kink Archive Classic Kink Behind Kink Behind the Scenes ArmoryStudios.com Buy Tour and Workshop Tickets BDSM Resources Education","hasKeyColumn":true,"keyColumnIndex":2,"headerRowIndex":0}