{"relation":[["Date","Apr 5, 2004","Sep 16, 2008","Aug 18, 2011"],["Code","AS","CC","FPAY"],["Event","Assignment","Certificate of correction","Fee payment"],["Description","Owner name: BIRMINGHAM SYSTEMS LIMITED, GREAT BRITAIN Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:LEEPER, KIM D.;REEL/FRAME:015172/0741 Effective date: 20040301","","Year of fee payment: 4"]],"pageTitle":"Patent US20030195935 - System and method for authenticating electronic documents - Google Patents","title":"","url":"http://www.google.com/patents/US20030195935?dq\u003d5537618","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"RELATION","tableNum":8,"s3Link":"common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992543.60/warc/CC-MAIN-20150728002312-00117-ip-10-236-191-2.ec2.internal.warc.gz","recordEndOffset":492070511,"recordOffset":492047350,"tableOrientation":"HORIZONTAL","textBeforeTable":"Patent Citations [0089] A skilled person will appreciate that variations of the disclosed arrangements are possible without departing from the invention. Accordingly, the above description of several embodiments is made by way of example and not for the purposes of limitation. It will be clear to the skilled person that minor modifications can be made without significant changes to the operation described above. [0088] An advantage of the present invention is that it provides a system in which individuals are the authorised users, not machines. Hence, if for example a user logged into his pc, but left it unattended, a third party could not send an authenticated e-mail. A further advantage is that the use of a biometric characteristic means that the user does not need to carry around additional equipment or even remember a code number. This means that the system is much simpler for user to operate. In addition, the system is easy to adapt to user\u0027s needs. [0087] Whilst the biometric reader is shown in the accompanying drawings as being in a unit that is separate to the pc, it will be understood that it could equally be included in the main body of the pc itself. Alternatively, the sensor could be incorporated into, for example, the keyboard or the mouse of the pc. [0086] The systems described above specifically use pcs for sending","textAfterTable":"* Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US7254619 * Oct 5, 2001 Aug 7, 2007 Matsushita Electric Industrial Co., Ltd. Apparatus for outputting individual authentication information connectable to a plurality of terminals through a network US7263347 * May 24, 2002 Aug 28, 2007 Cingular Wireless Ii, Llc Biometric authentication of a wireless device user US7502934 Dec 16, 2003 Mar 10, 2009 Sap Aktiengesellschaft Electronic signatures US7581105 Dec 16, 2003 Aug 25, 2009 Sap Aktiengesellschaft Electronic signing apparatus and methods US7684071 * Mar 30, 2004 Mar 23, 2010 Konica Minolta Business Technologies, Inc. Data communication device, computer readable medium and method for transmitting and managing data US7849013 Apr 11, 2005 Dec 7, 2010 At\u0026T Mobility Ii Llc Secure online purchasing","hasKeyColumn":true,"keyColumnIndex":2,"headerRowIndex":0}