{"relation":[["Route","Route 201","Route 202","Route 203","Route 204","Route 205"],["Terminus","Gaithersburg (WB) BWI Airport (EB)","Gaithersburg (WB) Fort Meade (EB)","Columbia (NB) Bethesda (SB)","Frederick (WB) College Park (EB)","College Park (WB) Germantown (EB)"],["Operated by","Atlantic Coast Charters","Eyre Bus Service","Eyre Bus Service","Eyre Bus Service","Eyre Bus Service"],["Corridors served","I-95 I-195 Intercounty Connector","MD-32 MD-29 Intercounty Connector","U.S. Route 29 Intercounty Connector","I-270 Intercounty Connector","MD-355 Intercounty Connector"],["Places Served","Shady Grove Metrorail Norbeck","Shady Grove Metrorail Norbeck Savage MARC","Snowden River Park-and-Ride Mall in Columbia Scaggsville Park-and-Ride Burtonsville Park-and-Ride Georgia Avenue Park-and-Ride Medical Center Metrorail","Urbana Park-and-Ride Monocacy MARC Gaithersburg Georgia Avenue Park-and-Ride FDA UMD-College Park College Park MARC/Metrorail","College Park MARC/Metrorail Miurkirk MARC Shady Grove Metrorail LSI HGS NIST"],["Total trips (AM/PM)","Hourly","3 AM 4 PM","3 AM 3 AM 1 Midday","4 AM 5 PM","3 AM 3 PM"],["Operating since","March 2011","March 2011","January 2012","January 2012","January 2012"],["Other notes","Only Commuter Bus route to operate every day, with midday and off-peak service.","","","",""]],"pageTitle":"List of MTA Maryland bus routes - Wikipedia, the free encyclopedia","title":"","url":"https://en.wikipedia.org/wiki/Route_922_(MTA_Maryland)","hasHeader":true,"headerPosition":"MIXED","tableType":"RELATION","tableNum":7,"s3Link":"common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989043.35/warc/CC-MAIN-20150728002309-00079-ip-10-236-191-2.ec2.internal.warc.gz","recordEndOffset":874563799,"recordOffset":874530298,"tableOrientation":"HORIZONTAL","TableContextTimeStampAfterTable":"{146530\u003dIn 2005, as part of the Greater Baltimore Bus Initiative, MTA planned to shorten the route to Jessup and require riders to transfer to Howard Transit\u0027s Purple route in order to reach Laurel, and to reduce the number of daily trips on the line. This plan was fought by riders and the Howard County government, and no changes were made on the line.}","lastModified":"Thu, 30 Jul 2015 21:50:06 GMT","textBeforeTable":"Local routes[edit] 12 External links 11 References 10 Former bus routes 9 Commuter Bus routes 8 Intercounty Connector Bus routes 7 Express routes 6 QuickBus routes 5 Local Express routes 4 School Supplementary routes 3 Shuttle and Circulator routes 2 Neighborhood Shuttle Bug routes 1 Local routes Contents Note: (Crosstown) \u003d Bus service that is traveling across the city of Baltimore without going through the downtown area. The following is a list and description of the local, express and commuter bus routes of the Maryland Transit Administration, which serve Baltimore and the surrounding suburban areas. History of MTA Maryland See also: search navigation, Jump to:   (Redirected from Route 922 (MTA Maryland)) From Wikipedia, the free encyclopedia List of MTA Maryland bus routes","textAfterTable":"Patterson Park 30/35/50/35/25 Pennsylvania Avenue-Canton Line Route 8 Lutherville Light Rail Stop (NB) University of Maryland Transit Center (SB) Bush Street (1) Kirk Avenue (3) Greenmount Avenue/York Road Fayette/Baltimore Streets Goucher College Towson Town Center Towson Towson University Belvedere Square Senator Theater Govans Waverly First Mariner Arena 15/15/15/15/30 Greenmount Avenue-York Road Line Route 9 Lutherville Light Rail Stop (NB) International Circle (SB) Kirk Avenue (3) York Road Deereco Road Warren Road McCormick Road Timonium Light Rail Stop Timonium Fairgrounds Cockeysville Warren Road Light Rail Stop McCormick Industrial Park","hasKeyColumn":true,"keyColumnIndex":0,"headerRowIndex":0}