{"relation":[["Rating","Negative","Negative","Negative","Negative","Positive","Positive","Positive","Positive","Positive","Positive","Positive","Positive","Positive","Positive","Positive","Positive","Positive","Positive","Positive","Positive","Positive","Positive","Positive","Positive","Positive","Positive","Positive","Positive","Positive","Positive","Positive","Positive","Positive","Positive","Positive","Positive","Positive","Negative","Positive","Negative"],["Author","birdnett Hialeah, FL (1 review) September 4, 2007","bjrobertson Birmingham, AL (1 review) August 10, 2007","hdlemp Salisbury, MA (1 review) August 1, 2007","pamweigle Zionsville, IN (1 review) June 20, 2007","visenders Brownsburg, IN (1 review) June 8, 2007","brendan1 Chicago, IL (1 review) June 3, 2007","aedoisher Slidell, LA (1 review) May 12, 2007","insearchofgreen Los Angeles, CA (1 review) May 7, 2007","nylynn3 Dayton, OH (1 review) May 7, 2007","sajwani Dobbs Ferry, NY (1 review) May 7, 2007","Smile27 Forestville, CA (1 review) May 7, 2007","Terrte Jewett City, CT (1 review) May 3, 2007","mcnicols Grand Island, FL (1 review) April 27, 2007","lbb_gardens Galveston, TX (1 review) April 20, 2007","thelibertybelle West Lebanon, NH (1 review) March 31, 2007","emgo Water Valley, MS (1 review) March 25, 2007","dnlventures Arvada, CO (1 review) March 24, 2007","gcmd Simi Valley, CA (1 review) March 23, 2007","jerrynmn1 Wantagh, NY (1 review) March 22, 2007","angiebarker123 Medford, MA (1 review) February 23, 2007","VickiSp Atlanta, GA (1 review) February 16, 2007","lourdes49 Austin, TX (Zone 8b) (3 reviews) February 14, 2007","tfjonas Somis, CA (1 review) January 20, 2007","arkansas_mommy (1 review) January 19, 2007","davidjhale Minneapolis, MN (1 review) January 12, 2007","catmanstew Northville, MI (1 review) December 16, 2006","norinne Stanhope, NJ (1 review) December 2, 2006","reddunqtr Anderson, CA (1 review) November 27, 2006","LadyLeaf Santa Maria, CA (1 review) November 25, 2006","tenberg Hewitt, TX (1 review) November 14, 2006","gardengirl1960 Seabrook, TX (Zone 9a) (9 reviews) October 21, 2006","CanadianHillary Ottawa Canada (1 review) October 21, 2006","DEELISHUS210 Milwaukee, WI (1 review) October 19, 2006","maschmidt Valentine, NE (1 review) October 15, 2006","planetxhunter La Crosse, WI (1 review) September 9, 2006","ethaven San Clemente, CA (1 review) August 12, 2006","writeswithafist Las Vegas, NV (1 review) August 4, 2006","ceallachg Manchester, NH (Zone 5a) (2 reviews) August 4, 2006","poofer Reading, PA (1 review) July 14, 2006","icarus_fl Jacksonville, FL (1 review) July 6, 2006"],["Content","At the beginning of July, 2007 I ordered a ZZ plant to be sent to a friend who just moved to Melbourne Florida. I paid HousePlants4Less $79.95 through PayPal for this plant. It was never delivered but I was billed through PayPal. I e-mailed HousePlants4Less, numerous times and called their contact number, leaving messages. No answer. PayPal opened a claim but was not able to retrieve funds from their account with HousePlants4Less, to credit my account. The case was finally closed, unsuccessfully. I\u0027m out $79.95. Fortunately I was able to order the plant and have it delivered through a reliable on-line company. I want my money back. I am very disappointed with HousePlants4Less and I found that paying through PayPal is no guarantee. So much for trust on the internet. This is my first disappointment with internet shopping.","It is a shame that a company that had such glowing comments as this one did, has made a complete turn around for the bad. Briefly, I placed an $80.00 order for two plants that I could find NOWHERE else. It didn\u0027t take long to realize that I not only wasn\u0027t going to get my order but I also wasn\u0027t go to get a response to e-mails and phone calls either. I just want my $80.00 back. By the way, I finally found one of the plants I was looking for at Lowe\u0027s. The other one, String of Beads, I\u0027m still looking for.","On June 14 they charged my credit card $43.14 and I never received the plant I ordered! I e-mailed then six times, every reply was \"we received your e-mail and will get back to you!!\" which they never did!! I also phoned about ten times over three days and only received a busy signal. I think other people should be warned to avoid this company.","I placed an order on May 14, 2007. My checking account was charged $39.95. I waited two weeks for the shipment of my plant, then contacted the web site and e.mailed to ask where my plant was. I canceled the order three weeks later, no response from Houseplants 4 Less and no credit. I expect a credit issued to my checking account or a credit issued from you company by the end of this week. I have called your company long distance and left two messages. This is NOT what I expect from a reputable internet service. I bought the plant elsewhere, so no longer want the plant as restitution. I just want my money back. It has been over 30 days now and no response from your company. That is bad business. I have contacted my bank to see what can be done about this, but I hate going that route because that will involve extra fees for you, when I feel this is probably an oversight and can be rectified immediately if you will just take the time to do it. Please correct this situation immediately. I will expect a credit issued or a phone call to take care of this matter. Pam Weigle","I\u0027ve ordered several plants from Houseplants4less.com and they are all wonderful. The ZZ plant is my absolute favorite!!! The plants always arrive bigger than I\u0027m expecting and they look amazing...they don\u0027t look like they\u0027ve just been shipped across states, and they look better than the ones you can buy at your neighboring stores. I tell my friends about this site all the time, especially if they are looking for a housewarming gift for something nice for moms. Customer service is unbelievable...if you have a question or need something specific, Bobby will email you or call you back and help you out. A wonderful experience in online shopping! Thanks Bobby!","I ordered a plant that arrived when I was out of town and it sat unopened for a week. I asked if House Plants 4 Less would give a discount if I ordered another. Instead they offered to send a replacement plant free of charge if I paid for shipping. They called to tell me when the replacement plant had been shipped and it arrived safe and sound. My other experiences with House Plants 4 less were positive too, but this is the type of customer service that is hard to come by anymore. C King Chicago","I purchased a diffenbachia tropic snow, which hasn\u0027t been an easy plant to find. It arrived just one week later. It is in PERFECT condition. No yellow on the leaves or any signs of stressful shipping. I thank you all at Houseplants4less so much. Great job.","Hello! I received the plants today, they all came in a perfect condition. I am very pleased with the order and your service, I will come back to your site soon for more orders and also refer my friends to your site as well. Thank you! Best wishes to you and your business, Christy from Los Angeles","I usually like to see and feel my plants before I purchase them so I was a little nervous about buying on line. Bobby however make it an excellent experience. The plants I ordered are beautiful and just has if I picked them out myself. Bobby is so customer focused he even called me personally and made suggestions regarding the plants I ordered. I will definitely purchase from this site again.","This company is great, the customer service is fast and personal. Stay on top of when you would like your item to arrive and it will happen the day you like. Bobby is very nice and upgraded my order free of charge because it was a special gift. I would recommend this site to anyone. The only \"negative\" thing I can say is the website itself could probably use a bit of a facelift, but again products, prices and customer service are fantastic!","What do you do when you can\u0027t find a houseplant anywhere locally? Order online? Really? I found House Plants 4 Less and was impressed by the huge selection. But what particularly caught my eye was the \"surprise box\" and \"click here to hear Bobby\". I loved the idea of a surprise, and Bobby\u0027s commitment and certainty..... \"you\u0027re gonna be happy\". I had so much fun anticipating the surprise! I was also curious as to how he handled the shipping. The beautiful plants arrived safely. Not a single broken leaf. There was a slight mix up in that an email said 5 were coming - one being a cactus, and the other 4 being Surprises. 4 were surprises, and so was the lack of the cacti. It only took an email and I am now looking forward to the cacti coming on it\u0027s own. I recommend this website and service to anyone. It\u0027s fun, friendly, professional, and exceptionally customer service oriented.","I never bought a plant online before. I hesitated. I couldn\u0027t help to think what kind of condition my plant would come in if it were being mailed, and in what kind of container would they use to ship it in? Do I really want to spend 36.00 on a plant that I haven\u0027t seen? Well, my mind was put to rest when my package arrived in the mail. I was so excited to open the package. The plant was packaged in a box filled with tons of packing peanuts. The leaves were wrapped around the plant in a way that would be safe. There was no dirt falling out of the plant into the box. The only minor inperfection was the plastic pot was cracked and chipped where the hanger fits into the hole. So now I need to go buy another plastic pot if I can find one. It seems ceramic and clay are the choices of Home Depot. Never the less the plant was absolutely PERFECT!!!!!!! It was just what I wanted. Did I pay too much for a 6 inch Rosary plant? Perhaps, but it was what I wanted, and it did include shipping. You get what you pay for and the plant is beautiful. The one thing I would include in peoples order and that is the care instuctions. I already know how to care for this particular plant so not receiving any instructions is ok, but If I didn\u0027t know about this plant then I would have to get back on line and ask Bobby K. Bobby K Is a very friendly person to talk plant business to. He answered all of my questions in a very short time. Thank You Bobby! If I need any plant questions answered I will certainly contact you. Will I do business with you again? Absolutely! I grade my experiance a A-. I had to take off a bit for the broken pot.","Received my mother-in-law\u0027s tongue plant today. Packaged very well \u0026 arrived in excellent condition. My plant is full, lush, beautiful, and very healthy. I will certainly shop here again. Patricia","Lovely plant. Well packed so no problems with shipping. Thank you. Also I appreciate being kept up to date regarding shipping date.","I won a free houseplant on the monthly drawing. I got the plant promptly after I paid for shipping and it was much bigger than I expected. Bobby was very pleasant to deal with. I recommend his company and yes, the free houseplant is for real. :-)","I received my Split-Leaf Philodendron on Thursday, it is just beautiful, Mr. Keziah, well worth the wait.","Bobby has to be one of the most concerned and caring kind of person that I have ever dealt with. Customer service is excellent! The plant I received was breathtaking! When I opened the box I was shocked and pleased! He sold me the most unbelievable Purple Passion vine. I RECOMMEND Houseplants 4 Less VERY HIGH!! Thank You Bobby","I have been looking for a specific houseplant that I could not find in any local nursery or floral shop. After much frustration I tried an on-line search and found House Plants 4 Less. What struck me so fine was the attention to detail in descriptions and photographs for so many plants! I not only found my special plant, I was tickled to order several more that I\u0027ve always wanted but could never find anywhere else! There are so many plants available from House Plants 4 Less that your fancy will be tickled as mine was! My plants arrived in such unique and precise packaging - they looked better than plants I have seen at the flower shop! Each plant was individually wrapped in such a way that kept the pot, the soil, and the plant completely safe and clean. The plant\u0027s sizes are generous, budding profusely, and in all the beautiful shades of green exhibiting new life and healthy plant growth. The plants come pre-fertilized and watered -- no detail is overlooked in order to transport a healthy plant. I not only recommend this vendor heartily, I have decided that all of my future gifts in this category will be with Bobby and company at House Plants 4 Less! There is nothing like knowing a gift you send is going to arrive in perfect condition! And, I do mean perfect! The proprietor, Bobby, also included a generous pack of wildflower seeds which I can\u0027t wait to plant and watch the colors come to life! This company brings extraordinary customer service to a higher level! You will certainly not be sorry, you will be very pleased as I am, and you will want to tell others as I do. I\u0027m grateful for the opportunity Dave\u0027s Garden Watch Dog has provided to share my positive experience with House Plants 4 Less.","I ordered a large number of plants for my house from House Plants 4 Less- The plants arrived in excellent condition and are extremely healthy. I was very suprised and satisfied at how fresh and beautiful these plants are- They were handpicked by them even better than I could have done if I was there myself .What impressed me most is that after I had placed the order online Bobby Keziah personally called me \u0026 said that 2 of the plants I had ordered were in stock but he was expecting a new supply of these 2 plants in shortly from his supplier which he felt would be in even better shape than the ones he had in stock.He asked me if I wanted to wait a week or 2 for the new supply to come in of these plants-I was totally impressed by his honesty \u0026 personal care of me as a customer- I chose to wait for the new supply even though there was nothing wrong with the plants he had in stock except that the new supply would be even nicer than what he had. What a refreshing place to do business with-Quality, honesty, and fair prices- I will do all my future plant orders from Bobby- Jerry Wolkoff","I recently ordered a Silver Philodendron plant from houseplants4less and had it delivered to my son at college in Iowa. Unfortunately, the plant went through a lot being delivered to the remote Iowa post office and then to my son\u0027s college and it had been tipped out of its pot, its stems broken and just generally damaged all around. I contacted houseplants4less and asked that a replacement plant be sent. Bobby Keziah called me himself and offered to send another Silver Philodendron plant for no additional charge. This was above and beyond typical customer service, especially since the damage was apparently due to the delivery process and was not any fault of houseplants4less. So I would like to express my thanks for his commitment to the satisfaction of his customers and to the quality of his products and services. Sincerely, Angela B.","Like some reviewers, I\u0027ve also ordered house plants from a variety of websites and have been uniformly disappointed. I swore only to deal with local nurseries where, at least, I could see the plants before buying. Then my favorite one closed. Thinking I\u0027d give the internet one last try, I ordered from House Plants 4 Less and got the prettiest Aspidistra I\u0027ve ever seen. Gone are the days of soggy newspaper around a root ball attached to one sorry stem. I\u0027ll be sticking with Bobby Keziah.","I the past I had purchased a couple of plants via internet with different companies. I had paid a fair amount of money only to be greatly disappointed when I receive the package. Inside there was a bag full of roots and a couple of leaves I called and was told that the plants would grow that as long as I had the roots I was fine. Needless to say I was skeptical when I found the site for House Plants 4 less, I decides to try once more. I am so happy I did. I have placed three orders so far and the plants are beautiful, full size and healthy. They arrive carefully packed and ready to be enjoyed. I definitely recommend this site to anybody who wants to get georgeus plants. I will keep ordering in the near future. Thank you Lourdes Carvallo Olivares Austin, TX","I was signed up for the free plant drawing that House Plants 4 Less offers. I was notified that I had won a free houseplant. I paid for the shipping only. Bobby contacted me right away and gave me a choice between vareigated or green. I recieved it in the mail a few days later. It was a vareigated English Ivy. It was a very healthy large plant, the best quality I have seen. I am always very impressed with Bobby. I have contacted him before, he always responds very quicky, and offers very informative advise. You can tell he takes a lot of pride in his company, profession, \u0026 plants. I would highly recommend buying plants from Houseplants 4 Less \u0026 I will again, thank you Bobby! Troy Jonas","I bought a prayer plant as a gift for a friend. Bobby contacted to let me know that they were out of stock on the type I requested. He offered to have a variegated variety sent instead and also offered a larger plant size to compensate for the change free of charge. I agreed and he sent out the prayer plant. My friend was elated. She said it was the most beautiful prayer plant she had ever seen. We are very pleased with the service of House Plants 4 Less and will purchase again from them in the future.","I have been a gardener as long as I can remember over my almost 40 years. Healthy plants are healthy plants even when they\u0027re a bit travel worn from shipping. The plants I received were/are very healthy and three were upgraded to a larger size at no cost to me. Bobby stayed in contact and appraised me of what was happening with my order continuously and I am grateful for that. At first glance the cost may seem extreme for what might be considered starter plants - however what I received are well on there way to nicely shaped specimens or there already. Thank You. David Hale","After moving back to Michigan from Florida during the winter season, I have been unable to find any house plants, or any of quality. I found this website and was very impressed at the plant selection and the spectrum of information offered. I had some concern about ordering at this time due to weather conditions. I sent an email to the company asking about shipping and received a very speedy reply. Of course I ordered a plant; I had nothing to lose because I learned shipping was free and the plants are guaranteed! When it arrived I was amazed at how gorgeous it looked and how quickly it arrived. It was packed perfectly and I could not be more pleased. I look forward to adding many more plants to my collection from House Plants 4 Less!","i have never had such a wonderful experience buying something. i wish that every store and company hire only bobby\u0027s. he makes sure i was happy with my selection. there was a small problem, which i want everyone to know, was my own fault. bobby called me immediately and asked me to keep him informed about the results. he offered to help with the postage if the plant was returned and healthy. happily, my friend picked up her plant at the post office, that she wanted for many years, but couldn\u0027t find one. my friend is 102 yrs. old. she called me three times to tell me how gorgeous the plant was and thanked me continuously. bobby made that happen for this lady. i would never buy a plant from anyone else. thank you bobby a million times for your kindness and help making sure that plant was large and gorgeous. i also love your drawl. norinne p.s. i have already recommended you to all my friends and relatives, and told each and everyone of them my story.","I received my Banana Split Lantana today and it is a nice healty plant. It does not look like the picture I saw. When will the plant I received start to get flowers? Bobby has been very helpful whenever I have had any questions.","Personalized, excellent service and the two most beautiful cyclamens I\u0027ve ever seen. Mine was a backorder spanning a few months, and Bobby kept in touch by phone on a regular basis so I\u0027d know the status of my order. That is really rare service. My new plants are huge, lush, healthy and full of buds and flowers. I\u0027ll definitely go back. Thanks, Bobby.","Website very easy to use, fast and professional transaction, very good follow-up, plant arrived fast and in great condition. Thank you for a georgeous plant at a much cheaper price.","I am very happy with Plants 4 Less. They have very beautiful, healthy plants at good prices! Fast shipping! Bobby is very friendly and good emails with helpful advice!! I am glad I found this company. Thanks! Tricia","I highly recommend HousePlants4Less!! I am pleased to report that my 1st experience purchasing houseplants online was a success due to HousePlants4Less \u0026 more precisely, Bobby Keziah. After looking for years I found 2 elusive plants on his site http://houseplants4less.com/ From the beginning he assisted my checkout process personally via the telephone (on his dime) \u0026 was careful to catch \u0026 correct an error before my credit card bill sent me for a loop. I was somewhat concerned that shipping live plants all the way from Charlotte, North Carolina to Ottawa, Canada may not be such a good idea but my Bird of Paradise plant (in a 3 gallon pot) arrived in a mere 7 business days...not too shabby for an international transaction. I am yet to receive part 2 of my order (Cast Iron Plant) but am assured by USPS/Canada Post that it is soon to follow. The only thing I can find wrong with this experience is the fact that the majority of my plant\u0027s rather long thick stems were bent right over. I don\u0027t wish to imply that this is the fault of Bobby as I have a sneaking suspicion that our postal services were somewhat lax in observing the obvious \"fragile\" sticker due to the fact that the soil was disturbed even though the plant was packed well. I believe that the plant will thrive being that the soil was nicely moist upon arrival \u0026 its obvious health (not to mention the improvised splints I used to reinforce the stalks at the bends). Upon Bobby\u0027s suggestion, this one lovely plant will soon be two, as soon as I purchase new pots \u0026 divide the two plants he has generously put in one pot. Another Satisfied Customer, Hillary On October 26th, 2006, CanadianHillary added the following: More Success with HousePlants4Less!! The second part of my order has now arrived. Thanx Bobby! It did take a fair while to get here (16 days/11 business days, damn those Customs Cops) but luckily it was a Cast Iron Plant \u0026, as the name suggests, is quite hardy. I had to remove 6 of the main leaves due to them being brown \u0026 crispy...it now looks great in its new home. As with the Bird of Paradise, now that I have tended to it, I am happy to report that it looks quite happy \u0026 I\u0027m sure it will thrive. I feel I should warn people not to be disappointed if your plant looks a bit under the weather when you first open the box \u0026 lay eyes on it...I have found that (perhaps because mine are travelling a great distance) they tend to show their distaste with being knocked around \u0026 confined within a dark box but bounce right back. Bobby Keziah is a man of his word! Thanx Again Bobby, Hillary On October 26th, 2006, CanadianHillary added the following: PS Thanx for the complimentary Country Wildflower seeds.","Hi Bobby I got my pure air plant collection today. I LOVE THEM... they all look happy and are in good shape. There was a little loose dirt in the box, but other than that they are perfect I cant wait to get the rest. Im a happy shopper Thanks Bobby","Thank You Houseplants 4 less!! I received my root cuttings of monstera deliciosa philodendon. Big Beautiful Healthy root cuttings! I could not believe the size of these root cuttings. They are actually the size of a full grown plant. If you are going to order plants through the mail, Houseplants 4 less is the site to use. Thanks again, Maschmidt","The best way to share my experience is to take you through the process from start to finish: August 21, 2006 Dear Patricia, Thank you for stopping by House Plants 4 Less and considering us for your purchase. We noticed that during a visit to our store you placed the following item(s) in your shopping cart, but did not complete the transaction. We are always interested in knowing what happened and if there was a reason that you decided not to purchase at this time. If you could be so kind as to let us know if you had any issues or concerns, we would appreciate it. We are asking for feedback from you and others as to how we can help make your experience at House Plants 4 Less better. August 21, 2006 Dear Bobby, Thank you for your concern. Indeed, I am a bit hesitant to complete the order at this moment. I am doing a little more research in my local area before committing to such a large purchase. Though I have found the houseplants in my area a bit more expensive I just wanted to try a few more places today before finishing my order. I just moved into a new apartment and wanted to furnish it with lots of plants because I live only a block away from a busy thoroughfare which means the air from my opened windows will not be as clean as I would like it. I\u0027m also getting ready to go through a cleansing ritual for my body (breast cancer survivor) which keeps me healthy and having plants in the house is most helpful. Unfortunately, most of my previous plants did not make it through the move so I am in need of new ones. I\u0027ve never bought plants online before so a little of my hesitancy is also due to that. I came across your website as I was looking for more local dealers on the internet. I was really impressed by your site and before I knew it I was placing items into the cart. I don\u0027t have much of a green thumb so the information you gave on the plants was most helpful! I also liked your prices. So, please bear with me as I make one more final attempt to confirm that I do have the best prices in town. Though I originally was not looking to spend this much, the free shipping was an incentive. Thanks, Pat August 21, 2006 No problem, If I can Help Just Let Me Know. August 21, 2006 Dear Bobby, Thank you for your patience. I compared prices at the La Crosse Floral \u0026 Garden Center, all in 6in pots. The pure air collection you have priced at 52.40 would cost me 99.00 for those 5 plants grouped together. They do not have specials on groupings. The Mother-in-Law\u0027s Tongue plant you have priced at 15.39 would cost me 25.00 for one and I am buying two from you for 30.78. The Chinese Evergreen, your price 19.94, here 23.00. They did not have the Wandering Jew nor any surprise specials that you offer. So based on a one-to-one comparison, I am looking at 147.00 for 7 of their plants compared to 8 of your plants for 103.12. Now, when I compare the 147.00 they want for just 7 plants to the actual number of plants I\u0027m getting from you, approximately 14, at the price of 208.96 which includes a one gallon potted plant and an 8in hanging basket plant, well there really is no comparison is there? LOL! So, I will go ahead and place my order with you today. August 22, 2006 Thanks For The Information And The Order. We Will get It Out For You This Week. ********************************************************************** After I had placed my order a day or so later I got a phone call from Bobby telling me that he wants to hold my order for one week because he wasn\u0027t too happy with one of the plants I ordered and had a new shipment coming in the following week. He was very courteous and we had an enjoyable conversation about the plants. ********************************************************************** September 01, 2006 (email from Bobby) Well, How Did The Plants Arrive? September 01, 2006 Dear Bobby, The postman arrived this afternoon (after 1:30pm) after I had to leave for work and I couldn\u0027t find anyone to be here to accepted the delivery. Needless to say, I was none too happy. Usually the they make deliveries such as this around 11:30am before the mail run. I am going in the morning to pickup the packages from the post office. I\u0027ll email you as soon as I get home with them. I can pick up as early as 8:30am. I have to be at work tomorrow at 10am so I will try to email you as soon as possible. Thanks! September 02, 2006 Hi Bobby, Here\u0027s the report on my new plants: The two square white boxes look like they got banged up and tipped over. I found lots of loose dirt but the plants seemed okay. One long brown box took a big hit with a tear towards the bottom. The other 2 long boxes were pretty scuffed up too. The wandering jew and the lantana where the only two that did not have loose soil thrown around. Pure Air Collection: The Schefflera Arboricola is great and stunningly beautiful It\u0027s like miniature tree. It also looks like its ready to bust out of its pot. The English Ivy came through pretty good too. Did not loose any of the branches and the leaves look healthy. The Arrowhead Philodendron doesn\u0027t look too well. The leaves are very pale and I found some small wispy spiderlike insects on it. I haven\u0027t seen them on the other plants yet but I am keeping my eyes open. The Peace Lily had a few broken leaves and stalks but it seems to have come through okay. There\u0027s one small flower pod on it. The Variegated White Dieffenbachia is absolutely beautiful. Surprise Box: The Love Leaf did not look too happy but after reading up on it on your website, I\u0027m sure it will bounce back. The Swedish Ivy did not come through too well. A few of the trailing branches were damaged/broken and many of the leaves look deformed. The Spider Plant is cute and quite compact, should I divide them into other smaller pots or wait awhile? The Gold Dust Croton listed is not what I received. I\u0027m not sure what it is and I went through the website to match it up. It\u0027s so small though I\u0027m not sure if I matched it correctly. It kinda looks like a smaller version of my Dieffenbachia but it\u0027s spotted instead of variegated. Bobby Special: The Banana Split Lantana I found not to be in good shape. It had very little packing material in the box and one of the 3 stalks was broken off almost halfway down. It\u0027s very stalky with just a handful of leaves. Will it fill out at all or will I need to cut it back? The Varigated Mother-in-law Tongues are nice and firm but they did have quite a few of the tips broken off. Also they are both ready to pop out of the pots. Should I split them into individual pots or wait awhile? The Chinese Everygreen is in excellent shape and very beautiful. As for that monster you sent me... Oh My Goodness, you weren\u0027t kidding! The Variegated Wandering Jew is going to be getting a serious trim... as soon as I work up the nerve to approach it, LOL! Well, I think that covers it all. Thanks, Pat September 05, 2006 Good And I Am Resending A Gold Dust Croton As They Said You Got A Silver One So I Will get That Fixed On This End. Let Me Know If They All Do Good. September 05, 2006 Thanks Bobby, All of them have pulled through except for the Banana Split Lantana, it is dropping leaves. The Wandering Jew has a lot of vines that died off but I think it will be alright too. I gave it a good weeding and trim. The Arrowhead Philodendron is perking up also. I saw some kind of small wormlike insect working its way into the soil of the spider plant. Should I be worried? I only saw the one. Looking forward to the Gold Dust Croton. My daughter is very happy with all the new plants we have and the apartment looks wonderful with all the green plants. Thanks, Pat September 08, 2006 Update on the Banana Split Lantana: Hi Bobby, The Lantana has dropped all of its leaves and what new buds coming in are turning black. What should I do? I checked the soil to make sure its moist and draining properly and it\u0027s getting plenty of sunlight. Pat September 08, 2006 You Should Not Be Having A Problem As I Grow Them Sitting In Full Sun And I Keep Them Wet so It Should Be Growing Good But In Any case I will Send You A New One As Soon As I Send the Gold Dust Croton. September 08, 2006 Thank you, I just don\u0027t know what is going on with the Lantana. The three branches are bare. There is a small outgrowth of a new stem with a few leaves on it but the buds are as I said turning black from the tips down to the stem. Is there anything I can do to salvage it? Should I cut back the woody branches? Should I leave the small stem with those few leaves or should I cut that back too? All the other plants are doing well. I have notice a few small thick worm-like insects burrowing through the soil on some of the plants. The spider plant, the lantana, and the peace lily. I had to repot the peace lily because it did lose a lot of dirt in transport and the root balls were pretty thick and poking up through the soil. It seems to be doing nicely. The mother-in-laws, like I said before, are trying to bust out of their pots. I will repot those this weekend. Should I be concern about the insects? Should I use anything or not? Thanks again! Pat September 08, 2006 Two things -- One Is Its probly Rolly Pollys As Thats What We Call Them And They Are harmless However I Prefer No Bugs So I Spray With malathion and it works good for us but we also use a mild dishsoap mixed with water sometimes so either is good. I would not cut the lantana any since alot of leaves are dead I Would Just Give It Lots Of Sun Shine. They Are Hardy And Although Its Dead On Top, This Does Not Mean Its Dead On The Bottom. Its Possible That By Shipping It We Sent It Into Dormancy. I Have Only Seen This Twice In My Time Off Mailing Plants To People. Just Wait Two Or Three Weeks And See What Happens But I Will Get You A New One Out In Any Case This Week. I Have Your Gold Dust On My Desk Now... You Could Repot All Them Several Times...:) September 08, 2006 Thanks, Bobby, for everything! Pat ********************************************************************** Well, that\u0027s my experience and I got my hands full with these new plants. Looking forward to repotting some of them because they will make great gifts for family and friends. I have to say in spite of the small problems I\u0027m happy with my order and I did get my money\u0027s worth! No doubt I will be ordering again in the future.","On July 17, 2006, I ordered a plant as a gift for a relative from Arkansas, who visited me here in California. While here she had complemented me on the donkey tail plants I had on my patio. Thou I knew a donkey tail plant is fragile and would be difficult to send, I went ahead and ordered the plant from House Plants 4 Less, to surprise her. The plant ended up arriving at her home, disheveled and in lots of little pieces. My relative said \"pray for the plant\". I was disappointed and e-mailed Houseplants 4 Less. There was an immediate response from Bobby Keziah, the owner of the company. He suggested I have them send the plant back, and he would be happy to send a replacement. When I explained my discomfort in asking the relative to send the plant back, Bobby was understanding and offered to send a plant that he knew would travel well. He sent the new plant out immediately and my relatives said it looks strong and healthy. I wish there were more companies with this kind of concern for their customers. I was very pleased with the timely a curtious response I received. Thank You, Bobby Keziah and House Plants 4 Less ETH","I ordered two plants online and the purchase went through okay. I didn\u0027t receive any sort of confirmation email, which was unsettling since every place I\u0027ve shopped through online (and there have been MANY) send emails summarizing the transaction. When I emailed the company, I eventually received an answer saying there were internet problems but the order would be sent very soon. I received one plant shortly thereafter - a surprisingly tall and healthy mosquito plant. I\u0027ve repotted it and am trying to encourage it to grow bushy rather than gangly, and it\u0027s doing nicely, even more pungent than I expected. My other plant was put on backorder. Strangely enough to me, I was still charged for it (every company I\u0027ve ordered from online doesn\u0027t charge you until the items ship or the order is completed). I\u0027ve also been unable to receive an answer as to when the plant might arrive or whether the difference will be refunded. Nice products, it seems, but this wall against communication is very frustrating, especially when as a consumer, you have to be wary about online fraud, and hearing only silence from someone you\u0027ve given money to instinctually makes you tense. On August 4th, 2006, writeswithafist changed the rating from neutral to positive and added the following: Right after calling the company to leave a message (I Googled the number - which led me to here - since I couldn\u0027t find a phone number on the company\u0027s site), and after making this post, the company called me back to let me know they\u0027d tried to let me know about my order by calling my phone number listed on the order; a number which I had to disconnect a couple weeks ago due to my personal info and debit card being stolen. They said the plant will be mailing this week and that they were sorry about the delay. The delay I don\u0027t mind, and the phone number issue was just a matter of bad timing with my circumstances. I do wish email communication was a bit easier (and/or the company phone number were posted on the website). But the products and customer service seem right on track.","After having bought a String of Pearls plant at HD and watching it die because they\u0027d overwatered it (I\u0027d tried repotting it but it didn\u0027t work), I figured I\u0027d buy one from House Plants 4 Less because if they grow them, they must know not to overwater them. However, the plant that I received was as wet as the plant from HD! And I mean wet, not damp. I tried repotting it, but the roots are superficial and the plant is fragile, so I wasn\u0027t able to get much of the wet soil around the roots off. Then I tried putting it outside in partial shade (morning sun only), hoping the heat would dry it out. I watched as this plant began to shrivel up, get moldy and die, just like the overwatered plant from HD. I emailed Bobby to ask about their return policy. At the time, there were no hard feelings. I\u0027m sure they hire new employees from time to time, and I just assumed that someone new had accidentally overwatered it. However, when he called to ask whether I wanted a refund or a replacement plant, he also said that he didn\u0027t know why I sent it back, as it looked fine to him and all it needed was some WATER!!! (This was after having emailed Bobby to explain what was going on). Problem is, the plant I sent back was maybe about 2/3 the plant they had originally sent me. I had watched as my other plant had slowly died, and I knew that this one was headed for the same fate because it was doing the exact same thing. I didn\u0027t want the weeks to pass until it was completely gone before returning it in case it would be too late to get the refund. I did get my refund, but I was insulted by being told there was nothing wrong with the plant after my roommates and I watched it dying with our own eyes, we could feel the wet soil with our own fingers, and the exact same thing had happened with my last overwatered String of Pearls plant about a month ago. I wish I had felt comfortable getting a replacement plant, but after paying for the shipping to send this one back, I didn\u0027t want to gamble on being out even more money if the next one was also overwatered. I don\u0027t even return plants that I kill to HD, despite their return policy. If I kill it, I suck up the loss because it was my own fault. But I don\u0027t want to buy a plant that\u0027s doomed before I even get a shot at it! I might buy other plants from Houseplants4less, but no more succulents. On August 6th, 2006, ceallachg changed the rating from neutral to negative and added the following: NOTICE THE RECENT NEGATIVE RATINGS BEFORE YOU BUY FROM THIS PLACE --------------------------------------------------------------------------------------------- So, the customer is STILL wrong? I don\u0027t know how I could \"Not Do Good With That Plant\" when I did nothing to it! It was all you! I had repotted the HD plant, not the one from you (although it didn\u0027t help the HD plant anyway), and I didn\u0027t water yours at all because the soil was so wet that even a couple of weeks after I received it it was still wet (wet--not damp). At that point I put it outside for two days hoping the heat would dry it out. It was in shade all day except for about 3 hours of morning sun. When I saw that it was too much sun I brought it inside, like I told you on the phone. The main problem wasn\u0027t the sun, it was the soil that was still wet weeks later which would harm any plant, let alone a succulent. I don\u0027t think the mushy, wet, disintegrating beads and white mold were caused by the sun. The few white, shriveled beads, now those _were_ from the sun, and when those first developed I put the plant back inside immediately. This mess was a result of your having overwatered it, not something I did. Like I said, I don\u0027t return plants that I\u0027ve killed. Changed to negative because any company that continues to be defensive and blame the customer deserves a negative rating (look at all of his reponses to negative ratings), not a neutral one. I\u0027m definitely not buying anything from this place again. On August 6th, 2006, ceallachg added the following: You go ahead and keep proving my point for all to see. As for me, I\u0027m done responding to you. On August 14th, 2006, ceallachg added the following: Personally, I saw no reason to continue this discussion in public, but if you want to take a private email and post it for all to see without the consent of the person who sent it, I suppose there\u0027s nothing I can do about that. What More Do I Expect? Like I said in my email: AN APOLOGY. You have repeatedly insulted me, both in private and on this website, and have never apologized for this customer\u0027s unsatisfaction with your product. But I see now that I was expecting too much. So, don\u0027t worry about it--an apology at this point would be both empty and worthless. Good luck to you, and especially to any future customers of yours. Can we end this now? On August 14th, 2006, ceallachg added the following: APPARENTLY THE ANSWER TO \"CAN WE END THIS NOW?\" IS \"NO\"! Brian Saunders, do you not read? I said that I had it outside for 2 days in which it received 3 hours of morning sun per day, not outside in all day sun for 3 weeks. I also did not say that it was still soaking wet after 3 weeks, only that it was still wet. As anyone with this plant would know, the beads cover the soil, preventing it from drying out as quickly as, say, a pony tail palm\u0027s soil would. As for starting this \"posting business\", that\u0027s what Garden Watchdog is for! I initially posted a NEUTRAL rating which I changed to NEGATIVE because of your attitudes, which are continuing to justify my decision. AND YES: When I am told that a plant that I and others see half-disintegrated and moldy with our own eyes is in \"perfect condition\"... When it is repeatedly insinuated that it must be my fault somehow--either from having put it out in the sun, or that someone else went behind my back to water it, or that I must be lying about not having watered it myself... When my intelligence is questioned by saying things like \"Anyone In The World That Has A Plant Will Understand This\", you\u0027re darn right I take offense. Who wouldn\u0027t? I ask again, CAN WE END THIS NOW? Company representative comment on August 14, 2006: On Aug 4, 2006 11:37 AM, House Plants 4 Less added: We Do Not Wish For You To Feel Insulted. There Are Lots Of People That Do Not Do Good With That Plant. However let me Say This. I Took The Plant Just As It Was Returned To us And Put It In The Yard And Its Doing Fine. Its An Easy Plant For Us I Guess. Listen -- You Can Take That Plant And Wash All The Soil Away From The Roots Then Drop It On Top Of More Soil And It Will grow New Roots. that\u0027s How We propagate It. The Light Is The Main Problem. We Lose One Or two A Year But That\u0027s It. An Easy Plant To Ship And care For. On Aug 6, 2006 6:19 PM, House Plants 4 Less added: No One Said It Was Your fault However Anyone In The World That Has A Plant Will Understand This. If You Have A 6 Inch Pot Filled With Soil And Holes Are In The Bottom With good Drainage, The Pot Will Dry Out In A Few days On Its Own And If It Was All That Wet you Would Of had To Add Water Or Someone Was Watering It. A 6 Inch Pot With Soil Can Only Hold So Much Water. Water Did not Hurt the Sting Of Pearls. putting it in the direct sun did but it has came back nicely. We have It Growing Now. Sorry About Your Confusion and Frustration But It Is Mis Directed. On Aug 9, 2006 2:01 PM, House Plants 4 Less added: THIS WAS THE LAST EMAIL I WAS SENT FROM ceallachg. I WANT TO POST IT AS WELL SO THAT ALL THAT ARE READING CAN KNOW EVERYTHING. I HAVE NO SECRETS AND NOTHING TO HIDE. I DO MY BEST TO HELP AND PLEASE ALL MY CUSTOMERS EVEN WHEN THEY GIVE NEGITIVES. For the record: I initially gave you a neutral rating, not a negative one. I have about 30 houseplants including several other succulents. Miraculously, they\u0027ve all been alive and well for the last couple of years. Makes you think I must be doing something right, doesn\u0027t it? As for how long the soil was wet--it was never taken out of the same pot you shipped it in and I never watered it. My roommates are intimidated by my plants. They never water them, even when I\u0027m on vacation (which I wasn\u0027t). \"However Anyone In The World That Has\" a String of Pearls plant knows that the beads completely cover the soil, keeping the moisture from evaporating nearly as quickly as it does with other plants. Does this really look like it\u0027s in perfect shape to you? This photo was taken 7/18, a few days before I sent it back. Only half of the plant was left by then. You can see the wet, dark green disintegrating beads in the circled areas (especially in the smaller circle--you can see that one has been \"smeared\"). So I can show people this photo, if you want their opinion (although just to let you know, they\u0027re the same people that helped me recognize by the same symptoms that my last SOP plant had been overwatered). Instead of saying \"I\u0027m sorry you weren\u0027t satisfied, but I did give you the refund you requested\", why did you choose instead to say to everyone who reads Garden Watchdog that you\u0027re a defensive person who doesn\u0027t believe his customers even when they\u0027re telling the truth, and who is perfectly willing to insult them publicly when they have a legitimate issue? Obviously, that\u0027s up to you, but personally I wouldn\u0027t want my customers to get that impression of me. Do you want me to post the photo so we can get an unbiased opinion? Kelly THIS WAS MY RESPONCE Honestly, I Do Not care If You Post The Photo Or Not. I Also Sell So many Plants That A Slow Down Would Give Me A Break. I Do Care About All My Customers And Have Always Tried To help Each Of Them If They Would Let me. Ask Around You\u0027ll See. Now In Your case -- You Gave a Neutral -- Lets Look At This You Got A Plant And Did not get It to Growing And Was UnHappy. As Our Police Clearly States - If This Happens Send It back To me And I Will Send You A New Plant Or Refund Your Money. -- That I Did. You Give A Neutral For That -- I Have Done All That Could be Expected Of Me But You Keep Feeling Something That\u0027s Causing You To Keep Writing So Hear We Are Again. What More Can I Do For You ? What More Do You Expect ? The String Of Pearls You Had Is Fine At This Moment. Its In My Yard Right Now --- Growing. I Do My Very Best To Keep My Customers Satisfied But That\u0027s Not Always Going To Happen And There\u0027s Always Those Few That Nothing You Do Pleases Them So I Do My Best And Move On. By The Way - I Am Going To Post All This As I Do Want My Customers To See The Good The Bad And The Ugly -- Hey Its Life... If Anyone Has Any Questions About Me The Can Find Me Daily At The Site Or In An Email Here Or At The Site. I Send The Best Plant And Largest Of All Online Plant Store. I Get One Negative In About Every 121 Sales So That\u0027s Not To Bad. We Do Try Our Best To Please But We Know This Is Not Going To Be 100% I Did Once Try For 100% But After A Couple Years I Learned Better. NOW FOR THE CUSTOMER -- TRY US FIRST !!! On Aug 14, 2006 12:08 PM, House Plants 4 Less added: I am Brian Saunders. I work for houseplants4less. This entire Posting business was brought on by you. You have continued to say that 3 weeks and the 6 inch pot was still soaking wet. HOW IS THAT POSSIBLE WITH IT BEING 3 WEEKS IN THS SUN..A 6 INCH POT WILL NEVER STAY WET FOR 3 WEEKS IN THE SUN. All we have said is that someone had to water it more than it needed to be. We are only saying 3 weeks is impossible for a plant to be in a 6 inch pot and be in the sun and stay wet for that entire 3 weeks. Plant lovers around the world will tell you the same. We are not trying to offend anyone, but you took it offensively.","Great Company!!! I have been ordering from Houseplants 4 Less for over a year and never had a problem. Bobby Keziah has always been fair. If I received a plant that was damaged (which only happened (twice), he replaced them with a much larger plant or two plants for the price of one. Houseplants 4 Less is my only source of plant purchases.","Unique information I used to register and purchase with on the houseplants4less website were not secure in their database. Because of this my personal contact information (my name, address, birthdate, phone number), site password and credit card number have been fraudulently used as well as posted on a Russian CC scam site. Company representative comment on July 8, 2006: On Jul 8, 2006 12:52 PM, House Plants 4 Less added: We tried to explain on the telephone that this is impossible to happen. For those of you who know, and those of you who do not, we use a 3rd party billing system called PayPal. We store absolutely ZERO credit card information in our database. We use a 128bit encryption. If there was any possibility of anything being stolen, it would be address and plant order information. We have checked and it there is no sign of an intrusion. Paypal has not notified us, and no other notifications have been received. We do apologize that this happened, but we do guarantee that our site is safe, secure, and reliable."]],"pageTitle":"The scoop on \u0027House Plants 4 Less\u0027","title":"","url":"http://davesgarden.com/products/gwd/c/3465/","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"RELATION","tableNum":16,"s3Link":"common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989891.18/warc/CC-MAIN-20150728002309-00079-ip-10-236-191-2.ec2.internal.warc.gz","recordEndOffset":64404019,"recordOffset":64375179,"tableOrientation":"HORIZONTAL","TableContextTimeStampBeforeTable":"{923\u003dPhone: 704-393-1027}","TableContextTimeStampAfterTable":"{70747\u003d[ Home | About | Advertise | Media Kit | Mission | Featured Companies | Submit an Article | Terms of Use | Tour | Rules | Privacy Policy | Cookie Policy | Contact Us ] Back to the top Copyright  2000-2015 Dave\u0027s Garden, an Internet Brands company. All Rights Reserved. }","textBeforeTable":"Add to Bookmarks Recent reviews:  Visit their website House Plants 4 Less Mailing Address: 3701 Oakwwod Rd Charlotte, North Carolina 28269 (United States) Phone: 704-393-1027 Catalog Order Page: Hyperlink Paper Catalog Cost: Free  E-Mail them Company Profile  The scoop on \u0027House Plants 4 Less\u0027","textAfterTable":"Positive gcmd Simi Valley, CA (1 review) March 23, 2007 I have been looking for a specific houseplant that I could not find in any local nursery or floral shop. After much frustration I tried an on-line search and found House Plants 4 Less. What struck me so fine was the attention to detail in descriptions and photographs for so many plants! I not only found my special plant, I was tickled to order several more that I\u0027ve always wanted but could never find anywhere else! There are so many plants available from House Plants 4 Less that your fancy will be tickled as mine was! My plants arrived in such unique and precise packaging - they looked better than plants I have seen at the flower shop! Each plant was individually wrapped in such a way that kept the pot, the soil, and the plant completely safe and clean. The plant\u0027s sizes are generous, budding profusely, and in all the beautiful shades of green exhibiting new life and healthy plant growth. The plants come pre-fertilized and watered -- no detail is overlooked in order to transport a healthy plant. I not only recommend this vendor heartily, I have decided that all of my future gifts in this category will be with Bobby and company at House Plants 4 Less! There is nothing like knowing a gift you send is going to arrive in perfect condition! And,","hasKeyColumn":false,"keyColumnIndex":-1,"headerRowIndex":0}