{"relation":[["","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""],["_____ humidity is a bad indicator of the actual amount of water vapor in the air.","If a bubble of air is forced to rise, and if the bubble is warmer than the surrounding air, the bubble in considered _____","An instrument that measures humidity is called a(n)____","On a clear sunny day, when the wind is light, the stability of the air will most likely be ____","A desert can be found on the _____ side of a mountain.","The clouds that are made up of ice crystal and are very high in the sky are called ____","The precipitation forming process that gives us most of our precipitation throughout the year is ________.","Which stable/unstable process is often associate with thunder snows?","The actual lapse rate of the air is called the _____ lapse rate","The type of precipitation that falls and freezes on contact with the ground is called.","When warm air moves over a cold snow surface the resulting weather is usually_____","The type of precipitation that occurs during the growing season, and is most damaging to crops is _____","The prefix for a middle height cloud is called _____","A desert found on the downwind side of mountains is called a ______","Vapor pressure is:","The effect of humidity and high temperatures is expressed as a ____","A process in which no energy is added or removed form the system is called _____","Water vapor forms onto solid particles in the air. These solid particles are called:","The major source of humidity and precipitation in the eastern half of the US is ______","The type of fog caused by your breath on a cold day would be considered:","Which lifting mechanism is caused by air running into a mountain?","An instrument that uses lasers to measure cloud coverage at different heights is called:","Which cloud is associated with severe updrafts and downdrafts and is often called a \"thunderhead\"?","A situation in which the temperature increases with altitude is called ____","An air parcel ______ when it is warmer than the surrounding air and it _____ when it is cooler than the surrounding air.","When the ELR is greater than both the dry and wet adiabatic lapse rates for a rising air parcel, then the air is considered:","At what time of day does an inversion usually begin in the lower levels of the atmosphere?","When droplets combine to form a single, larger droplet, the process is called _____","Which precipitation process is responsible for producing rain in tropical regions?","Which form of precipitation is associated with black ice?","The terminal velocity of an object depends primarily upon the object\u0027s:","Cloud droplets fall slowly because they are:","The process by which supercooled water droplets freeze onto falling ice crystals is called:","When a lifted air parcel neither sinks nor rises is it:","____ air can result in tornadoes and hail","_____ air produces severed rising motions","___________ air is associated with strong temperature inversions","The movement of water between and within the atmosphere and the Earth can be described as the _____ cycle.","When making air rise, the height at which condensation occurs is called the _____","An abundance of precipitation usually falls on the upwind side of the mountain called the ______ side","When a falling rain drop reaches a constant speed, it is said to have reached a ____velocity","The instrument used to measure liquid rainfall reaching the ground is called a ____","Scientists attempt to make a cloud produce rain or snow with a process called ____","Rain that falls from a cloud, passes through a cold layer, and freezes into ice pellets is known as _____","The gas that constitutes about 78% of all the gases in Earth\u0027s atmosphere is called ____","As you increase in altitude, the pressure in the atmosphere ______","Incoming solar radiation is often referred to as:","The higher the Sun\u0027s alt, the the ____","The date of the vernal equinox in the Northern Hemisphere is:","The latitude of the Arctic Circle is:","The Earth reflects about 30% of the Sun\u0027s rays that come into the atmosphere, this reflection is termed:","Which method of light scattering primarily affects shorter wavelength radiation?","Net radiation is:","Most of the energy emitted by the Earth is in the form of _____ radiation","______ force creates the wind and always points from high to low pressure.","In the Northern Hemisphere, winds associated with a high pressure system blow _____","What instrument is used to measure air pressure?","If stormy weather were approaching the pressure tendency would probably be","Which instrument measures wind direction and speed at the same time.","A trough in the upper atmosphere is usually associated with a _____ pressure system.","On March 21st, an observer at the S. Pole would see the Sun at noon:","On June 21st, an observer at 23.5 N would see the Sun at noon:","On June 21st, an observer at the Arctic Circle would see the Sun at noon:","___________ air needs the parcel to reach saturation before air can freely rise","1800 UTC corresponds to ____ central standard time","2135 Z corresponds to ____ central standard time","0041 Z corresponds to ____ central standard time","The front which is often associated with severe thunderstorms is a:","The front with the steepest slope is a:","The slowest moving frontal zone is a:","Lake effect snow is associated with which air mass:","The global pressure zone that produces abundant precip and warm temps is the:","Fast moving currents of air found near the top of the troposphere are called:","If an observer witnesses cirrus clouds, followed by cirrostratus, and then altostratus, then a _____ front must be approaching","An air mass originating over the Gulf of Mexico would be considered:","Which air mass may produce an occasional \"Nor\u0027easter\" in the winter?","Usually, ______ produce several hours of moderate to gentle precipitation over a large region.","Which is considered to be a boundary between two different air masses?","An mP air mass is:","A Santa Ana or Chinook wind is a:","When a cold front catches up to and overtakes a warm front the resulting merger creates:","A sea breeze usually originates during the:","Sea breezes usually don\u0027t occur during the winter because:","When the wind flows basically from west to east with no real prominent rossby waves indicated on the map, the general flow is though of as:","The Bermuda High is an example of a:","The polar front is usually located near the location of which pressure zone:","The ITCZ would be recongnizable on a satellite map of the globe by observing a zone of:","When heigh lines on a 500 mb map rise towards the poles during a meridional pattern, these ripples can be thought of as:","In some global locations, it rains for months at a time and then it stops raining for months at a time due to a reversal of the wind regime. These rainy periods are called:","When air flows up a mountain slope created by pressure differences this is called a _____ breeze","An air mass is best defined as a large body of air:","The dew point is most likely to be highest in a ____ air mass","Warm air flowing upward along the boundary between a warm and cold front leading to extensive cloud cover is referred to as:","Drylines are best describes as boundaries separating:","The numerical pressure difference between Darwin and Tahiti is indexed by the:","During an El Nino event, the equitorial ocean temperatures in the Eastern Pacific:","Maps of the global distribution of 500 mb heights show lower values at the pole, which is due primarily to:","Usually the pressure gradient force would be strongest at the:","The warm ocean current located adjacent to the East coast of the US is called:","The fastest moving front:","The front associated with squall lines:","The front that produces the same weather over a long period:","The front that is usually preceded by high cirrus clouds","The boundary between two differing air masses is called a ____","Another name for the sub polar low is the ________","A ridge is considered ___ pressure","Cold, dense air flowing down a mountain slope is called a ______ wind"],["Relative","Unstable","Psychrometer and Hygrometer","Stable","Leeward","Cirrus","Warm cloud precess and Bergeron process","Conditionally unstable","Enviromental","Freezing rain","Fog","Hail","Alto","Rainshadow desert","The part of atmospheric pressure due to water vapor","Heat index","Adiabatic","Condensation Nuclei","The Gulf of Mexico","Steam fog","Orographic","Ceilometer","Cumulonimbus","Inversion","Rises; Sinks","Absolutely unstable","Sunset","Coalescence","Collision coalescence","Freezing rain","Size","Samll","Riming","Neutral","Unstable","Unstable","Stable","Hydrologic","LCL","Windward","Terminal","Rain guage","Cloud seeding","Sleet","Nitrogen","Decreases logarithmically","Insolation","More direct the Sun\u0027s rays","March 21st","66.5 degrees N","Albedo","Rayleigh Scattering","Defined as the difference between absorbed and emitted radiation.","Longwave","Pressure gradient","Clockwise outwards from the center","Mercurial barometer","Falling","Aerovane","Low","On the horizon","At the zenith","At the alt of ~47 about the S point","Conditionally unstable","Noon","3:35 PM","6:41 PM","Cold front","Cold front","Stationary front","Continental Pacific","Equatorial Low","Jet streams","Warm","Maritime Tropical","Maritime Pacific","Warm","Warm and Cold fronts","Humid and Cold","Very dry, warm wind flowing down a mountain slope.","An occluded front","Day and flows toward the land","The land is usually colder than the surrounding water during winter","Zonal","Semi-permanent cell","Subpolar low","Clouds and precip near the equator","Ridges","Monsoons","Land","With similar temperatures and moisture characteristics","Maritime Tropical","Overrunning","Humid air from dry air","Souther Oscillation","Are much warmer than normal","Lower temps at the pole","700 mb level","Gulf Stream","Cold","Cold","Stationary","Warm","Front","Polar front","high","Katabatic"]],"pageTitle":"Meteorology Final Exam Flashcards - Cram.com","title":"","url":"http://www.cram.com/flashcards/meteorology-final-exam-547263","hasHeader":false,"headerPosition":"NONE","tableType":"RELATION","tableNum":0,"s3Link":"common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986423.95/warc/CC-MAIN-20150728002306-00227-ip-10-236-191-2.ec2.internal.warc.gz","recordEndOffset":383322735,"recordOffset":383286390,"tableOrientation":"HORIZONTAL","TableContextTimeStampBeforeTable":"{12673\u003dby appaj00ce9, Dec. 2007}","textBeforeTable":"Back Front 107 Cards in this Set Clone Export Print Share through Card Range To Study Click or Press Spacebar to Begin » Click to flip 1/107 Progress Play button Play button A key: Read text to speech.a key H key: Show hint (3rd side).h key Up/Down arrow keys: Flip the card between the front and back.down keyup key Right/Left arrow keys: Navigate between flashcards.right arrow keyleft arrow key How to","textAfterTable":"","hasKeyColumn":false,"keyColumnIndex":-1,"headerRowIndex":-1}