{"relation":[["Window Name","programguide","programguide-video","manualschedule","viewscheduled","channelrecpriority","programrecpriority","custompriority","phrasepopup","timepopup","powersearchpopup","editpowersearchpopup","programlist","progdetails","progfind","scheduleeditor","scheduleoptionseditor","storageoptionseditor","postproceditor"],["Type","Window","Window","Window","Window","Window","Window","Window","Window","Window","Window","Window","Window","Window","Window","Window","Window","Window","Window"],["Description","The Non-LiveTV program guide.","The LiveTV Program Guide.","The Manual Schedule editor.","The Upcoming Recordings screen.","The Channel Priority screen.","The Program Priority screen.","The Custom Priority screen.","Multiple screen template for screen using a text entry popup.","Template screen type for screens using a date and time buttonlist.","The Power Search popup.","The Edit Power Search popup.","The Program List screen.","The Program Details screen.","The Program Finder screen.","The Schedule Editor screen.","The Schedule Options screen.","The Storage Options screen.","The Post Processing screen."]],"pageTitle":"Schedule-ui.xml - MythTV Official Wiki","title":"","url":"https://www.mythtv.org/wiki/Schedule-ui.xml","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"RELATION","tableNum":0,"s3Link":"common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992543.60/warc/CC-MAIN-20150728002312-00072-ip-10-236-191-2.ec2.internal.warc.gz","recordEndOffset":929281506,"recordOffset":929265543,"tableOrientation":"HORIZONTAL","TableContextTimeStampAfterTable":"{55387\u003dThe \u0027activefilters\u0027 buttonlist is of most use on the initial \u0027scheduleeditor\u0027 window to allow the user to see which filters may be affecting the recordings. The \u0027activefilters\u0027 buttonlist was add in v0.28-pre-1131-g6a87bbd.}","lastModified":"Tue, 30 Jun 2015 00:39:03 GMT","textBeforeTable":"Schedule UI Windows 1.20 The \"metadataoptions\" window 1.19 The \"postproceditor\" window 1.18 The \"storageoptionseditor\" window 1.17 The \"scheduleoptionseditor\" window 1.16 The \"scheduleeditor\" window 1.15 The \"programfind\" window 1.14 The \"progdetails\" window 1.13 The \"programlist\" window 1.12 The \"editpowersearchpopup\" window 1.11 The \"powersearchpopup\" window 1.10 The \"timepopup\" window 1.9 The \"phrasepopup\" window 1.8 The \"custompriority\" window 1.7 The \"programrecpriority\" window 1.6 The \"channelrecpriority\" window 1.5 The \"viewscheduled\" window 1.4 The \"manualschedule\" window 1.3 The \"programguide-video\" window 1.2 The \"programguide\" window 1.1 Generic Attributes Used in most windows 1 Schedule UI Windows Contents The schedule-ui.xml file governs the layout and behavior of the EPG, the Schedule Editor screens and associated screens. It consists of the following windows and named attributes: search navigation, Jump","textAfterTable":"Generic Attributes Used in most windows Note: The following widgets can be used in almost any of the schedule-ui.xml and recordings-ui.xml views. In addition, all textual elements can be combined however the themer likes using the \u003ctemplate\u003e element. To combine the title, year, and description into a single textarea, the theme author might use a template like: \u003ctemplate\u003e%TITLE% (%YEAR%) - %DESCRIPTION%\u003c/template\u003e Widget Name Widget Type Description Required? title textarea The title of the item. N subtitle textarea The subtitle of the item. N titlesubtitle textarea The title and subtitle of the item. N description textarea The description/plot of the item. N category textarea The category of the item. N callsign textarea The callsign of the item\u0027s channel. N","hasKeyColumn":true,"keyColumnIndex":0,"headerRowIndex":0}