{"relation":[["Model Name","Cedar Ridge Cape Style","Lake View Cape Style","Timber Ridge Cape Style","Andrews Ranch Style","Imagine Ranch Style","Montgomery Ranch Style","Serenity Ranch Style","Charleston Two Story","Talmadge Two Story"],["Rooms","3 Bedrms 2 Baths","3 Bedrms 2.5 Baths","3 Bedrms 3.5 Baths","3 Bedrms 2 Baths","2 Bedrms 2 Baths","3 Bedrms 2 Baths","2 Bedrms 1 Baths","5 Bedrms 3.5 Baths","3 Bedrms 2.5 Baths"],["Size","2428 sqft 44x40","2145 sqft 54x26","2911 sqft 60x42","1547 sqft 56x28","1056 sqft 42x28","1658 sqft 60x28","1056 sqft 42x28","2729 sqft 60x28","2334 sqft 44x28"],["Avg. Price","$247,367","$239,621","$220,765","$165,014","$124,792","$168,247","$122,980","$226,095","$202,225"],["","","","","","","","","",""]],"pageTitle":"Pennsylvania Modular Home Pricing","title":"","url":"http://www.modulartoday.com/pamodularprices.html","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"RELATION","tableNum":3,"s3Link":"common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986423.95/warc/CC-MAIN-20150728002306-00317-ip-10-236-191-2.ec2.internal.warc.gz","recordEndOffset":587203767,"recordOffset":587196542,"tableOrientation":"HORIZONTAL","TableContextTimeStampAfterTable":"{5505\u003dAll American Homes 2831 Dexter Drive Elkhart, IN 46514 (574) 266-2500 indianasales@allamericanhomes.com}","lastModified":"Thu, 05 Feb 2015 20:43:59 GMT","textBeforeTable":"Here is a modular home price list for Pennsylvania home buyers. This is a small sample of the modular homes available in Pennsylvania. It is intended to help home buyers understand the general modular home pricing for Pennsylvania. If you like any of the modular houses listed below or would like to have a house price quote for your personal situation please visit one of the local All American Homes modular home builders located throughout Pennsylvania. All American Homes 2831 Dexter Drive Elkhart, IN 46514 (574) 266-2500 indianasales@allamericanhomes.com     Company Description: \"...All American Homes offers homes from 900 to 3,000 square feet in dozens of flexible floor plans. There are layouts to suit any building site and room configurations to fit any lifestyle. Each plan is customizable to meet your requirements and preferences. Your independent All American Homes builder will explain your options and build your new home just the way you want it: inside and out, down to the very last detail. An All American home is simply A SMARTER WAY TO BUILD. Have your home built exactly the way you want it, faster, and with much better quality than typical on-site construction...\" These All American Homes prices include walk in basement foundation, personal septic system and hookup to the municipal water system. They also include a two car garage, driveway and a 25 foot walkway in these price estimates. These prices vary widely depending on your","textAfterTable":"Please remember these Pennsylvania modular home prices and details are subject to change. Every home building project is also different with different building specifications, building lot considerations and much more that needs to be customized. You should contact a local Pennsylvania modular home builder for the most current and accurate pricing. About Us   Contact Modular Today   Privacy Policy   Terms of Use   Add/Update","hasKeyColumn":true,"keyColumnIndex":0,"headerRowIndex":0}