{"relation":[["","Performance 5-yr return","Expense ratio","Risk 5 year sharpe ratio","Net assets","Average market cap","Average P/E","Portfolio turnover"],["RYRTX","+19.44%","1.62%","1.37","$84.9M","$16.5B","20.9","395%"],["Category","+20.21%","1.45%","1.34","$407.9M","$17.3B","18.2","395%"]],"pageTitle":"RYRTX - Rydex Retailing Fund Class A Mutual Fund Quote - CNNMoney.com","title":"","url":"http://money.cnn.com/quote/mutualfund/mutualfund.html?symb\u003dRYRTX","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"RELATION","tableNum":3,"s3Link":"common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989018.40/warc/CC-MAIN-20150728002309-00075-ip-10-236-191-2.ec2.internal.warc.gz","recordEndOffset":158985191,"recordOffset":158969238,"tableOrientation":"HORIZONTAL","TableContextTimeStampBeforeTable":"{29056\u003d© 2015 Cable News Network. A Time Warner Company. All Rights Reserved. Terms under which this service is provided to you. Privacy Policy. .}","TableContextTimeStampAfterTable":"{20996\u003dMost stock quote data provided by BATS. Market indices are shown in real time, except for the DJIA, which is delayed by two minutes. All times are ET. Disclaimer. Morningstar: © 2015 Morningstar, Inc. All Rights Reserved. Factset: FactSet Research Systems Inc. 2015. All rights reserved. Chicago Mercantile Association: Certain market data is the property of Chicago Mercantile Exchange Inc. and its licensors. All rights reserved. Dow Jones: The Dow Jones branded indices are proprietary to and are calculated, distributed and marketed by DJI Opco, a subsidiary of S\u0026P Dow Jones Indices LLC and have been licensed for use to S\u0026P Opco, LLC and CNN. Standard \u0026 Poor\u0027s and S\u0026P are registered trademarks of Standard \u0026 Poor’s Financial Services LLC and Dow Jones is a registered trademark of Dow Jones Trademark Holdings LLC. All content of the Dow Jones branded indices © S\u0026P Dow Jones Indices LLC 2015 and/or its affiliates.}","textBeforeTable":"Peer Comparisonvs. Consumer cyclical Data through -- +9.00% Since inception   +21.63% 1 year +19.44% 5 years   +3.32% 3 months +17.94% 3 years   +2.30% 1 month Performance Investment Objective The investment seeks capital appreciation. Under normal circumstances, the fund invests substantially all (at least 80%) of its net assets in equity securities of Retailing Companies that are traded in the United States and in derivatives, which primarily consist of futures contracts and options on securities, futures contracts, and stock indices. It will invest to a significant extent in the securities of Retailing Companies that have small to mid-sized capitalizations. The fund also may purchase American Depositary Receipts (\"ADRs\") to gain exposure to foreign Retailing Companies and U.S. government securities. It is non-diversified. Chart  vs. S\u0026P 500  vs. Category 3 month6 month","textAfterTable":"Money 50: Best Mutual Funds » There are thousands of mutual funds to choose from. Get Money Magazine’s picks in all major categories. Fund Management and Purchase Info Fund family Rydex Funds Fund manager \u0026 tenure Michael Byrum / 17 Years Minimal initial investment $2,500.00 Minimum IRA investment $1,000.00 Holdings U.S. stock 92.71% International stock 5.08% Cash 2.30% Fixed income 0.00% Other 0.00% Top 5 Sectors Portfolio weighting Consumer service  90.96% Consumer goods  6.75% Media  1.59% Business service  0.70% Energy  0.00% Top 10 Holdings Portfolio weighting WMT Wal-Mart 4.69% AMZN Amazon 4.51% HD Home Depot 3.79% CVS CVS Caremark 3.41% WBA Walgreen 2.98%","hasKeyColumn":true,"keyColumnIndex":0,"headerRowIndex":0}