{"relation":[["Code or Value","10 to 24837","66666","77777","99999","."],["Value Description","Range of Values","Since birth","Refused","Don\u0027t know","Missing"],["Count","351","1","1","10","9303"],["Cumulative","351","352","353","363","9666"],["Skip to Item","","","","",""]],"pageTitle":"NHANES 2007 - 2008: Physical Functioning Data Documentation, Codebook, and Frequencies","title":"","url":"http://www.cdc.gov/nchs/nhanes/nhanes2007-2008/PFQ_E.htm","hasHeader":true,"headerPosition":"MIXED","tableType":"RELATION","tableNum":44,"s3Link":"common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989043.35/warc/CC-MAIN-20150728002309-00060-ip-10-236-191-2.ec2.internal.warc.gz","recordEndOffset":363486025,"recordOffset":363469631,"tableOrientation":"HORIZONTAL","TableContextTimeStampBeforeTable":"{4167\u003dTitle: Physical Functioning (PFQ_E ) Contact Number: 1-866-441-NCHS Years of Content: 2007 - 2008 First Published: September, 2009 Revised: NA Access Constraints: None Use Constraints: None Geographic Coverage: National Subject:Includes questions related to functional limitations and can be used to assess disability. Record Source: NHANES 2007 - 2008 Survey Methodology: NHANES 2007 - 2008 is a stratified multistage probability sample of the civilian non-institutionalized population of the U.S. Medium: NHANES Web site; SAS transport files}","lastModified":"Fri, 09 May 2014 20:24:50 GMT","textBeforeTable":"Both males and females 1 YEARS - 4 YEARS Target: The next set of questions is about limitations caused by any long-term physical, mental or emotional problem or illness. Please do not include temporary conditions, such as a cold. Is {SP} limited in the kind or amount of play activities {he/she} can do because of a physical, mental or emotional problem? English Text: Physical,mental,emotional limitations SAS Label: PFQ010 Variable Name: PFQ010 - Physical,mental,emotional limitations Both males and females 1 YEARS - 150 YEARS Target: Respondent sequence number. English Text: Respondent sequence number SAS Label: SEQN Variable Name: SEQN - Respondent sequence number Codebook and Frequencies N/A. References Please refer to the Analytic Guidelines for further details on the use of sample weights and other analytic issues. The Analytic Guidelines are available on the NHANES website. Since the questions were asked in the home interview, the interview sample weights may be used in their analysis. However, if the data is joined with data from the Mobile Examination Center (MEC), the MEC sample weights should be used. Analytic Notes Edits were made to ensure the completeness, consistency, and analytic usefulness of","textAfterTable":"PFQ015 - Able to take part in most type of play Variable Name: PFQ015 SAS Label: Able to take part in most type of play English Text: Is {SP} able to take part at all in the usual kinds of play activities done by most children {his/her} age? Target: Both males and females 1 YEARS - 4 YEARS Code or Value Value Description Count Cumulative Skip to Item 1 Yes 20 20 2 No 11 31 7 Refused 0 31 9 Don\u0027t know 0 31 . Missing 9635 9666 PFQ020 - Crawl, walk, run, play limitations Variable Name: PFQ020 SAS Label: Crawl, walk, run, play limitations English Text: {Do you/Does SP} have an impairment or health problem that limits {your/his/her} ability to {crawl, walk or play} {walk, run or play} {walk or run}? English Instructions:","hasKeyColumn":true,"keyColumnIndex":1,"headerRowIndex":0}