{"relation":[["Course","AR141 A","AR241 A","AR242 A","AR341 A","AR342 A","AR401 A","AR402 A","AR441 A","AR442 A","AR443 A","AR444 A"],["Course Title","Drawing I","Painting I","Painting II","Painting III","Painting IV","Senior Studio Art Capstone","Senior Studio Art Capstone","Painting V","Painting VI","Painting VII","Painting VIII"]],"pageTitle":"Bevin L. Engman · College Directory | Colby College","title":"","url":"http://www.colby.edu/directory/profile/blengman/","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"RELATION","tableNum":0,"s3Link":"common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989043.35/warc/CC-MAIN-20150728002309-00324-ip-10-236-191-2.ec2.internal.warc.gz","recordEndOffset":375202427,"recordOffset":375190874,"tableOrientation":"HORIZONTAL","textBeforeTable":"Courses Currently Teaching Collage Drawing Painting Areas of Expertise Waterville, Maine 04901-8856 5633 Mayflower Hill Mailing Address: bevin.engman@colby.edu E-mail: Fax: 207-859-5635 Phone: 207-859-5633 Box 5633 Art Professor of Art Bevin L. Engman     College Directory About Multimedia Education Calendar of Events Collections Exhibitions Visit Museum of Art Museum Athletics Schedule Athletics Results Athletic Facility Hours Athletic Facilities Women\u0027s Teams Men\u0027s Teams Colby Athletics Athletics Dining Services First-Year","textAfterTable":"  The directory information is for individual use only, it may not be retransmitted or published for any reason. It is not to be used for mass solicitations by e-mail, mail, phone or other means. Sale or other distribution of this document is prohibited by College policy. Directory Search Enter name to search for: Colby Login Log in to view additional directory information such as additional profile information. Update Directory Information/Privacy Other Directories Alumni Directory Administrative Offices Contact Colby College Emergency Contacts Contact Colby College4000 Mayflower Hill Waterville, Maine 04901 P: 207-859-4000","hasKeyColumn":true,"keyColumnIndex":0,"headerRowIndex":0}