{"relation":[["FTA of Canada with…","Canadian consumption (unit)","Total imports","Imports from US/Mexico","Imports from EU","Imports from Japan","Imports from Korea","Domestic production"],["E.U.","+7,527","+10,917","-5,602","+21,829","-3,820","-1,491","-3,390"],["Korea*","+5,730","+10,211","-6,221","-898","-4,553","+21,883","-4,482"],["Japan","+9,796","+16,792","-12,577","-3,603","+37,936","-4,964","-6,996"],["EU, Korea, \u0026 Japan","+21,249","+35,656","-23,895","+16,484","+27,938","+15,130","-14,407"],["EU \u0026 Japan","+17,050","+27,241","-17,715","+17,801","+33,479","-6,325","-10,191"],["EU \u0026 Korea","+11,795","+19,790","-12,395","+20,370","-8,425","+20,240","-7,995"]],"pageTitle":"Impact of FTAs on Canadian Auto Industry","title":"Table 7: Absolute changes","url":"http://www.international.gc.ca/economist-economiste/analysis-analyse/studies-etudes/studies-etudes-01.aspx?lang\u003deng","hasHeader":true,"headerPosition":"MIXED","tableType":"RELATION","tableNum":8,"s3Link":"common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989043.35/warc/CC-MAIN-20150728002309-00316-ip-10-236-191-2.ec2.internal.warc.gz","recordEndOffset":539864447,"recordOffset":539810380,"tableOrientation":"HORIZONTAL","TableContextTimeStampBeforeTable":"{11063\u003dFirst, the turmoil in the industry over the great 2008-2009 recession has really changed relative positions of firms in the industry. Ford and Hyundai have recorded the largest absolute increases in sales. Total Canadian production has almost recovered to pre-crisis levels, to a large extent due to capacity additions by Toyota and Honda, which now produce around half of their Canadian sales locally. In addition to the recovery from the great recession, important global trends are the emerging auto industries in large developing countries and the growing importance of technologies to boost fuel efficiency., 13766\u003dJohannes Van Biesebroeck, Hang Gao and Frank Verboven June 29, 2012 Prepared for DFAIT Canada, 8607\u003dWith the Doha round of multilateral trade negotiations progressing at a glacial pace, Canada has been actively pursuing bilateral trade liberalization initiatives. It has been negotiating both with South Korea and with the European Union to form Free Trade Agreements (FTA) that would abolish most import tariffs between the two countries or groups of countries. Early in 2011, Canada also launched a joint impact study to investigate the benefits of an Economic Partnership Agreement with Japan.Footnote 1, 1983\u003dTotal sales for the Canadian market in 2010, in units and market share, as well as the growth in sales over the last five years are depicted in the first three columns of Table 1. Total sales are approximately back to the level of 2005, but firms have experienced dramatically different fortunes. The two most eye-catching changes are the collapse in sales by General MotorsFootnote 6 and the spectacular increase in sales by the two marks owned by the Korean Hyundai group, Hyundai and Kia, which even surpassed total sales by Toyota., 638\u003dThe production breakdown in the last five columns of Table 1 also tells an interesting story. Toyota and Honda are now the most Canadian of all firms. Both produce approximately half of their sales locally. The fraction for GM dropped below 20% and for Ford it even approached 10%, but it will rebound now that the St. Thomas plant has been closed (in September, 2011) which produced mostly for export. Overall, exactly 20% of all vehicles sold in Canada are produced domestically. Given that total Canadian sales only make up 11% of the entire integrated NAFTA market this is still a higher than proportional fraction., 3841\u003dOf course, Canada is not the only country pursuing bilateral trade deals. Both the E.U. and the U.S. have ratified a FTA with South Korea in 2011. In both cases, issues related to automotive trade have imposed delays between concluding the negotiations and ratifying the agreements.Footnote 5 The agreement with the U.S. in particular is likely to have important repercussions for the Canadian industry because the majority of vehicles produced in Canada are exported to the United States. Using an adjusted version of the methodology outlined above we estimate what the expected effect will be on sales of Canadian vehicles in the U.S. market when Korean firms lower their prices and all competitors are forced to respond.}","TableContextTimeStampAfterTable":"{25257\u003dFirst, we estimate a demand model that characterizes the vehicle purchase decisions of Canadian consumers. In particular, using the observed vehicle characteristics, including prices, and market shares for the years 1998 to 2010, we estimate the parameters that determine consumer preferences. The key outputs from this step are estimates of the sales responsiveness of each model to a change in its own price and to price changes of all competing models, i.e. the full set of own and cross-price elasticities., 131862\u003dCiuriak, Dan and Shenjie Chen (2008), “Preliminary Assessment of the Economic Impacts of a Canada-Korea Free Trade Agreement,” Trade Policy Research 2007, Ottawa: Foreign Affairs and International Trade Canada, pp. 187-234., 31688\u003dWe assembled annual information on each passenger vehicle model for sale in the Canadian market between 1998 and 2010. Models that sell less than 50 units per year are dropped, as well as pure luxury brands such as Ferrari or Porsche. We further dropped commercial vehicles and full size vans, which gives us a sample of 2,751 observations, growing from 153 in 1998 to 244 in 2010. Average annual sales for Canada total 1.54 million units, growing from 1.34 million in 1998 to 1.56 million in 2010 with a high of 1.67 million in 2002., 26951\u003dNote that in these calculations, all participants are allowed to adjust their behavior. All firms can change their prices to adjust to competitors and all consumers can change their purchase decisions to adjust to the changed prices. For each model sold in the Canadian market in 2010 our calculations will generate a new equilibrium prices and market share.Footnote 9, 125279\u003dFor Toyota, future expansion in North America will be foremost directed to finish the Blue Springs, MS assembly plant where the Prius will be assembled. Production was planned to start already in 2010, but this has been postponed due to the downturn in the industry. The Volkswagen Chattanooga, TN assembly plant just started producing the Passat in May 2011., 142522\u003dThese employment statistics are taken from the Industry Canada web site and the most recent statistics available there are for 2009. Note that several sub-sectors that produce parts for the automotive industry, such as engines, glass, rubber, etc., are not listed in NAICS 3363. On the other hand, parts producers are unlikely to supply only Canadian assembly plants., 27434\u003dIn particular, if a FTA with South Korea had been in effect in 2010, the landed variable cost of all models imported from Korea would have been 5.75% lower than the marginal costs that the model has generated from the actual data that includes an effective import tariff of 6.1%. Our estimate of the consumers’ price sensitivity will indicate how much of the tariff reduction will be passed on to Canadian consumers by a profit maximizing Korean firm. In addition, our pricing model together with the cross-price elasticities of the demand model will indicate to what extent competing firms will want to respond to price cuts on Korean vehicles., 115863\u003dSecond, given that the U.S. automotive market is several times the size of Canada’s, U.S. trade policy is a lot more important as a determinant of North American investment decisions. Location decisions of foreign automakers are made for the entire integrated NAFTA market. The Canadian tariff has no bearing on which NAFTA country a carmaker would select for its plant when it decides to assemble locally. The incentive for local production that the Canadian import tariff provides is only proportional to its share in NAFTA sales, which in 2010 was only 11.1%., 9206\u003dNotes: Based on 2010 sales statistics. Tata is counted as a European manufacturer (Land Rover/Jaguar), 34739\u003dIn order to incorporate consumers that did not purchase a vehicle at prevailing prices in 2010, but which might be enticed to enter the new vehicle market at lower prices, it is customary to include an “outside good”. This requires an estimate for the potential market size, which we take to be the total number of households—12.58 million in 2010. As such, in an average year we find that 87% of households choose not to buy a new vehicle., 126510\u003dWe have used a state-of-the-art demand model to simulate the impact of various trade liberalizing policy options on the Canadian automobile market. The model is estimated using model-level information for the 1998-2010 period. It features market segments that differ in the strength of within and between segment substitution to accommodate asymmetries in substitution patterns between vehicles. It also features a heterogeneous price effect in the utility function that varies with income to accommodate lower price elasticities for richer households. As a result, the demand model allows for rich and flexible patterns of substitution between vehicles., 64009\u003dWe compare the expected outcome for each trade policy simulation with the actual situation in 2010. In that year, total new passenger vehicles sold in Canada stood at 1.52 million for the models included in our sample, cars and light trucks combined. Only 305,631 vehicles, exactly 20.0% of the total, were assembled domestically and the rest are imported. The primary sources of imports are the NAFTA trading partners, the U.S. and Mexico, responsible for 53.9% of total sales. All of these vehicles are assumed to enter the country duty free.Footnote 13, 141248\u003dI did not succeed to find out which vehicles assembled in the United States or Mexico currently satisfy the NAFTA domestic content requirements and are eligible for duty-free import into Canada. I assume all do, but some models might still incur import tariffs in which case they could benefit from a new FTA. The problem is that some models might satisfy the requirement for their base model, but not for higher-end varieties with imported engines. In 2008, only three models did not satisfy the requirements at all and incurred duties when imported into Canada (BMW X5 and Mercedes-Benz G-class and M-class). Under an FTA with Europe it would be reasonable to assume these vehicles would also become exempt from duty. We have considered all vehicles assembled in the U.S. or Mexico as unaffected by any trade policy change, but note that this underestimates the FTA effects slightly (the number of vehicles involves is bound to be very small, certainly less than 0.5% of the total Canadian market)., 143582\u003dThe agreement was signed in 2007, but subsequently re-negotiated on some points. It finally passed U.S. congress in October 2011 and the Korean parliament in November 2011., 14278\u003dThe recession of 2008-09 caused a tremendous crisis in the automotive industry as sales plummeted when consumers cut back on consumption of durables, in particular motor vehicles. The sales decline together with large legacy costs bankrupted GM and Chrysler, both of which emerged quickly from Chapter 11 restructuring under partial government ownership—jointly by the U.S. and Canadian governments. Fiat bought out the government stake from Chrysler in July 2011 and following an initial public offering on November 18, 2011, the government stake in GM was substantially reduced. For further details on the travails of the industry over the recession, we refer to Sturgeon and Van Biesebroeck (2009).Footnote 7, 26355\u003dThird, we start from the observed market situation in 2010 and calculate what prices and quantities would have been if a different trade policy had been in place in that year. We assume that consumers still behave according to the demand function estimated in step 1 and that firms choose prices to maximize profits starting from the marginal costs calculated in step 2. We only change one primitive in the model—namely the import tariff applied to imports from one or more countries—and calculate the counterfactual equilibrium situation for the industry., 131248\u003dBrenkers, Randy and Frank Verboven (2006), “Liberalizing a Distribution System: the European Car Market,” Journal of the European Economic Association, March., 13361\u003dThe statistics in Table 1 and Table 2 together imply that Canada is still running a sizeable trade surplus in new vehicles. In 2010, vehicle exports totaled 1,756,928 and imports 1,222,504. Its net exports are thus 531,514 vehicles, more than one quarter of total production. We can thus characterize the Canadian automotive industry as highly integrated with the rest of the world. 80% of sales are vehicles assembled abroad; 26% even originates from another continent. 85% of production is exported—almost all to other NAFTA countries—and this share is lower for Japanese plants., 133432\u003dSturgeon, Timothy and Van Biesebroeck, Johannes (2010). “Effects of the 2008-09 Crisis on the Automotive Industry in Developing Countries: A Global Value Chain Perspective,” in Olivier Cattaneo, Gary Gereffi and Cornelia Staritz (eds.), Global Value Chains in a Postcrisis World: A Development Perspective, Washington D.C.: World Bank Publications., 120726\u003dPredicting future import levels for Hyundai-Kia is not straightforward because in 2010 its second U.S. plant was still ramping up to full production. The Elantra was added to the U.S. production lineup in November 2010 and only by the start of 2011 the company announced it was now ready to operate at full capacity of 600,000 vehicles in the U.S. In 2010, the firm sold 172,389 vehicles in Canada and 120,437 of them (69.9%) were imported. However, once its top-selling Elantra model will be sourced from within NAFTA, it would only need to import 86,508 units, or 50.1%, at unchanged sales. On the other hand, it is unlikely that the firm’s North American sales have topped out. Its market share has surged over the recession and the indication is that this will continue to grow., 111174\u003dThe second caveat in our analysis is that we were unable to obtain all the necessary data for the U.S. market that we used to estimate the Canadian demand system. We obtained U.S. sales information for 2010 from the online data center of Automotive News which allows us to construct the proper 2010 benchmark. However, we have to rely on the estimated Canadian demand system for the required price elasticities in our analysis. As the model offerings in the two countries are virtually identical and also the structural parameters in the demand system are likely to be similar this should provide a close approximation.Footnote 17, 107712\u003dFirst, the current U.S. import tariff on passenger vehicles differs from the Canadian rate. For cars, the rate is only 2.5%, but for light trucks the rate is 25%. This discrepancy has provided strong incentives for foreign producers to start producing their light trucks in the U.S. before their passenger cars. While domestic production consists of more light trucks than cars, the reverse is true for imports. This is clear from Table 11 which lists 2010 U.S. sales of passenger vehicles broken down by type of vehicle and origin., 131433\u003dBresnahan, Timothy F. (1987), “Competition and collusion in the American automobile industry: the 1955 price war,” Journal of Industrial Economics, Vol. 35, No. 4, pp. 457-82., 120514\u003dCanada and its lead has grown considerably over the 2008-09 crisis. This explains the relatively large effects we estimated for the Canada-Korea FTA even though only one firm is materially affected., 30588\u003dThere are two factors that explain the differences between the results in this report and those in Van Biesebroeck (2007). First, the benchmark year for the counterfactual analysis is now 2010, instead of 2005 before. Hyundai-Kia now operates two plants in North AmericaFootnote 10 and the fraction of sales by foreign-owned firms that is produced within NAFTA has generally increased. Moreover, the recent recession combined with the increase in fuel price and greater awareness of global warming has tilted demand towards smaller size segments., 23534\u003dThe third global trend we highlight is the rising importance of alternative fuel vehicles, such as hybrid and electric vehicles. In Japan, the Toyota Prius already is the best-selling model and under the 20/20/20 strategy the E.U. has passed extremely ambitious regulations to increase fuel efficiency of the new vehicle fleet. The new CAFE standards that the Obama administration announced on August 1, 2011 intend to raise the average fuel efficiency of the new vehicle fleet in the U.S. to 54.5 mpg by 2025. While less ambitious than the European program, these standards will affect all plants producing for the NAFTA market, including Canadian plants., 78082\u003dIn Table 8, these same changes are expressed as a fraction of total observed output in 2010. While imports from US/Mexico saw the largest decline in absolute terms, the percentage decline is the smallest of the four regions that lose sales. There are several reasons for this., 66309\u003dThe results of the different simulations are reported in Table 7 in absolute changes from the 2010 benchmark and in Table 8 in percentage changes. These results rely on the demand estimates from Model 1, assuming a two-level nested logit model with heterogeneous price effects., 9321\u003dEven though the two Japanese firms dominate the sales of vehicles that are produced domestically, accounting for 51.6% of all these vehicles, Table 2 shows that the picture is still different if production for export is included. When looking at total Canadian production for 2010, GM is still the largest producer. It just happens to produce vehicles that are more popular south of the border, exporting 91.4% of output. Its market share in Canada is also lower than in the United States. The production statistics also show a leveling in this respect with GM, Chrysler, and Toyota each producing between 460,000 and 530,000 vehicles in Canada. Furthermore, it is likely that Honda will have passed Ford in Canadian production in 2011., 94536\u003dThe first line of statistics illustrates how much tariff revenue would fall as a result of the different FTAs. The total revenue for 2010 of $424m is based on the imputed marginal costs by the model. The results indicate that a FTA with the E.U. would have a disproportionately large effect on tariff revenue. The predicted reduction in revenue of $167 million (40%) is almost as large as for a FTA with Japan even though the number of vehicles imported is only slightly more than half as large. It is, of course, the result of the high price of the vehicles imported from the E.U., 139341\u003dThe Hyundai plant in Montgomery, AL started production of Sonata and Elantra sedans in 2006. (Note that in 2010 most Elantra sales are still reported to be sourced from Korea. In our model we assume they are still subject to the 6.1% Canadian import tariff.) The Kia plant in West Point, GA started production of SUVs in November of 2009. Both plants have an annual production capacity of 300,000 vehicles., 48221\u003dIn Table 6 we present two sets of estimates. Both use all model-year observations over the 1998–2010 period and include year and year-squared and model-fixed effects as controls in the equation. This reduces the endogeneity problem in estimation. In the first column, we use heterogeneous price effects and two-level nesting of models—at the first level there are five market segments and below that two levels for the nationality of the firm (domestic or foreign). In the second column, we assume a homogenous price effect and use just one level market segment nests. This last model is almost as in Van Biesebroeck (2007), but allows the substitution parameters to vary across nests., 65144\u003dA first thing to note is that Canada produces many more vehicles than those that are sold domestically. Total new vehicle production in 2010 stood at 2.06 million and the vast majority of them (85.2%) are sold abroad. There is no reason to expect these Canadian exports to be affected by any of the Canadian trade policy changes we consider here. However, in the next section we look at the expected effects of the FTA between Korea and the U.S., which is likely to exceed the impact on the domestic industry of a possible FTA between Korea and Canada., 136706\u003dThe U.S. and South Korea signed the KORUS FTA on June 30, 2007, but it took until November 22, 2011 and one renegotiation for the agreement to pass both countries’ parliament and become law. The agreement for the E.U.–South-Korea FTA was signed on October 15, 2009 and came in effect on July 1, 2011., 13181\u003dNotes: In 2011, the CAMI plant that was started as a joint venture between GM and Suzuki became fully owned by GM. Ford closed the St. Thomas plant in September 2011., 130505\u003dBrambilla, Irene (2005), “A Customs Union with Multinational Firms: The Automobile Market in Argentina and Brazil,” NBER Working Paper No. 11745, November., 132551\u003dGoldberg, Pinelopi K. (1994), “Trade Policies in the U.S. Automobile Industry,” Japan and the World Economy, May, pp. 175-208., 133807\u003dVan Biesebroeck, Johannes (2007), “The Canadian Automotive Market,” in D. Ciuriak (ed.) Trade Policy Research 2006, Ottawa: Foreign Affairs and International Trade Canada, pp. 187-340., 89181\u003dMuch of the difference can be explained by the different base year, 2005 before against 2010 now. In the earlier study, total Korean imports stood at 124,135. While sales by Hyundai and Kia increased markedly in the following five years, their opening of assembly plants in North America as well as the production shift of several GM vehicles to North America, left total Korean imports virtually unchanged at 120,437 vehicles five years later. Moreover, in 2005 almost 30% of vehicles imported from Korea were sold by GM, which as market leader had much less of an incentive to lower prices. GM had a total Canadian market share of 28.1% at the time. In 2010, all of the imports from Korea were sold by Hyundai-Kia. A final factor to explain the difference is that the more flexible and more robustly estimated demand system has produced higher total elasticities in general. This can be seen by comparing the predicted overall increase in vehicle consumption due to a FTA with Korea, which was estimated at +3,927 for 2005 and at +5,730 for 2010 now., 33850\u003dThe sourcing location for a few other models deserves some further comments. The Mercedes-Benz G-class is mostly assembled in the U.S. (97%), but its sales numbers are only reported together with the GLK model which is produced in Europe. Given that the latter is sold in larger quantities, we assigned the combined G-class/GLK model to the E.U. Finally, GM has gradually switched most of the production of the Chevrolet Aveo and Pontiac Wave from Korea to Mexico. Given that the successor 2011 model, the Chevrolet Sonic, went in produced in Michigan in 2010, we assign both the Aveo and the Wave to U.S./Mexico. For the Suzuki Swift+, which is basically the same model as well, we could not find a reliable sourcing location (it was only sold in Canada and has already been discontinued) and we assigned it to the same location as the Aveo/Wave on which platform it stands., 127178\u003dThe nature of the counterfactual exercise is to calculate what the 2010 market equilibrium would have looked like, if an alternative trade policy had been in place. We keep the product offerings and assembly locations constant, but allow all firms to adjust their prices. Firms with models that are directly affected by a trade policy change will decide how much of the tariff cut to pass on to consumers. Firms producing competing models will decide how to respond to their competitors’ price cuts., 123115\u003dOn the other hand, the sales volumes in Table 13 are for 2010 when aggregate industry sales in North America was only 14 million. This was only 10.4% above the low point of 2009, but it is difficult to predict how far or how quickly sales will recover towards the 19 million average over the 2006-2007 period., 122545\u003dIn the third column of Table 13 we show for each firm what the total 2010 North American sales are for the one to three ‘similar’ vehicles, with similarity obviously a subjective concept. A firm like Honda claims that it can assemble any two models in the same plant, but most firms limit themselves to models based on the same platform. A first thing to note is that not a single firm right now sells 200,000 units of just a few imported models, making it unlikely that any new assembly plant will be announced soon—irrespective of the import tariff., 18957\u003dThe second important trend in the global automotive industry is the growing importance of emerging markets. Large developing countries have now clearly become the engine of growth for the industry. This does not include Mexico, which in 2010 still recorded sales 28% below its pre-crisis level. The largest growth markets are China, India, and Brazil. China has now become the largest automobile market and this is likely to remain the case for a long time. Sturgeon and Van Biesebroeck (2010) discuss this evolution in detail and summarize policy options for developing countries.Footnote 8, 33198\u003dIn 2010, several models are affected by this problem, i.e. they are assembled in two different countries and at least one is not in the NAFTA free trade area. Most importantly, the following models are all treated as assembled in the country where the majority of production takes place: BMW X3 in the U.S. (85% of its Canadian sales come from the U.S.), Honda Civic in Canada (99.4%), Honda Ridgeline in Canada (57%), Hyundai Sonata in the U.S.(99%), Hyundai Elentra in Korea (99%), Lexus RX in Canada (63%), Nissan Juke in Japan, Volkswagen Golf/Rabbit in the E.U. (81%), Toyota Highlander in U.S.(80%), and Toyota RAV4 in Canada (97%).}","textBeforeTable":"The production breakdown in the last five columns of Table 1 also tells an interesting story. Toyota and Honda are now the most Canadian of all firms. Both produce approximately half of their sales locally. The fraction for GM dropped below 20% and for Ford it even approached 10%, but it will rebound now that the St. Thomas plant has been closed (in September, 2011) which produced mostly for export. Overall, exactly 20% of all vehicles sold in Canada are produced domestically. Given that total Canadian sales only make up 11% of the entire integrated NAFTA market this is still a higher than proportional fraction. Somewhat surprisingly given the overall economic climate, the luxury brands have done extremely well, with large increases in the market shares of Volkswagen (Audi), BMW, Daimler (Mercedes-Benz), and Subaru. Also, Daimler is now again independent from Chrysler. Together with the strong performance of Nissan, it is likely that the market shares of different firms with converge further. As a result, the market has become much more leveled. Sales of the top firm in Canada (Ford) are less than double the sales of the firm in the number six spot (Honda). The combined sales of the top six groups is now over three quarters of the market, with no firm dominating. Total sales for the Canadian market in 2010, in units and market share, as well as the growth in sales over the last five years are depicted in the first three columns of Table 1. Total sales","textAfterTable":"Subaru 27,805 1.8% 74.2% Mitsubishi 19,504 1.3% 87.7% Suzuki 9,128 0.6% 3.6% Tata 3,302 0.2% 1.7% Total 1,531,045 100% -1.0% Table 1b: Country of Origin for Light Vehicle Sales in Canada in 2010   Canada U.S. \u0026 Mexico Japan Korea E.U. Ford 11.3% 86.2% N/A N/A 2.5% GM 19.3% 80.7% N/A N/A 0.0% Chrysler 35.0% 65.0% N/A N/A N/A Hyundai N/A 30.1% N/A 69.9% N/A Toyota 51.4% 32.7% 15.9% N/A N/A Honda 49.4% 42.3% 8.3% N/A N/A Nissan N/A 64.3% 35.7% N/A N/A Mazda N/A 17.7% 82.3% N/A N/A Volkswagen 1.7% 26.1% N/A N/A 72.2% BMW N/A 24.8% N/A N/A 75.2% Daimler N/A 14.2%","hasKeyColumn":true,"keyColumnIndex":0,"headerRowIndex":0}