{"relation":[["Model","CD05","CD07","CD09","CD11"],["Target Depth","3\u0027 - 6\u0027","5\u0027 - 8\u0027","7\u0027 - 10\u0027","9\u0027 - 13\u0027"],["Body Length","2\"","2-3/4\"","3-1/2\"","4-3/8\""],["Weight","3/16 oz.","1/4 oz.","7/16 oz.","9/16 oz."],["Treble Hooks","Two No. 10","Two No. 7","Two No. 5","Two No. 3"]],"pageTitle":"Rapala CountDown Fishing Lures","title":"","url":"http://www.coldwatertackle.com/rapala-countdown-fishing-lures?keyword\u003dkastmaster%20lures","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"RELATION","tableNum":2,"s3Link":"common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989018.40/warc/CC-MAIN-20150728002309-00141-ip-10-236-191-2.ec2.internal.warc.gz","recordEndOffset":375079733,"recordOffset":375063797,"tableOrientation":"HORIZONTAL","textBeforeTable":"Rapala CountDown Lure Specifications: Bass, Walleye, Pike, Musky, Trout, Salmon, Panfish, Redfish, Tarpon, Snook, Tuna, Sea Trout, Striper, Grouper, Peacock Bass, Kingfish, Bluefish, Wahoo, Dolphin Rapala CountDown Lure Species: Hand Tuned \u0026 Tank Tested Controlled Depth Technique Large Size Range Custom Action Ideal For Casting Rapala CountDown Lure Features: These lures are great for casting or trolling in freshwater or saltwater. They have a running depth of 1 to 13 feet. Consistently reach suspended fish at any depth with the CountDown® method. The controlled depth technique was introduced to the world with this lure, and to this day is the standard by which all others are measured. Whether the fish are suspending at certain depths near the weed tops or on bottom structure, the CountDown can get you to them consistently. The CD01 size is specifically designed for smaller fish, such as Trout and Panfish. Rapala CountDown Fishing Lures Reviews (0) Description Usually ships within 1-2 business days Ready to purchase? View Available Colors Not Rated Average Rating: In Stock Availability: $7.25 As Low As:","textAfterTable":"Write Review Your Name: Your Review: Note: HTML is not translated! Rating: Bad            Good Enter the code in the box below: Continue 9 Colors Available Only show products that have the following","hasKeyColumn":false,"keyColumnIndex":-1,"headerRowIndex":0}