{"relation":[["Team","Hofstra","James Madison","Delaware","Towson","Elon","William and Mary","Drexel"],["Conf","6-0","5-1","4-2","3-3","1-5","1-5","1-5"],["All","11-6","15-5","11-7","9-9","8-8","5-11","4-12"],["GF","161","265","196","171","153","158","109"],["GA","151","189","126","161","169","196","158"]],"pageTitle":"Lacrosse Magazine","title":"","url":"http://laxmagazine.com/college_women/DI/teams/delaware/index","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"RELATION","tableNum":2,"s3Link":"common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986423.95/warc/CC-MAIN-20150728002306-00283-ip-10-236-191-2.ec2.internal.warc.gz","recordEndOffset":147993199,"recordOffset":147934527,"tableOrientation":"HORIZONTAL","TableContextTimeStampAfterTable":"{167404\u003dMarch 25, 2015 Morissette Sets Draw Record in Louisville Win, 16516\u003dJuly 10, 2015 Amanda Belichick Hired as Holy Cross Women\u0027s Coach The daughter of New England Patriots coach Bill has been hired as Holy Cross head coach. She coached the last two years at Wesleyan,, 111674\u003dApril 17, 2015 Liberty Outlasts High Point in Overtime, 154950\u003dMarch 29, 2015 No. 3 UNC Women Hold Off Notre Dame 9-8, 219936\u003dMarch 2, 2015 Trio Scores All 13 as UC-Davis Beats Detroit, 64076\u003dMay 8, 2015 Hompe Leads Princeton Over Fairfield Olivia Hompe had four goals, including her 50th of the season, and Princeton dominated the second half in an 18-8 win over Fairfield in the opening round of the NCAA tournament., 132217\u003dApril 10, 2015 La Salle Rolls to 20-7 Win at St. Bonaventure, 207094\u003dMarch 7, 2015 Hendricks, Heels Top Virginia in ACC Battle Maggie Hendricks had three goals as No. 3 North Carolina knocked off No. 8 Virginia 10-7., 138719\u003dApril 7, 2015 No. 18 Blue Jays Hand No. 5 Stony Brook First Loss Johns Hopkins scored the final three goals and killed off the last seven minutes to beat Stony Brook 7-5 on Tuesday night at Homewood Field., 128167\u003dApril 11, 2015 Strong First Half Leads Hoyas Over Cincinnati, 176021\u003dMarch 21, 2015 Sailer Gets 350th Win as Princeton Beats Harvard, 66092\u003dMay 8, 2015 Weekend NCAA Tourney Preview Podcast, Staff Brackets With the NCAA tournaments getting in full swing, LM\u0027s Matt DaSilva, Corey McLaughlin, Sean Burns and Megan Schneider preview the weekend and dive deep with final four picks., 40162\u003dMay 22, 2015 Women’s Final Four Friday: It’s All or Nothing No. 2 UNC and No. 3 Duke will kick off today\u0027s semifinals, followed by a rematch of last year\u0027s championship game between No. 1 Maryland and No. 4 Syracuse. With insight from their last opponents, Lacrosse Magazine previews each game., 36305\u003dMay 25, 2015 Gallery: Maryland Hangs On for 2nd Straight NCAA Crown (WD1) North Carolina went up at the half, but Maryland rallied and captured a second straight NCAA championship with a 9-8 win at PPL Park. Photos by John Strohsacker., 124335\u003dApril 12, 2015 Winthrop Wins 12-4 Defensive Battle Over Coastal Carolina, 80340\u003dMay 1, 2015 Liberty Reaches Big South Final for First Time, 36864\u003dMay 24, 2015 Cummings Leads Maryland to NCAA Title Repeat Reigning Tewaaraton winner Taylor Cummings took over in the second half, fueling a 6-1 run in the top-seeded Terps’ 9-8 victory Sunday over second-seeded North Carolina in the NCAA championship game at PPL Park., 163590\u003dMarch 27, 2015 Stanford Finishes Off Harvard with Seven-Goal Run, 131084\u003dApril 10, 2015 Gegan Does It All in Wagner Win over Robert Morris, 54488\u003dMay 11, 2015 ICYMI: Penn State Earns Its Quarterfinal Trip Penn State had a brutal draw for the NCAA women\u0027s lacrosse tournament, but the Nittany Lions knocked off Johns Hopkins and Virginia over the weekend to earn its third quarterfinal trip in the last four years., 20877\u003dJune 30, 2015 Women’s Coaching Changes Announced in Ivy League Liz Kittleman Jackson and Anne Phillips will not be returning for the 2015-16 seasons at Columbia and Yale, respectively, as announced by each program\u0027s athletic director., 30630\u003dJune 3, 2015 Women\u0027s Lacrosse Rules on the Radar for 2016 Women’s lacrosse is constantly evolving and 2015 marks another rules change year. Will there be a major overhaul to take the sport to the next level, or will the game just take small, incremental steps?, 212388\u003dMarch 6, 2015 Freshman Tarr Leads Michigan Over St. Mary\u0027s, 195144\u003dMarch 14, 2015 #LMLive Gameday: Mid-March Madness? Just about every team of note is in action on a monster Saturday slate, headlined by No. 1 Maryland and Syracuse hosting Florida and Johns Hopkins, respectively., 65065\u003dMay 8, 2015 Lasota, Northwestern Weather Delay, Louisville Selena Lasota had four goals and an assist and Northwestern beat Louisville 10-7 in a game that featured a two-hour and 33-minute weather delay., 92282\u003dApril 25, 2015 Georgetown Rallies Past Temple, 42766\u003dMay 21, 2015 Team STX Offers Hope of Pro Women\u0027s Lacrosse Is Team STX the precursor to professional women\u0027s lacrosse? In a landscape devoid of opportunities for elite players to continue after college, it provides at least a beacon of hope., 157374\u003dMarch 28, 2015 Duke Bounces Back, Beats Syracuse 10-9 Brigid Smith had three goals as Duke bounced back from its first loss of the season with a big 10-9 ACC victory over Syracuse., 96588\u003dApril 24, 2015 High Point Upsets Winthrop in Overtime, 58313\u003dMay 10, 2015 Princeton Women in Quarters After Stony Brook Win Princeton knocked off Stony Brook 8-4, handing the No. 6 seeded Seawolves just their second loss of the season. The Tigers are heading to the NCAA quarterfinals for the first time since 2011., 167990\u003dMarch 25, 2015 Quick Start Leads No. 11 JMU Past Liberty, 148700\u003dApril 3, 2015 A-10\u0027s Top Scorer Mia Paces GW to Win over St. Joe\u0027s, 196111\u003dMarch 13, 2015 Johansen Leads USC to Fourth Straight Win, 112856\u003dApril 17, 2015 Wagner Women Win Fifth Straight, Unbeaten in NEC, 71542\u003dMay 3, 2015 Princeton Claims Ivy League Title with Win over Penn Topping the reigning Ivy champ 14-11, the Tigers secured the AQ bid to the NCAA tournament., 84583\u003dApril 30, 2015 CAAs and NCAAs: Hofstra in Control of its Own Destiny Hofstra is undefeated in conference play, but will be putting it all on the line in the CAA tournament this weekend. Winning the CAAs will lock in an NCAA automatic bid, but can they secure an at-large bid without the CAA crown?, 97658\u003dApril 24, 2015 Syracuse Downs No. 2 Seed Duke, Surges to ACC Final Syracuse avenged an ACC regular-season loss for the second straight day, knocking off No. 2 seed Duke to advance to face North Carolina Sunday for the tournament title., 213725\u003dMarch 6, 2015 Skahan Sets Tone as Temple Beats Iona, 107847\u003dApril 18, 2015 Fairfield Clinches No. 2 Seed for MAAC Tourney, 143062\u003dApril 4, 2015 Cummings Leads Maryland Rout Over Rutgers, 191244\u003dMarch 14, 2015 Hopkins Pulls Away from Hofstra in Second Half, 50582\u003dMay 16, 2015 Weekend Preview Podcast: Rematches the Flavor of Quarterfinals It\u0027s the most wonderful weekend of the year for a lacrosse fan, with the winners advancing to the final four and losers headed home. LM\u0027s Matt DaSilva, Corey McLaughlin and Megan Schneider preview a quarterfinal weekend filled with rematches in the men\u0027s and women\u0027s tournaments., 147434\u003dApril 4, 2015 UConn Stays Unbeaten at Home, in Big East, 59380\u003dMay 10, 2015 #LMLive: Quarterfinals Passports to be Stamped The second half of the DI men\u0027s quarterfinal bracket and all eight women\u0027s spots will be decided in a full day of action Sunday (along with the WD3 second round and NJCAA titles), 170204\u003dMarch 24, 2015 Penn St. Women Rally to Hand Stanford First Loss The Nittany Lions came back in the second half to hand the previously unbeaten Cardinal its first loss., 209166\u003dMarch 7, 2015 Seniors Generi, Gallagher Lead Navy, 103960\u003dApril 22, 2015 No. 18 Hopkins Dispatches With Rutgers, 123273\u003dApril 12, 2015 Vanderbilt Tops Connecticut In 2OT Win, 182628\u003dMarch 17, 2015 Stony Brook Beats Florida for First Top-10 Win Freshman Kylie Ohlmiller put up six points in Stony Brook\u0027s 12-11 win at Florida on Tuesday night, its first victory over a top-10 team., 137667\u003dApril 8, 2015 Savitcheff Scores Seven as Albany Beats Brown, 160683\u003dMarch 28, 2015 Williamson Ties High as Penn Beats Towson Iris Williamson tied her career-high of five points on three goals and two assists as Penn knocked off Towson 12-5., 49600\u003dMay 16, 2015 North Carolina Rallies Past Penn State, 11-8 North Carolina booked its trip to the semifinals by rallying past Penn State for an 11-8 victory at home in the quarterfinals Saturday., 219063\u003dMarch 2, 2015 Colorado Shuts Out Presbyterian 19-0, 28261\u003dJune 6, 2015 Shot Clock “Renaissance”: Clarifications, Reactions and More With the proposed possession clock, women\u0027s lacrosse is following a trend all NCAA sports have - increase the pace of play. Why did the committee makes this change, among others? How have coaches responded?, 216593\u003dMarch 4, 2015 Roach Scores Six as Vermont Edges High Point, 200347\u003dMarch 11, 2015 Villanova Upsets Delaware, First Win in Series History Villanova dominated the early stages of the game in an 11-9 upset over No. 17 Delaware, the Wildcats first win in the series history., 108977\u003dApril 18, 2015 Princeton Clinches Share of Ivy League Title, 81367\u003dMay 1, 2015 Penn State Downs Northwestern to Reach Final With leading scorer Maggie McCormick held scoreless, Penn State\u0027s Madison Cyr, Tatum Coffey and Steph Lazo stepped up to lead the Nittany Lions past Northwestern 13-10 in the Big Ten semifinals., 100098\u003dApril 23, 2015 Acton Hat Trick Helps Duke Topple Louisville Maddy Acton had a hat trick to lead a balanced effort in Duke\u0027s 14-7 win over Louisville in the ACC quarterfinals. The Blue Devils completed a season sweep of Louisville., 145233\u003dApril 4, 2015 Freshman Egizi Keys Richmond OT Victory, 121471\u003dApril 12, 2015 Liberty Dominates Presbyterian In 23-9 Win, 23836\u003dJune 17, 2015 Fitzpatrick Caps Career on High Note With Terrapins A 2014 graduate of Lehigh, Alex Fitzpatrick saw a whirlwind year after Maryland came calling with an offer for her to use her final year of eligibility with the NCAA champion., 223249\u003dMarch 1, 2015 #LMLive Gameday: Syracuse, Duke Dominate Brunch Syracuse took a big win over Virginia at the Carrier Dome and Duke dominated Notre Dame in Durham in the early headlining games on the first day of March., 190443\u003dMarch 14, 2015 Generi Leads Navy Over Bucknell for 6th Straight, 222408\u003dMarch 1, 2015 Tar Heels Dominate Elon 21-2, 152032\u003dApril 2, 2015 Treanor’s Health: The Reason Behind Her Faceguard Purgatory Many attributed holding Syracuse junior and 2014 Tewaaraton finalist Kayla Treanor scoreless in four games this season to her opponents\u0027 solid defense, but according to the Orange, she was simply under the weather., 22878\u003dJune 21, 2015 Give and Go: Notre Dame\u0027s Barbara Sullivan The recently-graduated Notre Dame defender and Tewaaraton finalist fielded our questions in the June issue of Lacrosse Magazine., 106806\u003dApril 19, 2015 Penn State Defeats Northwestern for First Time Since 2003 With the 14-10 upset victory, the Nittany Lions clinch a Big Ten tournament bye into the semifinals., 39114\u003dMay 23, 2015 UNC\u0027s Draw Success and the Mystery of the Stick North Carolina\u0027s run to the championship game has included some dominant stretches in the center circle, using a specially-strung yellow stick that has some coaches questioning current NCAA rules., 87999\u003dApril 28, 2015 Women\u0027s Division I Bracketology: Third Edition Syracuse and Loyola are in, winning the ACC and Patriot League titles, respectively. How will the remaining conference tournaments shake out?, 79265\u003dMay 1, 2015 Four-Goal Runs Leads Richmond Over Duquesne, 194081\u003dMarch 14, 2015 Virginia Hands Princeton First Loss of Season Four players netted hat tricks as Virginia beat Princeton 18-11, handing the Tigers their first loss of the season., 72467\u003dMay 3, 2015 WD1 Bracketology: Selection Sunday Edition All 13 AQ bids have been decided after an exciting final day of conference tournaments. Stay tuned for the women\u0027s Division I bracket announcement tonight at 9 p.m. on NCAA.com., 115501\u003dApril 16, 2015 Two Late Goals Lift Northwestern Over Notre Dame Northwestern scored two goals in the final five minutes and Bridget Bianco made a save with 41 seconds remaining to preserve a 10-9 victory over Notre Dame., 178812\u003dMarch 19, 2015 JMU Evolves Mentality with Hopes of an NCAA Bid The No. 9 Dukes believe they\u0027re the strongest they\u0027ve been since 2010 and turn to face Maryland, their fifth Top 20 opponent this season, on Saturday. Could this game help prove they’re among the best in the country?, 221169\u003dMarch 1, 2015 No. 5 Duke Cruises Past Notre Dame With Ease Behind five goals from senior Katie Trees, the Blue Devils trumped the Irish 17-3 in both teams\u0027 ACC opener. Notre Dame\u0027s only scorer was Cortney Fortunato., 210319\u003dMarch 7, 2015 Weekend Preview Podcast: The West Will Be Won Notre Dame and Denver meet in a battle of western Division I men\u0027s powers while Maryland and Syracuse tangle in a Division I women\u0027s title game rematch. We talk those, and more., 159389\u003dMarch 28, 2015 Stony Brook Snows Under Oregon to Stay Perfect Dorrien Van Dyke had four goals and three assists as No. 7 Stony Brook overcame a snow delay and handled Oregon 16-3., 14232\u003dJuly 27, 2015 Reese Named IWLCA Division I National Coach of the Year Coach for two-time Division I national champion Maryland, Cathy Reese has been named the IWLCA National Coach of the Year by the IWLCA on Monday morning., 174916\u003dMarch 21, 2015 Hopkins Downs Georgetown for Fourth Straight, 88981\u003dApril 27, 2015 Gallery: Syracuse Streaks to ACC Crown (WD1) Behind Kayla Treanor\u0027s OT winner, Syracuse completed a sweep to the ACC crown from the No. 7 seed with Sunday\u0027s win over North Carolina. Photos by Matt Riley., 17496\u003dJuly 6, 2015 JMU Hires Two-Time All-American Julie Gardner as Assistant Julie Gardner, a two-time All-American at Virginia, has joined the James Madison women\u0027s lacrosse coaching staff as an assistant coach, coach Shelley Klaes-Bawcombe announced Monday., 116599\u003dApril 16, 2015 Your Edge: Fish for Quick Sticks How Virginia\u0027s All-American Courtney Swan baits defenders to find the back of the net. It starts with what she likes to call the ponytail rule., 110819\u003dApril 17, 2015 Delaware Women Clinch Spot in CAA Tournament, 120396\u003dApril 12, 2015 High Point Outpaces Campbell In 21-6 Win, 161571\u003dMarch 27, 2015 Big Ten Blowout: Terps Dominate Northwestern Freshman Megan Whittle scored five goals and Taylor Cummings had 13 draw controls as Maryland dominated Northwestern 16-5 in the first Big Ten game., 165348\u003dMarch 26, 2015 Slow Start to the Season Doesn’t Mean Anything for the \u0027Hoos In what seems like an annual occurrence, Virginia started the season with a 3-4 record. But in one week, the Cavs topped then-unbeaten Princeton, edged one-loss JMU, and picked up their first ACC win over previously unbeaten Duke., 150766\u003dApril 3, 2015 Stanford Makes MPSF Statement with Win at Denver Stanford jumped all over Denver early and rebounded from a loss earlier this week to Cornell with a 14-7 victory against their MPSF rival Friday., 215720\u003dMarch 4, 2015 Delaware Offense Outdoes Monmouth Defense, 93350\u003dApril 25, 2015 McMunn Sparks Princeton to Ivy Regular Season Erin McMunn scored five goals as Princeton downed Brown 14-8 to wrap up sole possession of first place in the Ivy League regular season. The Tigers will host next weekend\u0027s Ivy League tournament., 130189\u003dApril 10, 2015 Coastal Carolina Notches Big Win over High Point, 133137\u003dApril 10, 2015 Wildcats Cruise Past Rutgers for Fourth Straight Win, 129221\u003dApril 11, 2015 #LMLive Gameday: Sun Shining April Saturday It\u0027s a beautiful day for lacrosse, and there\u0027s some great contests on the slate, including a TV twin-bill at North Carolina and the always exciting Army-Navy tilt., 19701\u003dJuly 1, 2015 Sellers Announces Resignation as Coastal Carolina Coach Coastal Carolina director of athletics Matt Hogue announced he has accepted the resignation of women’s lacrosse coach Jaime Sellers, the Chanticleers’ first and only head coach in the program., 127063\u003dApril 11, 2015 Old Dominion Clinches Atlantic Sun Tourney Berth, 134225\u003dApril 10, 2015 UNH Continues Dominance of Binghamton, 63026\u003dMay 8, 2015 Gilroy Powers Florida Past Stanford Shannon Gilroy had five goals, including the 250th of her career, as Florida beat Stanford 15-10 in the opening round of the NCAA women\u0027s lacrosse championship. The Gators play at North Carolina on Sunday., 52735\u003dMay 14, 2015 #WorldLax: Send Us Your International Lacrosse Photos! College lacrosse is at the forefront of your minds, we know, but we\u0027re gearing up for a special look at international lacrosse, and want you to be included. Send us your photos from lacrosse overseas. Use #WorldLax., 109866\u003dApril 18, 2015 UConn Rallies to Stun Florida 11-10 in Big East Down by seven goals, UConn rallied to beat No. 9 Florida 11-10. It was the second-highest ranked team UConn has ever beaten., 32697\u003dMay 28, 2015 Thompson, Cummings Earn Second Straight Tewaaraton Honors Albany senior Lyle Thompson and Maryland junior Taylor Cummings are Tewaaraton Award winners for the second straight year, earning the honor Thursday evening in Washington, D.C., 119328\u003dApril 12, 2015 Bryant Tops LIU Brooklyn, 16-12, 192436\u003dMarch 14, 2015 Loyola Downs Lafayette in Patriot Opener, 86847\u003dApril 30, 2015 Stevenon Leads Denver in First Career Start, 21828\u003dJune 24, 2015 Cummings Named Big Ten Female Athlete of the Year The Big Ten Conference announced Wednesday that two-time Tewaaraton winner Taylor Cummings was named the Female Athlete of the Year., 99296\u003dApril 23, 2015 Tewaaraton Names 25 Final Nominees for \u002715 Awards 25 men\u0027s and 25 women\u0027s players have been announced as nominees for the Tewaaraton Award, including returning winners Lyle Thompson and Taylor Cummings., 31627\u003dMay 29, 2015 You Know It: Cummings Repeats as Tewaaraton Winner Junior midfielder Taylor Cummings became Maryland\u0027s second two-time recipient of the Tewaaraton Award Thursday night, joining Lyle Thompson as the first duo to repeat as winners., 144313\u003dApril 4, 2015 Florida Defeats Georgetown in Big East Showdown With Shannon Gilroy\u0027s five goals and three assists, No. 10 Florida easily shuts down Georgetown for an 18-4 victory., 189214\u003dMarch 14, 2015 Drexel Beats Villanova to Stop Five-Game Skid, 103130\u003dApril 23, 2015 Syracuse Takes Down Boston College in 2OT Syracuse moved on to the ACC semifinals thanks to some nifty moves and a tough angle shot from Kayla Treanor, giving the Orange a 14-13 double OT win over Boston College., 158356\u003dMarch 28, 2015 Georgetown Opens Big East Play with Win, 166243\u003dMarch 25, 2015 DiMartino Leads Hopkins Past Vanderbilt, 74970\u003dMay 2, 2015 Loyola Makes No. 3 Syracuse 14th Straight Victim Molly Wolf made 13 saves as Loyola won at No. 3 Syracuse 9-7. Loyola (15-4) has now won 14 straight games heading into the NCAA tournament., 94505\u003dApril 25, 2015 Roach, Seifert Help Vermont Clnich AE No. 3 Seed, 83503\u003dMay 1, 2015 Wagner Dominates Mount to Reach NEC Final, 198272\u003dMarch 11, 2015 Duryea, Duke Defense Handle Georgetown, 61980\u003dMay 8, 2015 DeSimone Delivers in Penn\u0027s OT Win Over Albany Lely DeSimone scored the game-winner on a free position with 3:27 to play in overtime, capping a four-goal day for the junior. Penn will face Syracuse on Sunday., 105054\u003dApril 21, 2015 Murphy, Van Dyke Lead Stony Brook Past Hofstra, 186571\u003dMarch 15, 2015 No. 12 Penn State Rolls Past Vanderbilt, 17-10, 95607\u003dApril 25, 2015 Gallery: Harvard Routs Yale to Earn Ivy Spot (WD1) In a rivalry game that also decided the final spot in the Ivy League tournament, Harvard routed Yale, 15-4 in Cambridge. Photos by Bill Danielewski., 136589\u003dApril 9, 2015 Stanford Draws Up Victory Over Oregon, 18628\u003dJuly 2, 2015 Maryland Grads Brady, Griffin Earn Coaching Positions Recent graduates from the 2015 national championship squad Shanna Brady and Brooke Griffin were named assistant coaches at LIU Post and Boston College, respectively., 217977\u003dMarch 4, 2015 Fox Sports To Show Six Ivy League Games, 82536\u003dMay 1, 2015 Stunner: Ohio State Hands Maryland First Loss Ohio State shocked Maryland 11-10 in the semifinals of the Big Ten Championship tournament, snapping the defending national champions\u0027 27-game winning streak., 204575\u003dMarch 8, 2015 #LMLive Gameday: Sunday Slate Wall-to-Wall action continues through the Sunday schedule, with 73 contests on tap across the country., 162697\u003dMarch 27, 2015 Doyle Ties Richmond Record in Win over Bonnies, 34236\u003dMay 27, 2015 Epoch/LM POTW: Taylor Cummings and Wes Berg A pair of Tewaaraton Award finalists earned Most Outstanding honors and NCAA crowns over the weekend - who but Maryland\u0027s Taylor Cummings and Denver\u0027s Wes Berg could be the final Epoch/LM Players of the Week for the year?, 126451\u003dApril 11, 2015 Kent Comes up Big as Boston College Beats Tech, 177858\u003dMarch 19, 2015 Top-Ranked Maryland Downs Penn to Improve to 8-0 Four goals each from Brooke Griffin and Megan Whittle led the Terrapins to a 12-7 victory over No. 15 Penn at home., 185390\u003dMarch 15, 2015 Dillon Scores Four in Denver\u0027s Win over New Hampshire, 122528\u003dApril 12, 2015 No title, 201669\u003dMarch 10, 2015 Cross Scores Four as \u0027Cuse Beats Florida in OT The fifth-ranked Orange outlasted the Gators 14-13 behind midfielder Kelly Cross\u0027 fourth goal of the night in Gainesville., 211263\u003dMarch 7, 2015 Gallery: Maryland Outguns Syracuse in Rematch (WD1) Three returning Tewaaraton finalists were on the field as Maryland hosted Syracuse in College Park, with the Terrapins holding on for a 10-7 win. Photos by John Strohsacker., 70630\u003dMay 3, 2015 CAA Champion James Madison Punches NCAA Ticket The No. 2 seed James Madison topped the No. 4 seed Towson 13-6 to earn the AQ for the NCAAs., 44881\u003dMay 20, 2015 Women\u0027s Wednesday: Can Maryland Defend its National Title? It seems like yesterday that Maryland won the NCAA championship and this year\u0027s final four is reminiscent of last season\u0027s top echelon of ACC rivals. Can the Terps win it again?, 78233\u003dMay 1, 2015 Albany Escapes Vermont in OT to Move On, 53338\u003dMay 13, 2015 WD1 Wednesday: Unseeded Teams Survive and Advance Three unseeded teams advanced to the quarterfinals this weekend - Loyola with a win over No. 5 Boston College, Princeton with a win over No. 6 Stony Brook and Penn State with a win over No. 7 Virginia., 90021\u003dApril 26, 2015 Loyola Tops Navy for Second Straight Patriot League Title Kara Burke and Hannah Schmitt each scored four goals in Loyola\u0027s 14-9 win over Navy for the Greyhounds\u0027 second straight conference title., 35195\u003dMay 25, 2015 Terps\u0027 Postgame Celebration: We Are the Champions! From Whittle throwing her hands up in the air with 30 seconds left on the clock to Cummings leading the charge back to the locker room with the lacrosse net draped over her and her teammates\u0027 backs, Maryland\u0027s feat to repeat is now complete., 204928\u003dMarch 7, 2015 Championship Rematch: Cummings Lifts Maryland Past Syracuse With seven points and six draw controls, it was another Taylor Cummings show as Maryland faced Syracuse for the first time since the NCAA championship game last May. The Terps won 10-7., 73888\u003dMay 2, 2015 Florida Avenges UConn Loss, Wins Big East Shannon Gilroy had four goals, five draw controls and three caused turnovers, and helped key a dominant second half as Florida beat Connecticut 20-6 to win the Big East championship., 183702\u003dMarch 16, 2015 UMBC AD: \u0027Our Student-Athletes Are Safe\u0027 Five UMBC women’s lacrosse players who are suspended due to threatening text messages about teammates engaged in “language and social media behavior not becoming of who we are as an athletic department and institution,” athletic director Tim Hall said Monday., 43798\u003dMay 21, 2015 Semi-Pro Women\u0027s Lacrosse Coming in 2016 STX has partnered with Play It Forward Sport Foundation to launch the United Women\u0027s Lacrosse (UWLX) league, a semi-professional, post-collegiate women\u0027s lacrosse league starting in 2016., 33259\u003dMay 28, 2015 Tewaaraton Watch: It\u0027s Taylor\u0027s To Lose Maryland junior midfielder Taylor Cummings was named the Most Outstanding Player for the second consecutive year. She was also the only Tewaaraton finalist in this year\u0027s NCAA championship., 29485\u003dJune 4, 2015 Women’s Lacrosse Rules Committee Recommends Shot Clock If approved, the rule (a 90-second possession clock) would be effective in 2017 for Division I and 2018 for Divisions II and III. Plus updates to stick checks, alternating possessions and overtimes., 38038\u003dMay 24, 2015 #LMLive Gameday: Maryland-UNC NCAA DI Women\u0027s Final Maryland and North Carolina meet at PPL Park with the NCAA title on the line. Will it be the defending champion Terrapins, or the 2013 champion Tar Heels? Follow along with Lacrosse Magazine\u0027s crew., 102123\u003dApril 23, 2015 UNC Overcomes Game Effort From Virginia Tech Second-ranked North Carolina trailed for much of the first half and led by just one goal at the half before pulling away to beat Virginia Tech 18-12 in an ACC quarterfinal on Thursday., 183413\u003dMarch 16, 2015 IWLCA DI Poll: Maryland Sweeps to No. 1 (Again), 212101\u003dMarch 6, 2015 Eipp Hat Trick, Strong Defense Lead UMass, 124059\u003dApril 12, 2015 Wagner Cruises Past St. Francis, 19-10, 131391\u003dApril 10, 2015 Injury Update: Hendrick Out, Status of Brust and Rix Unknown Both Molly Hendrick (UNC) and Faye Brust (Louisville) tore an ACL this past weekend, while Mikaela Rix (Boston College) suffered a concussion., 137364\u003dApril 8, 2015 Florida Overcomes Marquette, Cold in Big East Win, 45911\u003dMay 19, 2015 Epoch/LM POTW: Sydney Holman and Matt Landis Sydney Holman had six points, including back-to-back goals in a key comeback stretch for North Carolina, while Matt Landis helped hold Lyle Thompson to 1-for-11 shooting in Notre Dame\u0027s win over Albany. They are our Epoch/LM Players of the Week., 182319\u003dMarch 17, 2015 Bumgardner\u0027s Big Night Lifts George Washington, 81081\u003dMay 1, 2015 Michaels Leads USC Into MPSF Championship, 196409\u003dMarch 12, 2015 Florida Searching for Signature Win vs. No. 1 Maryland The Gators have yet to notch a significant win since falling to North Carolina in their season opener and to Syracuse in overtime on Tuesday. Florida faces the Terps in their first-ever meeting on Saturday., 117299\u003dApril 15, 2015 Hompe\u0027s Trick Sends Princeton Past Penn Olivia Hompe closed the first half with a goal and opened the second with two more, sparking No. 18 Princeton to a 9-7 triumph over Penn on Wednesday night., 56699\u003dMay 10, 2015 Maurer Sets Duke Assist Mark as Devils Down USC Kerrin Maurer became Duke\u0027s all-time assist leader with 117 as the Blue Devils knocked off USC 17-9 in the second round of the NCAA women\u0027s lacrosse championship., 163895\u003dMarch 27, 2015 Syracuse Midfielder Kelly Cross Suspended Indefinitely After crashing a Ford Explorer early Monday morning, Syracuse junior midfielder Kelly Cross has been suspended indefinitely due to a violation of team rules, the athletic department confirmed Friday., 105352\u003dApril 21, 2015 Epoch/LM POTW: Katherine Finkelston and Jack Kelly She sparked a huge UConn rally in an upset of Florida, while he anchored Brown to a key Ivy League win over Cornell. Both earned Epoch/LM Player of the Week honors., 162389\u003dMarch 27, 2015 DeScenza Shines Again for OSU in Big Ten Opener, 228387\u003d\u0026copy2014 Copyright US Lacrosse, Inc. 113 West University Parkway | Baltimore, MD 21210 Telephone: 410.235.6882 | Fax: 410.366.6735 E-mail: | About LM | Contact, 107553\u003dApril 18, 2015 Cornell Rallies Past Harvard, Earns Ivy Spot, 172665\u003dMarch 22, 2015 #LMLive Gameday: Orange Sunday Syracuse\u0027s men and women are both in action in key tilts on a busy Sunday, with the unbeaten men hosting Duke and the women travelling to Northwestern. What else is in store?, 221657\u003dMarch 1, 2015 Ohio State Rebounds with 15-2 Win over Niagara, 60928\u003dMay 8, 2015 Bocklet\u0027s Seven Points Lead UVa Over Winthrop Casey Bocklet had four goals and three assists to lead a quartet of Virginia player with hat tricks as the Cavaliers beat Winthrop 18-6 in the opening round of the NCAA women\u0027s lacrosse tournament., 73466\u003dMay 3, 2015 Lacrosse Magazine\u0027s Selection Sunday Live Keep up as the NCAA fields come together - beginning at 7:30 with the DII men through the 9 p.m. men\u0027s (ESPNU) and women\u0027s (NCAA.com) DI broadcasts., 136305\u003dApril 9, 2015 McCormick Dishes Out Win for Penn State, 167105\u003dMarch 25, 2015 Loyola Downs Georgetown for Fifth Straight Win, 51233\u003dMay 16, 2015 #LMLive Gameday: Quarterfinals Rematch Central It\u0027s a wall-to-wall day on the season\u0027s penultimate weekend, with three DI women\u0027s and two DI men\u0027s quarterfinals headlining - including the anticipated Notre Dame-Albany rematch at 3 in Denver., 169233\u003dMarch 25, 2015 Gallery: Penn State Rallies to Down Stanford (WD1) Penn State rallied from a big halftime deficit to hand Stanford its first loss of 2015 at home. Photos by Mark Selders/Penn State Athletics., 101091\u003dApril 23, 2015 Irish Defense Shuts Down Virginia in 7-6 Victory Notre Dame went on the road and held off host Virginia 7-6 in the ACC quarterfinals, earning a significant boost to its postseason resume and a trip to the ACC semifinals against regular season champion North Carolina., 69558\u003dMay 4, 2015 ICYMI: Upsets Set Stage for Wild Tournament Three of the nation\u0027s top four teams enter the NCAA tournament coming off a loss this weekend. Meanwhile, Penn State won the Big Ten championship, but was rewarded with a tough road to hoe., 203503\u003dMarch 8, 2015 ICYMI: Reality Check Coming for Top Programs The weekend in review and Florida is one of several teams with big tests this week after easing into the season., 173641\u003dMarch 21, 2015 Bocklet, Cavs Hand Duke First Loss of Season Virginia dominated the first half and Casey Bocklet had four goals as the Cavaliers beat No. 2 Duke 13-10., 220706\u003dMarch 1, 2015 ICYMI: The Toughest Job in Sports Looking back at the weekend in women\u0027s Division I lacrosse and why there\u0027s no tougher job in sports than officiating women\u0027s lacrosse., 46938\u003dMay 18, 2015 ICYMI: The Women\u0027s Final Four Teams in a Word There are no surprises with the top four seeds reaching the NCAA semifinals. But who are these teams? Here\u0027s a look at each as defined by a single word., 168272\u003dMarch 25, 2015 Stanwick Sets Record as BC Beats Colorado Covie Stanwick became Boston College\u0027s all-time leading scorer with 273 points as the Eagles beat Colorado 17-9 on Wednesday night., 90524\u003dApril 26, 2015 Treanor\u0027s OT Goal Lifts Syracuse Past UNC for ACC Title In double overtime, Kayla Treanor rounds the crease to score the game winner for Syracuse as the Orange take the ACC crown with a 9-8 win., 26597\u003dJune 11, 2015 IWLCA Honors 12 With Positional Awards Tewaaraton winner Taylor Cummings, Kayla Treanor, Megan Douty and Caylee Waters were DI position award winners as the IWLCA announced its honors for women\u0027s lacrosse., 153672\u003dMarch 31, 2015 Epoch/LM POTW: Megan Whittle and Connor Cook Whittle has become a key cog in the Maryland machine as a freshman, and Cook powered his team to a big league win after suffering a family tragedy a week before. Both are Epoch/LM Players of the Week., 184779\u003dMarch 15, 2015 Syracuse Survives Scare With Rally Over Harvard, 142224\u003dApril 4, 2015 Canisius Rolls to Sixth Straight Win, 127366\u003dApril 11, 2015 Princeton Rallies Past Cornell, Unbeaten in Ivy Faced with a three-goal second half deficit, Princeton ripped off five straight goals and hung on to beat Cornell, 13-11, and remain unbeaten in the Ivy League., 48035\u003dMay 17, 2015 #LMLive Gameday: Final Three Spots for Final Four Three DI bids to the DI final four remain, with Maryland-Northwestern women and Syracuse-JHU men battling at noon and Maryland-UNC men at 2:30 to determine whose season continues, along with the WD2 final, WD3 QFs and last MD2 and MD3 semis., 15029\u003dJuly 16, 2015 NCAA Rules Oversight Panel Approves Possession Clock After discussing the proposals recommended by the NCAA rules committee on a conference call Wednesday, the NCAA playing rules oversight panel approved all 17 rules proposals, including the 90-second possession clock., 55617\u003dMay 10, 2015 Carolina Downs Florida to Reach Quarters Second-seeded North Carolina beat Florida 11-6 on Sunday. to move onto the NCAA quarterfinals. The Tar Heels got 10 saves from Caylee Waters and four goals from Aly Messinger., 222665\u003dMarch 1, 2015 Maryland Unanimous No. 1 in IWLCA DI Poll, 180431\u003dMarch 19, 2015 Gallery: Top-Ranked Maryland Runs By Penn (WD1) No. 1 built a big early lead and never looked back in a non-conference win Wednesday over Penn. Photos by John Strohsacker., 216887\u003dMarch 4, 2015 Temple Rallies for Another Tight Victory, 49127\u003dMay 16, 2015 Duke Defense Stands Tall in 7-3 Win Over Princeton Duke earned its seventh final four trip in school history with a dominant defensive effort, downing visiting Princeton 7-3 at home., 85770\u003dApril 30, 2015 Kiernan Leads Colorado to MPSF Semifinals, 210031\u003dMarch 7, 2015 Winthrop Dominates Vermont Behind Defense, 16097\u003dJuly 13, 2015 Going Pro: Faces of the Game? Paul Rabil may be the most known face in the game today, but there are several other players held in similar regard by the community at large., 77284\u003dMay 2, 2015 Gallery: Towson Downs Hofstra in CAA Semis (WD1) Towson earned a date with James Madison in Sunday\u0027s CAA final by defeating top-seed Hofstra on Friday afternoon. Photos by Kevin P. Tucker., 111959\u003dApril 17, 2015 Stony Brook Tops UMBC, Will Host AE Tournament, 118290\u003dApril 15, 2015 WD1 Wednesday: Can the Blue Jays Fly into the Postseason? After upsetting No. 5 Stony Brook this past week, Hopkins\u0027 chances to earn an at-large bid to the NCAA Tournament may be looking good. Plus, an inside look at the women\u0027s two-man game with assistant Steele Stanwick., 25482\u003dJune 15, 2015 From Coast to Coast, U.S. Women Take Pride in Selection The 36-player roster for the 2015-16 U.S. Women\u0027s National Team that will train for the 2017 FIL World Cup in England represents 13 different colleges. Drawing inspiration from \"Miracle,\" the women now represent the United States., 135281\u003dApril 9, 2015 Eight Added to Tewaaraton Watch Lists in Second Update Freshmen Selena Lasota (Northwestern) and Trevor Baptiste (Denver) were among the names added to the Tewaaraton Watch Lists in the second in-season update., 143350\u003dApril 4, 2015 Dartmouth\u0027s First Win is Cornell\u0027s First Ivy Loss Jaclyn Leto\u0027s overtime goal lifted Dartmouth to a 10-9 victory over Cornell., 104242\u003dApril 22, 2015 UNC, BC Headline Women\u0027s All-ACC Selections, 197493\u003dMarch 12, 2015 Gallery: No. 1 Terps Hand Towson First Loss (WD1) Maryland\u0027s defense was rock solid as the No. 1 Terps throttled previously unbeaten Towson 17-2 on Wednesday night. Photos by John Strohsacker., 128464\u003dApril 11, 2015 Temple Beats Marquette for First Big East Win, 214005\u003dMarch 6, 2015 Stetson Closes with Four Straight to Beat Presbyterian, 68545\u003dMay 5, 2015 Epoch/LM POTW: Mike Rooney and Loren Generi Record-setting performances to close their seasons and careers earn Stony Brook\u0027s Mike Rooney and Navy\u0027s Loren Generi Epoch/LM Player of the Week honors., 149852\u003dApril 3, 2015 Karwacki Snares 21 Draws in Return to RMU Lineup, 218765\u003dMarch 3, 2015 Ms. 400: Navy\u0027s Generi Reaches Draw Control Mark, 165944\u003dMarch 25, 2015 Bocklet Powers Virginia Past William \u0026 Mary, 130492\u003dApril 10, 2015 Fast Start Propels Towson Women Past Drexel, 146038\u003dApril 4, 2015 Penn State Holds Off Ohio State for Big 10 Win Ohio State nearly came back from a late four-goal deficit, but Penn State held on for a 14-13 victory., 134506\u003dApril 10, 2015 Gallery: Hofstra Takes Down Delaware, 6-5 (WD1) Brittain Altomare helped Hofstra win its third straight with a 6-5 victory over Delaware on Friday afternoon. Photos by Kevin P. Tucker., 121750\u003dApril 12, 2015 Maryland Outlasts Ohio State, Remains Undefeated The Terps topped Big Ten rival Ohio State 13-8 behind hat tricks from Taylor Cummings, Brooke Griffin and Megan Whittle., 214859\u003dMarch 4, 2015 Cincinnati Earns First Victory of Season, 141201\u003dApril 5, 2015 Craig\u0027s Late OT Strike Lifts Northwestern Over Penn Kaleigh Craig scored with just 13 seconds left in overtime to give the Wildcats a 9-8 victory over visiting Penn in non-league action Sunday afternoon., 86552\u003dApril 30, 2015 Ohio States Wins, Will Face Maryland in Semis, 109582\u003dApril 18, 2015 Terps Knocks Off Michigan on Senior Day, 224678\u003dMarch 1, 2015 Gallery: Syracuse Romps Over Virginia at Home (MD1) In an annual early-spring headliner, Syracuse left little doubt, jumping to a big lead and routing the visiting Cavaliers. Photos by Greg Wall., 120671\u003dApril 12, 2015 ICYMI: The Battle for the Island Heats Up Stony Brook had a landmark win over Northwestern on Sunday, but with four wins over the last 10 days, Long Island rival Hofstra has suddenly put itself into the national picture., 125144\u003dApril 12, 2015 Gallery: Princeton Holds Off Cornell in Ivy Action (WD1) 17th-ranked Princeton took a key Ivy League contest in a visit to No. 19 Cornell, winning 15-13. Photos by Greg Wall., 113966\u003dApril 16, 2015 No. 1 Maryland Routs No. 15 Johns Hopkins Brooke Griffin scored five goals as the Terps rolled over the Blue Jays., 156491\u003dMarch 28, 2015 Berglin Stuffs Navy in Colgate Upset Jennie Berglin made a career-high 14 saves as Colgate upset Navy 10-4 in the Patriot League., 192135\u003dMarch 14, 2015 Late Save Lets Syracuse Avoid Harvard Upset Bid, 202450\u003dMarch 9, 2015 Highlights: A Feast From Around the Game A cornucopia of highlights from the past weekend\u0027s action awaits - footage from Denver-Notre Dame, Northwestern-Colorado, a goalie goal from Yale and more!, 83789\u003dMay 1, 2015 Winthrop Rallies From Six Down to Beat High Point, 151586\u003dApril 3, 2015 Weekend Preview: Duke and Carolina Await Tests Both the men\u0027s and women\u0027s programs on Tobacco Road face stiff tests this weekend, part of a big slate of contests awaiting lacrosse fans., 115218\u003dApril 16, 2015 Treanor Leads Syracuse Past Louisville, 177118\u003dMarch 21, 2015 Brust Leads Louisville to First ACC Victory, 165058\u003dMarch 26, 2015 Levatino Sparks Fresno Past St. Mary\u0027s (Calif.), 119590\u003dApril 12, 2015 Duquesne Downs La Salle, 10-8, 223700\u003dMarch 1, 2015 Gallery: Duke Jumps All Over Notre Dame (WD1) Katie Trees scored five as Duke cruised by Notre Dame in both teams\u0027 ACC openers in Durham. Photos by Peyton Williams., 106337\u003dApril 19, 2015 Louisville Tops Notre Dame for Significant ACC Win Behind Cortnee Daley\u0027s four goals, the Cardinals defeated the Irish 10-8 for a key conference victory., 190002\u003dMarch 14, 2015 Fortunato Scores Eight as Irish Pull Away From Tech Tied 7-7 at the half, Cortney Fortunato (8g) keyed a dominant second half as Notre Dame beat Virginia Tech 15-8., 41683\u003dMay 22, 2015 Gallery: UNC Into NCAA Finals With Rout of Duke (WD1) North Carolina took a 16-7 victory over rival Duke in the first NCAA semifinal from PPL Park to earn a trip to Sunday\u0027s final. Photos by John Strohsacker., 171378\u003dMarch 22, 2015 Gilroy’s Career Day Leads Florida to First BIG EAST Win, 185702\u003dMarch 15, 2015 ICYMI: Eight Days in March for Northwestern Wrapping up the weekend and a look at a Northwestern team used to winning national championships. How big of a threat are the Wildcats in 2015? We should find out in an eight-day stretch., 147725\u003dApril 4, 2015 Unbeaten Stony Brook Edges Albany in AE Battle Courtney Murphy scored three goals and No. 6 Stony Brook held the nation\u0027s No. 2 offense to its lowest goal total of the season in a 7-5 win over No. 16 Albany., 206232\u003dMarch 7, 2015 Colorado Upset Bid Derailed by Northwestern, 208135\u003dMarch 7, 2015 Penn State Bounces Back, Loyola Woes Continue Penn State came back from a one-goal loss to Virginia to handle Loyola 12-8, dropping the Greyhounds to 1-4 this season., 179993\u003dMarch 19, 2015 Tewaaraton Watch Lists Updated With 11 Top Performers Three women\u0027s and eight men\u0027s players were added to the Tewaaraton Award Watch Lists in the first 2015 in-season update., 91469\u003dApril 25, 2015 Altomare Sets Mark and Hofstra Rallies Late Brittain Altomare broke Hofstra\u0027s all-time points record and the Pride rallied with three goals in the final three minutes for a 9-8 victory over Drexel., 67488\u003dMay 7, 2015 Hottest Question on WD1 Bracket: How did USC get in? After losing in the MPSF championship to Stanford and lacking the significant wins, USC still earned an at-large bid into the NCAAs. How?, 199514\u003dMarch 11, 2015 Stanwick OT Snipe Lifts BC Over Louisville No. 4 Boston College trailed for most of the way before Covie Stanwick\u0027s goal with six seconds left in OT gave the Eagles a 16-15 win over No. 10 Louisville., 140178\u003dApril 7, 2015 Epoch/LM POTW: Ben Williams and Cortney Fortunato Syracuse needed to keep Albany\u0027s offense off the field and Notre Dame needed a signature win. Thanks to Epoch/LM Players of the Week Ben Williams and Cortney Fortunato, both of those things happened., 188935\u003dMarch 14, 2015 Cornell Stays Unbeaten in Ivy League, 193320\u003dMarch 14, 2015 Rix Sets Boston College Career Goals Record at 169 Mikaela Rix scored four goals, giving her a Boston College school record 169 for her career, as the Eagles beat UConn 13-5., 132513\u003dApril 10, 2015 Late FP Goal Lifts Bryant to Win over Sacred Heart, 216008\u003dMarch 4, 2015 Louisville Blanks Duquesne Behind Morissette, 138243\u003dApril 8, 2015 WD1 Wednesday: Bracketology, First Edition If the season ended today, how would the Division I women\u0027s bracket shape up? Lacrosse Magazine spoke in depth with committee chair Brendan Fahey., 92549\u003dApril 25, 2015 Hopkins Rallies Past Towson to Earn Key Win Down three goals, Johns Hopkins came back for an 11-10 win over Towson in overtime. Sophomore Haley Schweizer scored the winner., 198554\u003dMarch 11, 2015 No. 16 JMU Rallies to Upset No. 12 Penn State James Madison won its sixth in a row since losing its opener to North Carolina, rallying to beat Penn State 13-12., 175731\u003dMarch 21, 2015 Quinn Breaks Sister\u0027s Mark in Canisius Win, 152620\u003dApril 1, 2015 No. 19 Cornell Stuns No. 15 Stanford in Upset Behind Emily Tripodi\u0027s career-high seven points on three goals and four assists, the Big Red earned its first win over a ranked opponent this season, topping Stanford 15-7., 133453\u003dApril 10, 2015 Red-Hot Hofstra Tops Delaware, First Place in CAA Senior attacker Brittain Altomare did it again, scoring two goals and adding two assists to lead Hofstra to its third straight win., 186862\u003dMarch 15, 2015 Tracy Lifts No. 3 North Carolina to Double OT Win At Towson At the 1:12 mark in the second overtime against Towson, Sammy Jo Tracy scored the game winner to hand the Tar Heels their fifth victory in a row., 144029\u003dApril 4, 2015 Eleven Score as UMass Dominates Bonnies, 94214\u003dApril 25, 2015 Old Dominion Ties Record with 13th Victory, 158641\u003dMarch 28, 2015 Penn State Downs Rutgers in Big Ten Opener Tatum Coffey had five points as Penn State down Rutgers 15-8 in its inaugural Big Ten conference game., 122791\u003dApril 12, 2015 Stony Brook Upends Northwestern for Landmark Win After opening with a 5-0 run, the No. 5 Seawolves cruised to a 11-9 victory over traditional powerhouse No. 6 Northwestern., 207561\u003dMarch 7, 2015 Ohlmiller Leads Stony Brook Past Villanova, 21402\u003dJune 25, 2015 Inside the July/August Issue of Lacrosse Magazine A look back at May Madness anchors our combined summer issue, with Denver\u0027s Wes Berg on the cover after the Pioneers took the men\u0027s title westward for the first time in history., 35755\u003dMay 25, 2015 Second Half Burst Leads Terps to Repeat Championship In a rematch of the 2013 title game, Maryland secured a repeat championship with a 9-8 win over North Carolina during a season in which they largely dominated start to finish., 23308\u003dJune 18, 2015 Women’s Lacrosse is “Rising Up” as Hopkins Joins Big Ten The Hopkins women\u0027s lacrosse team will begin playing in the Big Ten in 2017, the school\u0027s first season where both the men\u0027s and women\u0027s programs are united in one conference., 64549\u003dMay 8, 2015 Key Spurt Leads UMass Past Jacksonville A three-goal spurt late in the first first paved the way for Massachusetts to beat Jacksonville 13-8 in the opening round of the NCAA women\u0027s lacrosse championship. UMass will play No. 1 Maryland on Sunday., 195591\u003dMarch 13, 2015 Carolina Finds Unwanted Adventure in Win over Albany It wasn\u0027t pretty, but No. 3 North Carolina dominated possession, built a 10-3 lead and held on for a 10-6 victory Friday over No. 20 Albany at St. Paul\u0027s in Baltimore., 192723\u003dMarch 14, 2015 Penn Still Perfect After Downing Georgetown, 53906\u003dMay 12, 2015 Epoch/LM POTW: Kara Burke and Blaze Riorden One tied an NCAA scoring record, the other made 19 saves and lit the internet on fire with a coast-to-coast highlight reel goal. Both led their teams over seeded opponents into the NCAA quarterfinals. Albany\u0027s Blaze Riorden and Loyola\u0027s Kara Burke are Epoch/LM Players of the Week., 126759\u003dApril 11, 2015 Loyola Clinches First Round Bye in Patriot League, 142502\u003dApril 4, 2015 Carolina Pulls Away to Rout Louisville 18-5 After taking a 4-3 lead in the first half, Louisville was held to just one goal in the final 40 minutes of the game as North Carolina pulled away in a win that featured two key injuries., 170668\u003dMarch 24, 2015 Stony Brook Blows Past Rutgers, 204278\u003dMarch 8, 2015 Stanford Tops Vanderbilt, Remains Undefeated, 221950\u003dMarch 1, 2015 Penn\u0027s Bensen Burns Vanderbilt With OT Winner For the third time in the three all-time meetings between the two schools, Penn pulled out a one-goal win against Vanderbilt., 65584\u003dMay 8, 2015 Second Half Domination Leads Irish Over OSU Notre Dame scored six goals in the first 7:06 of the second half on its way to a 13-11 come-from-behind victory over Ohio State in the opening round of the NCAA women\u0027s lacrosse championship., 166817\u003dMarch 25, 2015 Fortunato, Sexton Score Five as Irish Win, 50069\u003dMay 16, 2015 Syracuse Dominates Draw, Earns 4th Straight Semis Bid A 13-5 performance at the circle and five points from Halle Majorana lifted Syracuse past Loyola and back to the NCAA semifinals for the fifth time in six seasons., 209737\u003dMarch 7, 2015 UConn Hammers Rutgers for Third Straight Win, 117047\u003dApril 15, 2015 Balanced Scoring Helps No. 8 Florida Rip Cincy, 27696\u003dJune 10, 2015 An Ode to U.S. Legend Lindsey Munday as She Retires As a two-time gold medalist with Team USA, current USC coach Lindsey Munday decided it\u0027s time to retire to focus on the team that earned its first NCAA tournament victory in only its third season as a Division I program., 37408\u003dMay 24, 2015 All-Time Championship Rematch: Can Maryland Top UNC? When Maryland fell to UNC in triple overtime in the 2013 NCAA final, Reese said it would go down in history as one of the most exciting championship games. Can the Terps defend their 2014 crown and prevent the Tar Heels from winning their second national title?, 114365\u003dApril 16, 2015 Ohio State Dominates Rutgers on Senior Night, 55037\u003dMay 10, 2015 Burke\u0027s Record Effort Leads Loyola Over BC Kara Burke poured in eight goals to lead Loyola to a 19-12 upset over fifth-seeded Boston College in the NCAA women\u0027s lacrosse championship. The Greyhounds won their 16th straight game and will meet Syracuse in the quarterfinals., 187982\u003dMarch 15, 2015 #LMLive Gameday: Saturday Recap and Active Sunday North Carolina\u0027s trip to Towson headlines Sunday action, with a look back at Saturday\u0027s busy slate, including Lyle Thompson and Mikaela Rix setting records., 63552\u003dMay 8, 2015 Historic Win as USC Upsets James Madison In just its third season with a varsity program, USC won its first-ever NCAA tournament game with a 13-10 win over James Madison. The Trojans advance to play Duke in the second round on Sunday., 179367\u003dMarch 19, 2015 WD1 Notebook: Behind Louisville’s Jump in the Rankings It\u0027s very rare for a team to lose two consecutive games and move up in the rankings. But new to the ACC and playing tight games against Boston College and Duke, Louisville earned the No. 7 spot in this week\u0027s Top 20., 178321\u003dMarch 19, 2015 Albany Gets Defensive to Hand UMass First Loss No. 20 Albany, the nation\u0027s top scoring offense, was held more than 10 goals below its season average, but came away with a 7-4 win over No. 19 UMass., 95115\u003dApril 25, 2015 #LMLive: Regular-Season Judgement Day? WIth the Patriot and ACC tournaments on break before Sunday finales, the Saturday slate will decide a number of berths in next week\u0027s tournaments, including the wide-open Ivy and CAA., 191846\u003dMarch 14, 2015 Johnson Sets Vermont Coaching Mark in Win, 58846\u003dMay 10, 2015 Treanor\u0027s Six Points Leads Syracuse Past Penn Kayla Treanor had four goals and two assists to lead Syracuse to a 13-10 win over Penn in the NCAA second round. Syracuse, which will play Loyola next, advanced to the quarterfinals for the fourth straight year., 66591\u003dMay 8, 2015 #LMLive: NCAA Women\u0027s Opening Round Action The NCAA women\u0027s tournament kicks off in earnest on Friday, with the top six seeds awaiting their Sunday matchups., 215145\u003dMarch 4, 2015 Collins Scores Five as Boston U Beats Dartmouth, 194582\u003dMarch 14, 2015 Weekend Preview Podcast: Things Are Heating Up As the calendar flips through March, rivalries, like Johns Hopkins-Syracuse, are renewed while the stakes grow around new matchups between old teams, like the Duke and Louisville women. LM previews this weekend\u0027s top games and more., 146902\u003dApril 4, 2015 Smith Leads Duke Over BC, Rix Injured Brigid Smith matcher her career-high as Duke pulled away for a 13-8 win over Boston College in a top five showdown. BC\u0027s Mikaela Rix was injured in the contest., 183132\u003dMarch 17, 2015 Syracuse Jumps All Over Cornell Early, 171694\u003dMarch 22, 2015 In Case You Missed It: Can Maryland be Beaten? In a week when three of the top five and five of the top ten teams lost, Maryland kept rolling along. Can anyone beat the Terps?, 111114\u003dApril 17, 2015 Hofstra Comes From Behind to Beat Elon, 185072\u003dMarch 15, 2015 Bowles Docks 100th Career Goal in Albany\u0027s Win Over Iona, 208600\u003dMarch 7, 2015 Princeton Grinds Out 8-5 Win Over Dartmouth, 181198\u003dMarch 18, 2015 Seawolves Walk the Walk in Spallina’s Whirlwind of a Week On Sunday, Stony Brook topped Jacksonville. On Monday morning, Spallina\u0027s fifth child was born. It was St. Patrick\u0027s Day on Tuesday and the Seawolves upset Florida. Read all about his emotional, but lucky three days., 139196\u003dApril 7, 2015 Notre Dame Stays Hot, Downs Syracuse in OT For the second time in four days, the Irish beat a Top 10 team on the road, this time beating Syraucse at the Carrier Dome., 203206\u003dMarch 8, 2015 Clancy\u0027s Saves Leads New Hampshire Past Drexel, 160129\u003dMarch 28, 2015 Vander Kolk\u0027s 18 Saves Lead Virginia Over BC Freshman Rachel Vander Kolk made 18 saves as Virginia beat Boston College 15-13. The red-hot Cavaliers have won five straight games. BC was the third undefeated team to fall to Virginia during the streak., 193770\u003dMarch 14, 2015 Temple Off to Best Start in 18 Years After UD Win, 144766\u003dApril 4, 2015 Fortunato, Notre Dame Dominate No. 7 Virginia in Upset Behind sophomore Cortney Fortunato\u0027s eight points, Notre Dame crushed No. 7 Virginia 14-4 at Klöckner Stadium., 162086\u003dMarch 27, 2015 Colorado Caps Road Trip with Win at UMass Lowell, 18052\u003dJuly 6, 2015 Vanderbilt Names Tewaaraton Finalist Gilroy as Assistant On Monday, Vanderbilt coach Cathy Swezey announced the hiring of former Florida midfielder and three-time All-American Shannon Gilroy as an assistant coach, replacing Julie Gardner who became an assistant at JMU., 128761\u003dApril 11, 2015 Williamson Wills Penn Past Harvard Iris Williamson had a career-high six goals and grabbed a key draw control at the end of the game to help Penn edge Harvard 8-6 on Saturday., 57788\u003dMay 10, 2015 Penn State Beats Virginia to Move to Quarterfinals Penn State earned a trip to the NCAA quarterfinals with a 13-11 win over No. 7 seed Virginia on Sunday. Emi Smith made 14 saves for the Nittany Lions., 212959\u003dMarch 6, 2015 Hokies Push Duke, But Blue Devils Pull Away Virginia Tech led No. 2 Duke early in the second half, but the Blue Devils pulled away for a 15-10 victory., 156881\u003dMarch 28, 2015 Hens Beat Princeton for First Time Since \u002789 Delaware, which lost to Canisius earlier in the week, knocked off No. 14 Princeton 12-10, snapping a 17-game series losing streak to the Tigers., 24378\u003dJune 17, 2015 Hopkins Women\u0027s Lacrosse Becomes Big Ten Affiliate Member The Blue Jay women\u0027s lacrosse team has been accepted by the Big Ten Conference as a sport affiliate member and will begin play in the league during the 2017 season., 190748\u003dMarch 14, 2015 Reese Picks Up 200th as Terps Drown Gators After a shaky start, No. 1 Maryland was able to turn things around for 16-6 rout of No. 7 Florida, which was coach Cathy Reese\u0027s 200th career win., 154460\u003dMarch 29, 2015 ICYMI: Surviving the ACC Gauntlet ACC teams boast eight of the top 15 toughest schedules in the country. Does playing that schedule beat you down or build you up?, 84091\u003dMay 1, 2015 Weekend Preview Podcast: Setting Stage for Selection Sunday With Selection Sunday upon us, the LM staff breaks down conference tournament scenarios heading into the weekend and how they could impact the NCAA bubble., 87453\u003dApril 29, 2015 WD1 Wednesday: Cummings\u0027 Tewaaraton Challengers? As the season stands today, with the dominance of Maryland, there doesn\u0027t seem to be any argument against junior Taylor Cummings earning the Tewaaraton Award for the second year in a row., 14741\u003dJuly 21, 2015 Wescott Steps Down as Monmouth Head Coach, 39660\u003dMay 22, 2015 North Carolina Crushes Rival Duke to Earn Finals Bid Ten Tar Heels scored and North Carolina held Duke scoreless for an 18 minute second half span as UNC booked a trip to the NCAA finals Friday at PPL Park., 222953\u003dMarch 1, 2015 Amherst Takes Over Top Spot in IWLCA DIII Poll, 176324\u003dMarch 21, 2015 Stony Brook Scores Final Eight to Beat UNH, 81940\u003dMay 1, 2015 Stanford Routs Colorado to Reach MPSF Final, 78794\u003dMay 1, 2015 Ferguson Lifts Penn over Cornell in Ivy League Semi With nine saves, Penn goalie Lucy Ferguson helps Penn to a 7-6 win over Cornell to advance to the Ivy championship Sunday., 99789\u003dApril 23, 2015 Stanford Clinches MPSF Crown With Win Over UC Davis, 116041\u003dApril 16, 2015 Gallery: Maryland Topples Johns Hopkins (WD1) Top-ranked Maryland cruised to a 17-9 win over No. 15 Johns Hopkins behind five goals from Brooke Griffin on Wednesday night at Homewood Field. Photos by John Strohsacker., 32171\u003dMay 29, 2015 Gallery: Tewaaraton Awards Ceremony in Washington, D.C. Taylor Cummings and Lyle Thompson earned their second straight Tewaaraton Awards to headline the annual gala event in Washington D.C. Photos by John Strohsacker., 108451\u003dApril 18, 2015 Loyola Beats Navy to Win PL Regular Season Loyola dominated Navy 14-4, snapping the Mids\u0027 10-game home field winning streak, to wrap up the top seed for the Patriot League tournament., 150164\u003dApril 3, 2015 Late Free Position Goal Lifts LIU Brooklyn to WIn, 216302\u003dMarch 4, 2015 Palmucci, Jordan Lead UConn Over Quinnipiac, 164763\u003dMarch 26, 2015 LaBeau Scores Six as Lehigh Doubles Up Mount, 83017\u003dMay 1, 2015 Towson Rallies to Upset Top Seed Hofstra in Overtime The No. 4 seed Towson scored two goals while two-men down to rally for a 7-3 overtime win over previously undefeated Hofstra in the CAA semifinals., 44308\u003dMay 21, 2015 Championship Weekend Preview: LM Podcast, TV Info, More It all comes down to this. One weekend to decide five NCAA national champions. We\u0027ve previewed the games all week and LM\u0027s Matt DaSilva, Corey McLaughlin, Megan Schneider and Sean Burns do it once more in our weekend podcast., 211815\u003dMarch 6, 2015 Dupere Helps Elon Pull Away From Coastal, 71979\u003dMay 3, 2015 Topping OSU, Penn State Captures Inaugural Big Ten Title With a 13-11 win over Ohio State, the Nittany Lions were crowned Big Ten champions, earning the AQ bid to the NCAA tournament., 103651\u003dApril 22, 2015 All-Patriot League Women\u0027s Teams and Award Winners, 98188\u003dApril 24, 2015 Weekend Preview Podcast: Let the Conference Tourneys Begin The conference champions of the ACC and Patriot League will be the first to punch their NCAA tournament tickets. That, and much, more including Johns Hopkins and Maryland\u0027s battle for a rivalry win — and a giant wooden crab., 125931\u003dApril 11, 2015 Carolina Downs Cuse Before Record Crowd Second-ranked North Carolina used a five-goal second half run to key a 15-8 victory over No. 7 Syracuse before a crowd of 2,098 a record for a women\u0027s game at Fetzer Field, 132831\u003dApril 10, 2015 Mount St. Mary\u0027s Tops St. Francis for First NEC Win, 112257\u003dApril 17, 2015 USC Blows Out UC Davis with 14-Goal Run, 184300\u003dMarch 16, 2015 Epoch/LM POTW: Lyle Thompson and Mikaela Rix Putting together huge performances in key games for their teams, Boston College\u0027s Mikaela Rix and Albany\u0027s Lyle Thompson are the Epoch/LM Players of the Week., 59879\u003dMay 10, 2015 Gallery: Loyola Stays Hot, Upsets Boston College (WD1) Loyola won its 15th straight game and earned a trip to the NCAA quarterfinals with a dominating performance against No. 5 seed Boston College. Photos by John Risley., 31168\u003dJune 1, 2015 Early Top 20 for 2016 (WD1): Terps Still Reign Despite graduating seven starters, Maryland remains at the top of our way early rankings, until proven otherwise., 206524\u003dMarch 7, 2015 Cornell Blows Past Yale in Ivy Opener, 62474\u003dMay 8, 2015 Explosive First Half Earns Loyola 21-3 Win Over Bryant With the win, Loyola extended its win streak to 15-straight games, tying a program best, while it\u0027s also the fifth-consecutive year the Greyhounds have won their first game in the NCAA tournament., 151290\u003dApril 3, 2015 USC Holds Off Oregon to Stay Unbeaten in MPSF, 201151\u003dMarch 11, 2015 WD1 Wednesday: Work In Progress for Albany and UMass Top 20 newcomers Albany and Massachusetts have started strong this spring, but work lies ahead if they want to make headway into the top echelon of women\u0027s lacrosse., 88457\u003dApril 28, 2015 Epoch/LM POTW: Ryan Brown and Kayla Treanor Syracuse barreled to an ACC title through some of the best teams in the country, while Hopkins topped arch-rival Maryland for a huge win, with Epoch/LM Players of the Week Kayla Treanor and Ryan Brown leading the charge., 174417\u003dMarch 21, 2015 Fortunato Keys Notre Dame Win Over Ohio State Cortney Fortunato had three goals and one assist during a six-goal run to open the second half as Notre Dame pulled away for a 13-5 win over No. 16 Ohio State., 210841\u003dMarch 7, 2015 #LMLive Gameday: Twin Bill in College Park A pair of big games at College Park, and a headliner out in Denver anchor a busy Saturday of lacrosse across the country., 102645\u003dApril 23, 2015 Penn State Defense Steps Up B1G Time For B1G Win With a huge win over Northwestern thanks to a solid defense, the No. 7 Nittany Lions turn to face No. 1 Maryland in a battle for the top seed in the Big Ten., 34751\u003dMay 26, 2015 Highlight Reel: NCAA Championship Videos Five NCAA titles were captured over the Memorial Day weekend, with Denver and Maryland headlining as DI champions. NCAA.com has highlights from all the action., 101655\u003dApril 23, 2015 D1 Women’s Lacrosse Could Be Coming to Colorado State To remain Title IX compliant, Colorado State may be looking to add Division I women\u0027s lacrosse within the next five years., 43277\u003dMay 21, 2015 2015 Women’s Final Four: Practice Notes and Quotes How did day one of championship weekend go? Maryland went for a light and fun practice, while Syracuse, North Carolina and Duke looked focused on making something new happen this year., 33783\u003dMay 27, 2015 Nike/LM Division I Women\u0027s Top 20 Maryland captured its second straight NCAA title with a comeback over North Carolina, landing the Terrapins and Tar Heels the clear 1-2 spots in the final Top 20 for 2015., 76333\u003dMay 2, 2015 #LMLive: Automatic Qualifying Extravaganza It\u0027s a day full of tickets being punched, as several conferences decide their champions - and NCAA Automatic Qualifiers - for the 2015 spring season., 113158\u003dApril 17, 2015 Winthrop Win Sets Up Big South Showdown, 161107\u003dMarch 28, 2015 #LMLive Gameday: \u0027Cuse, BC Fall from Unbeaten Ranks Notre Dame edged No. 1 Syracuse in men\u0027s action and Virginia handled Boston College, as the Orange and Eagles fell for the first time on a busy Saturday of lacrosse., 98760\u003dApril 24, 2015 Gallery: Terps Take Down PSU For Big Ten Crown Maryland withstood a strong second half from Penn State to take a 13-10 win and Big Ten regular-season title Thursday night. Photos by John Strohsacker., 167701\u003dMarch 25, 2015 Princeton Offense Unloads in Win Over Cal, 73002\u003dMay 3, 2015 #LMLive: Women\u0027s Conference Final Smorgasbord The Ivy League men\u0027s title is on the docket, but the majority of action on this Selection Sunday is on the women\u0027s side, where ten champions will earn their NCAA bids., 17013\u003dJuly 7, 2015 Richmond Adds Former Wildcat Bridget Bianco As Assistant The three-year starting goalie for Northwestern joined the Spiders coaching staff this summer., 74411\u003dMay 2, 2015 Generi Hits 300 Points as Navy Beats Hokies Navy senior Loren Generi scored the 300th point of her career in Navy\u0027s 19-11 win over Virginia Tech. Generi became the first Division I player in history to finish a career with 300 points, 200 goals and 400 draw controls., 52211\u003dMay 14, 2015 Saving the Best for Last: Burke Leads Loyola to Quarterfinals Loyola senior attacker Kara Burke tallied 18 points in the first weekend of the NCAA tournament to lead her team to another rematch with Syracuse on Saturday., 129685\u003dApril 11, 2015 Gallery: North Carolina Dominates Syracuse (WD1) Despite battling the injury bug, North Carolina took home a dominating win over Syracuse in ACC action on Saturday. Photos by Peyton Williams., 143746\u003dApril 4, 2015 DeGarmo, Princeton D Shuts Down Yale, 97152\u003dApril 24, 2015 North Carolina Cruises Past Notre Dame in 18-4 Blowout The top-seeded Tar Heels earned a spot in Sunday\u0027s ACC title game, defeating fifth-seeded Notre Dame on Friday by the largest margin in tournament history., 157858\u003dMarch 28, 2015 Florida Routs Temple in Big East Showdown Mandy O\u0027Leary returned to her alma mater and her Florida squad beat Temple 17-3 to move to 2-0 in the Big East, handing Temple just its second loss of the season., 163293\u003dMarch 27, 2015 George Washington Rallies for Win at Davidson, 119849\u003dApril 12, 2015 Elon Edges William and Mary, 8-7, 155527\u003dMarch 29, 2015 #LMLive Gameday: Daylong TV Slate North Carolina outlasted Duke 15-14 in a back-and-forth rivalry game on a busy Sunday of college lacrosse. Follow it all at #LMLive., 79844\u003dMay 1, 2015 JMU Beats Delaware to Reach CAA Championship Jaci Gordon had three goals and an assist as James Madison beat Delaware 10-7 in the CAA semifinals. JMU will meet Towson in a rematch of last year\u0027s final on Sunday., 149024\u003dApril 3, 2015 Colorado Cruises Past UC Davis in MPSF Victory, 19156\u003dJuly 1, 2015 Erica LaGrow Named Yale’s Women\u0027s Lacrosse Head Coach Former US National Team member Erica LaGrow, who spent the past seven years as an assistant coach at Florida, has been named Yale’s Joel E. Smilow, Class of 1954 head coach of women’s lacrosse., 85164\u003dApril 30, 2015 UConn Edges Hoyas to Reach Big East Final, 89498\u003dApril 26, 2015 ICYMI: Tournament Time Equals Resume Time Conference tournament season kicked off last weekend and for many teams, this week\u0027s tournaments are one final chance to show they deserve a chance to compete for a national title., 61443\u003dMay 8, 2015 Coffey, Mosketti Score Four Each as Penn State Downs Hopkins A pair of four-goal games by Jenna Mosketti and Tatum Coffey led Penn State past Hopkins. The Nittany Lions will face the winner of Virginia-Winthrop on Sunday., 130785\u003dApril 10, 2015 Freshman Farrar Breaks Out in Davidson Victory, 96099\u003dApril 24, 2015 Generi Sets Navy Goal Record in Semifinal Win Loren Generi had three goals in Navy\u0027s 16-7 win over Colgate in the Patriot League semifinals. Generi\u0027s 210 career goals are a new record at Navy., 38560\u003dMay 23, 2015 Cummings Leads Maryland Back to the NCAA Championship With six points and five draw controls, Tewaaraton finalist Taylor Cummings helps lead her team back to the NCAA championship for a rematch of the 2013 title game against North Carolina., 202156\u003dMarch 10, 2015 No. 14 Stony Brook Hands Notre Dame Fourth Loss, 30039\u003dJune 3, 2015 Maryland Leads LM\u0027s Division I Women’s All-Americans After winning its second consecutive national title, Maryland\u0027s talent all over the field was hard to ignore. Five Terps landed on LM\u0027s All-American roster, alongside two from national runner-up UNC, among several deserving others., 118870\u003dApril 14, 2015 Epoch/LM POTW: Michaela Michael and Dan Taylor In big conference wins for Southern Cal and Lehigh, Michaela Michael and Dan Taylor led the way for their teams, earning Epoch/LM Player of the Week honors., 104541\u003dApril 22, 2015 WD1 Wednesday: Bracketology, Second Edition Some teams are solidifying their spots as conference leaders, while others hope to break the mold in order to earn a spot in the dance., 71058\u003dMay 3, 2015 Terps, Tar Heels Take Top Two Seeds in WD1 Tournament Both the 2014 (Maryland) and 2013 (North Carolina) champions are No. 1 and No. 2, respectively, in the 2015 NCAA tournament., 75456\u003dMay 2, 2015 Stanwick\u0027s Five Lead Boston College Over BU, 219631\u003dMarch 2, 2015 Phelan Scores Another OT Winner for St. Joe\u0027s, 70107\u003dMay 4, 2015 Gallery: James Madison Takes CAA Crown Over Towson (WD1) James Madison took a 13-6 victory in the CAA final over defending champion Towson to earn an NCAA berth. Photos by Kevin P. Tucker., 205480\u003dMarch 7, 2015 Adams Leads Boston Univ Past American, 22318\u003dJune 24, 2015 Blaze Riorden, Cummings Up for ESPY Awards At the ESPY’s this year, it’s Big-Game Blaze vs. ODB and Taylor Cummings against the field. The Albany goalie\u0027s end-to-end rumble and lacrosse\u0027s two-time Tewaaraton Award winner are nominated for awards., 93917\u003dApril 25, 2015 Monmouth Scores Final Five to Advance in MAAC, 217471\u003dMarch 4, 2015 WD1 Wednesday: Stanford’s Recruiting Scope In Focus The Cardinal soars into the top 10 this week at No. 9 with wins over Notre Dame and Ohio State, but can they keep their momentum going?, 191543\u003dMarch 14, 2015 JMU Holds Off Rutgers for 7th Straight Victory, 76784\u003dMay 2, 2015 Gallery: JMU Downs Delaware in CAA Semis (WD1) James Madison took a 10-7 win over Delaware to earn a date against Towson in Sunday\u0027s CAA finals. Photos by Kevin P. Tucker., 220230\u003dMarch 2, 2015 Gallery: James Madison Outlasts Loyola in OT (WD1) JMU won its fourth straight game by edging Loyola 11-10 in overtime on a chilly evening in Baltimore. Photos by John Strohsacker., 177411\u003dMarch 21, 2015 #LMLive Gameday: Great Slate that Runs Late A solid afternoon gives way to a headline-filled evening, with UVa-Hopkins. BC-UNC (women) and UNC-Maryland all taking place on a full Saturday night for lacrosse., 170935\u003dMarch 23, 2015 Epoch/LM POTW: Casey Bocklet and Phil Hession Powering team wins with all-around excellence, Virginia\u0027s Casey Bocklet and Dartmouth\u0027s Phil Hession are the Epoch/LM Players of the Week., 67978\u003dMay 6, 2015 WD1 Wednesday: Inside the Penn State-Northwestern Debate After Penn State beat Northwestern twice and won the inaugural Big Ten tournament, many thought the Nittany Lions would earn a top eight seed, or at least be ranked above the Wildcats. Why didn\u0027t they?, 48575\u003dMay 17, 2015 Gallery: Syracuse Outdraws Loyola for Semis Bid (WD1) Dominating performances in the circle and a big day from Halle Majorana helped Syracuse cool red-hot Loyola and advance to its 4th straight NCAA semifinal. Photos by Greg Wall., 202908\u003dMarch 9, 2015 Maryland Sweeps to No. 1 in IWLCA DI Weekly Poll, 166528\u003dMarch 25, 2015 Five Multiple Goal Scores Lead UNC Over Va Tech, 213431\u003dMarch 6, 2015 Iannetta Sets Hofstra Draw Record in Victory, 45413\u003dMay 19, 2015 Women\u0027s Final Four: Three Things You Need to Know From Each Coach The NCAA hosted a teleconference with all Division I coaches whose teams advanced to the final four. What were the key takeaways?, 60429\u003dMay 10, 2015 Gallery: Northwestern Into NCAA QF With Win Over ND (WD1) Northwestern booked another trip to the NCAA quarterfinals with a win over Notre Dame at home on Sunday. Photos by Andrew Nelles., 168738\u003dMarch 25, 2015 WD1 Wednesday: BC on the Brink, Mid-Season Awards The Eagles fly to No. 2 in the country as one of three remaining undefeated teams, while Megan Schneider looks at the top performances thus far this season., 155235\u003dMarch 29, 2015 No. 5 Northwestern Downs No. 9 Louisville 12-10, 96871\u003dApril 24, 2015 Loyola Headed to Patriot League Final, 204000\u003dMarch 8, 2015 Ohio State Tops Duquesne on the Road, 180905\u003dMarch 18, 2015 No. 13 Princeton Fends Off No. 11 Penn State, 193016\u003dMarch 14, 2015 Porretto Has Career-High 10 Points in OSU Win, 131899\u003dApril 10, 2015 Kasmarik, Ellis Set Records in Winthrop Rout of Campbell, 207851\u003dMarch 7, 2015 Penn Beats Brown for 12th Straight Time, 197983\u003dMarch 11, 2015 Balanced Effort Leads Denver Past Boston U, 80636\u003dMay 1, 2015 Massachusetts Posts Decisive Win Over George Mason in A-10 Semis Topping George Mason 12-3, UMass will face Richmond in the Atlantic 10 championship on Sunday., 109272\u003dApril 18, 2015 Stanwick, Kent Help BC Pull Away from UNH, 51719\u003dMay 15, 2015 Gait, Thorpe Play In the Shadow of Orange Legends Gary Gait and Regy Thorpe brought their firstborns back to Syracuse, hoping to add another NCAA championship to its storied tradition - this time on the women\u0027s side., 110312\u003dApril 17, 2015 Carolina Clinches ACC\u0027s Top Seed with Win at Duke North Carolina might be without Molly Hendrick and Brittney Coppa, but a healthy Aly Messinger and Sammy Jo Tracy go a long way, as Duke learned Friday., 15606\u003dJuly 15, 2015 Meet Julie Castner, Lacrosse\u0027s Newest Social Sensation If you\u0027re from Orlando, you surf. But increasingly, you also play lacrosse. University of Detroit midfielder Julie Castner blew up on social media by combining the two., 108147\u003dApril 18, 2015 Horka Sparks Boston U Comeback Over Bucknell, 127883\u003dApril 11, 2015 Stony Brook Bounces Back, Beats Vermont, 46456\u003dMay 18, 2015 Familiar Names Dot IWLCA DI All-America Selections Returning Tewaaraton winner Taylor Cummings headlined the IWLCA\u0027s DI All-America selections, one of three Terrapins to make the first team., 135792\u003dApril 9, 2015 Irish Spirit, O\u0027Sullivan\u0027s Saves Propel Notre Dame to Hot Streak After opening the season 3-4, Notre Dame has gone on a 5-1 run in the past six games with significant wins over ACC rivals Syracuse and Virginia., 137963\u003dApril 8, 2015 Streaking Canisius Holds Off Siena 15-12, 123556\u003dApril 12, 2015 Virginia Dominates Louisville in First-Ever Contest In the first-ever meeting between the two teams, No. 9 Virginia topped No. 13 Louisville 17-9 behind a seven-point performance from Casey Bocklet., 20287\u003dJune 30, 2015 Florida State Discusses Women\u0027s Lacrosse Potential During a board of trustees meeting, Florida State athletic director Stan Wilcox said the school will need to add another women’s sport to remain compliant with Title IX, specifically looking at lacrosse and triathlon., 209441\u003dMarch 7, 2015 St. Joe\u0027s Wins Third Straight, Beats Longwood, 124651\u003dApril 12, 2015 #LMLive Gameday: Record-Setting Saturday Lyle Thompson tied Rob Pannell, Kevin Massa set the face-off mark, and the playoff picture became clearer (or muddier) for many. What\u0027s in store as the weekend continues?, 28855\u003dJune 4, 2015 Three Recent Examples Spur Women\u0027s Rules Debate In the 2015 NCAA tournaments, three game scenarios brought the women\u0027s rules debate to light - checking the goal scorer\u0027s stick, stringing of sticks and stalling, which ultimately leads to discussion of the shot clock. But it’s up to the NCAA rules committee to effect changes., 196984\u003dMarch 12, 2015 Gallery: Duke Dominates at Georgetown (WD1) Duke\u0027s defense was dominating in a 12-4 victory on the road over Georgetown, with the Blue Devils staying perfect on the season. Photos by John Strohsacker., 77777\u003dMay 1, 2015 Division I Women’s Conference Tournament Central Looking for tournament schedules and results? Lacrosse Magazine has it all in one place as the battle for conference titles begins., 186268\u003dMarch 15, 2015 Murphy Leads Stony Brook in Rout of Jacksonville, 141708\u003dApril 5, 2015 ICYMI: Second Season Intrigue Begins The start of conference play gives teams another chance to launch theri success. Stanford has lost twice in the last two weeks out of the league, but is 3-0 in the MPSF., 117792\u003dApril 15, 2015 Report: Colorado State to Add Women\u0027s Lacrosse Colorado State plans to add women\u0027s lacrosse to its lineup of NCAA Division I sports within the next five years, the Coloradoan reported Wednesday., 208888\u003dMarch 7, 2015 Raymond Leads Towson Past Georgetown, 212680\u003dMarch 6, 2015 Healy\u0027s 12 Saves Help JMU Beat Richmond, 56164\u003dMay 10, 2015 Terps Recover from OSU Loss with NCAA Win over UMass After suffering its first loss of the season last week, the Terps experienced a brief scare in the opening minutes against Massachusetts but then cruised to a 19-8 win., 111397\u003dApril 17, 2015 James Madison Puts Clamps on Towson, 164453\u003dMarch 27, 2015 Winthrop Blows Out Cincy in Non-Conference Finale, 173130\u003dMarch 22, 2015 Gallery: Northwestern Takes Down Syracuse in Chicago (WD1) No. 6 Northwestern earned a key non-conference victory, edging No 5 Syracuse on Sunday afternoon. Photos by Andrew Nelles., 169754\u003dMarch 24, 2015 US Lacrosse Supports Sector SPDR Lacrosse Weekly A new television show, Sector SPDR Lacrosse Weekly, began airing on six regional networks around the country earlier this month., 26081\u003dJune 14, 2015 2015-16 U.S. Women\u0027s National Team Selected At the conclusion of a three-day tryout at Johns Hopkins University in Baltimore, Md., US Lacrosse today announced the 36-player roster for the 2015-16 U.S. Women’s National Team., 154177\u003dMarch 30, 2015 Boston College Ends USC Winning Streak, 91027\u003dApril 26, 2015 #LMLive: ACC, Patriot League Bid Day It\u0027s a first day of finals on the conference tournament front, as the ACC and Patriot League issue their crowns (and AQ bids to the dance). Follow live!, 100600\u003dApril 23, 2015 Cummings Leads Maryland to Big Ten Title Taylor Cummings had four goals, 10 draw controls and four caused turnovers as Maryland beat Penn State 13-10 to win the Big Ten regular season title., 114660\u003dApril 16, 2015 Prove People Wrong: Is Stony Brook Final Four Bound? All season long, the Seawolves have been guided by the mantra PPW (Prove People Wrong). After topping Northwestern, they believe they can advance further than years past in the NCAA tournament., 41159\u003dMay 22, 2015 Gallery: Maryland Holds Off Syracuse in NCAA Semis (WD1) Maryland got six points from Taylor Cummings and killed clock late to hold on for a 10-8 victory over Syracuse in the NCAA semifinals. Photos by Greg Wall., 134990\u003dApril 9, 2015 Duke Dominates First Half, Beats Ohio State, 225172\u003dFebruary 28, 2015 Albany Women Rally Late to Beat Cornell, 85464\u003dApril 30, 2015 Florida Downs Nova to Advance to Big East Final, 94812\u003dApril 25, 2015 UConn Downs Nova; Earns Big East Tourney Berth, 205766\u003dMarch 7, 2015 Boston College Dominates Notre Dame 15-6 Covie Stanwick poured in seven goals as No. 4 Boston College dominated Notre Dame on Saturday., 200049\u003dMarch 11, 2015 Terps Throttle Towson Behind Whittle, Cummings, 107262\u003dApril 18, 2015 Canisius Wins 10th Straight, Captures MAAC, 105829\u003dApril 19, 2015 ICYMI: Weekend Upsets Mix Things Up Penn State knocked off Northwestern 14-10 on Sunday, one of several upsets over the weekend that has muddied up the national picture heading into the stretch drive, 112542\u003dApril 17, 2015 Virginia Ends Regular Season with Win over Va. Tech, 27099\u003dJune 11, 2015 U.S. Women\u0027s Tryouts Preview: You Won’t Get Noticed for Speed Friday marks the first day of tryouts for the U.S. women\u0027s national team and coach Ricky Fried shares some insight into what he\u0027s looking for from the 108-player pool. Plus, a breakdown of players by position, college and graduation year., 149322\u003dApril 3, 2015 Hofstra Upsets No. 9 JMU with Seven-Goal Spurt Brittain Altomare scored four goals and Hofstra scored seven unanswered goals in the second half to defeat James Madison 13-8 — its first win over a nationally ranked opponent since 2011., 24903\u003dJune 16, 2015 Rowan, Former \u0027Cuse Assistant, Named Wagner\u0027s Head Coach Former Syracuse assistant Katie Rowan, the most decorated player in the program\u0027s history and a member of the 2009 and 2013 USA World Cup gold medalist teams, has been named Wagner\u0027s head women\u0027s lacrosse coach., 148233\u003dApril 4, 2015 #LMLive Gameday: Conference Action Dominates Some major conference tilts are on tap for this full Saturday of action - starting early with Duke and Boston College women trying to get back on track after their first losses., 159836\u003dMarch 28, 2015 Trojans Down Dartmouth for Seventh Straight, 86059\u003dApril 30, 2015 Northwestern Gets Past Michigan in Big Ten Northwestern overcame a slow start and beat Michigan 13-8 in a Big Ten quarterfinal game on Thursday. The Wildcats move onto the semifinals to play Penn State., 87141\u003dApril 30, 2015 Temple University Player Critically Injured in Hit and Run, 125638\u003dApril 11, 2015 Canisius Nips Fairfield for Eighth Straight, 68989\u003dMay 4, 2015 Bracket Breakdown (DI Women): Dissecting the Field Why didn\u0027t Big Ten automatic qualifier Penn State grab an eight seed? What about USC earning the at-large bid over Cornell or Hofstra? Megan Schneider delves deep into the 26-team NCAA Division I women\u0027s bracket., 162996\u003dMarch 27, 2015 Eipp, Ott Pace UMass to A-10 Win over Duquesne, 215454\u003dMarch 4, 2015 Cummings Leads Terps Past UMBC, 176626\u003dMarch 21, 2015 Stukenberg Anchors No. 1 Terps in Win over No. 9 JMU With a five-point performance, Zoe Stukenberg helped Maryland to a dominant first half in a 14-10 victory over No. 9 James Madison., 159104\u003dMarch 28, 2015 Roach Scores Seven as Vermont Nips UMBC, 218238\u003dMarch 3, 2015 Gilroy Becomes Gators\u0027 Scoring Leader in Loyola Win With a team-high five goals while the Greyhounds locked on Tewaaraton nominees Shannon Gilroy and Nora Barry, Nicole Graziano led Florida to a 3-0 all-time series record against Loyola., 140699\u003dApril 5, 2015 Highlights: Celebrating Easter Weekend WIth Lacrosse The action continues through this evening\u0027s Johns Hopkins-Ohio State Big Ten showdown, but there\u0027s a ton of highlights available from Friday and Saturday\u0027s games already!, 133928\u003dApril 10, 2015 Richmond Edges GW for Fourth Straight Victory, 82230\u003dMay 1, 2015 Stony Brook Scores 12 Second-Half Goals to Top UMBC, 47455\u003dMay 17, 2015 Dominant Second Half Sends Terps Back to the Final Four With an 11-goal second half after a 6-4 halftime, No. 1 Maryland defeated No. 8 Northwestern 17-5 to advance to the NCAA final four for its seventh consecutive year., 200876\u003dMarch 11, 2015 W\u0026M Pulls Away for First Victory, 121217\u003dApril 12, 2015 Lehigh Routs American, 16-6, 145517\u003dApril 4, 2015 Loyola Downs Colgate for Eighth Straight Win Loyola took command of the Patriot League race with an 18-7 win over Colgate, the Greyhounds eighth straight win since starting the season 1-4., 155981\u003dMarch 29, 2015 Gallery: Stony Brook Strong in Win Over Oregon (WD1) With a win over Oregon in the snow on Long Island, Stony Brook stayed unbeaten, along with No. 1 Maryland. Photos by Gregory A. Shemitz., 214319\u003dMarch 5, 2015 Inside the Eagles\u0027 Scout Team and the KayTrain Derailment Boston College enters this weekend undefeated after upsetting Syracuse and completely shutting down Kayla Treanor thanks to a faceguard from attacker Tess Chandler., 136869\u003dApril 8, 2015 Big Second Half Helps Maryland Avoid Princeton Upset Visiting Princeton held a 6-4 lead at the break, but the top-ranked Terrapins went off in the second half and cruised to an 18-10 victory in College Park., 219336\u003dMarch 2, 2015 Eleven Score as Johns Hopkins Routs American, 175217\u003dMarch 21, 2015 Ochoa\u0027s Stunning Save Leads BC Over UNC Zoe Ochoa made a diving save in front of an empty net to preserve a 10-9 overtime victory for Boston College over North Carolina, the Eagles first win ever over the Heels., 217173\u003dMarch 4, 2015 Williamson Career-High Leads Penn Over Rutgers, 199038\u003dMarch 11, 2015 Schmitt Powers Loyola to Upset of Virginia in OT Hannah Schmitt scored three goals in overtime and Loyola held off a frantic Virginia rally to upset the No. 8 Cavaliers 13-12., 150468\u003dApril 3, 2015 Raymond Scores 100th Career Goal in Towson Win, 181771\u003dMarch 18, 2015 UMBC Places Giro on Leave Amid Investigation UMBC, which recently suspended five women\u0027s lacrosse players for reportedly exchanging threatening text messages about freshmen on the team, has placed co-head coach Tony Giro on leave and appointed Amy Slade as the team\u0027s sole head coach., 187375\u003dMarch 15, 2015 UMBC Suspends Players Amid Reports of Threatening Texts Five UMBC women\u0027s lacrosse players have been suspended from the team, the university said Saturday. The statement came after reports of a disturbing group text exchange in which several players reference killing and injuring the team\u0027s freshmen., 174133\u003dMarch 21, 2015 Ferguson, Penn Defense Handle Dartmouth, 146509\u003dApril 4, 2015 Sharp-shooting Syracuse Rolls Over Va Tech Syracuse scored on 13 of its first 15 shots in a 22-8 win over Virginia Tech., 79554\u003dMay 1, 2015 Hompe Leads Princeton Into Ivy Championship, 75765\u003dMay 2, 2015 Ohio State’s Upset Goes Down in History: \"Why Not Us?\" After Maryland led Ohio State 6-4 at halftime, Cian Dabrowski sparked a three-goal run for the No. 4 Buckeyes that handed the Terps their first loss of the season., 120115\u003dApril 12, 2015 George Mason Downs Richmond At Home, 8-5, 206804\u003dMarch 7, 2015 Florida Routs Niagara, Set for Top 10 Foes, 40733\u003dMay 22, 2015 #LMLive Gameday: Women\u0027s Semifinal Friday Duke and North Carolina kick off Memorial Day from PPL Park in Chester, Pa., with Maryland and Syracuse to follow in the DI women\u0027s semifinals., 139684\u003dApril 7, 2015 Notre Dame\u0027s Cortney Fortunato - The Wow Factor One of the most highly-touted recruits in women\u0027s lacrosse, can Cortney Fortunato translate her jaw-dropping ability into a spot at the elite table for the Irish?, 57257\u003dMay 10, 2015 Northwestern Downs Irish to Reach Quarters Northwestern is headed back to the NCAA quarterfinals after knocking off Midwest rival Notre Dame 16-11 on Sunday. The Wildcats will play No. 1 seeded Maryland in the quarters., 172162\u003dMarch 22, 2015 Mupo, Lasota Lift No. 6 Northwestern Over No. 5 Syracuse For the fourth time this season, Kayla Treanor was held without a goal as the Wildcats topped the Orange 11-10 on Saturday afternoon., 91979\u003dApril 25, 2015 Bianco, Defense Lead Northwestern Rout of OSU, 189511\u003dMarch 14, 2015 Duke Beats Louisville to Run Record to 9-0 Taylor Trimble\u0027s fourth goal of the game broke an 8-8 tie and No. 2 Duke beat No. 10 Louisville to move to 9-0, matching the best start in school history., 224183\u003dMarch 1, 2015 Gallery: Penn Edges Vanderbilt in the Snow (WD1) Tory Benson scored with four ticks remaining in overtime to land Penn the narrow victory over Vanderbilt. Photos by Kevin P. Tucker., 188419\u003dMarch 15, 2015 Gallery: Duke Edges Louisville in ACC Action (WD1) Duke saw a strong challenge to its unbeaten start from Louisville on Saturday, but the Blue Devils hung on for a one-goal victory. Photos by Michelle Hutchins., 113454\u003dApril 17, 2015 Weekend Preview: Conference Battles Continue Teams are jockeying for conference position and seeding, and NCAA tournament considerations as well, as the lacrosse calendar enters the second half of April. We preview the weekend\u0027s top games., 122252\u003dApril 12, 2015 Massachusetts Dominates Davidson,19-4, 153119\u003dApril 1, 2015 WD1 Wednesday: It’s Cornell’s Move in the Ancient Eight After upsetting No. 15 Stanford last night, Cornell moves on to its toughest stretch of the schedule, looking to have its best season in nearly 10 seasons. Plus a look at Ivy stats in the bigger picture., 78504\u003dMay 1, 2015 Canisius Headed to 5th Straight MAAC Final, 93057\u003dApril 25, 2015 McHugh OT Goal Lets Marist Foil Siena Rally, 67003\u003dMay 7, 2015 Tewaaraton Finalists Announced for Spring 2015 2014 Tewaaraton recipients Lyle Thompson (Albany) and Taylor Cummings (Maryland) made the final five for this year\u0027s award. Who else joined them?, 42225\u003dMay 21, 2015 Duke’s Quest to be the Best for First Time in Program History The Blue Devils are the only Final Four team without NCAA championship game experience. Can they break the mold and go where no Duke team has gone?}","textBeforeTable":"Drexel William and Mary Elon Towson Delaware James Madison Hofstra Colonial Athletic Association (CAA) Standings All times Eastern CAA Semifinal Box Score Recap Final L, 10-7 James Madison May. 1 Box Score Recap Final L, 8-6 at James Madison * Apr. 19 Box Score Recap Final W, 13-7 at William and Mary * Apr. 17 Box Score Recap Final W, 9-6 at Drexel * Apr. 12 Box Score Recap Final L,","textAfterTable":"headlines July 27, 2015 Reese Named IWLCA Division I National Coach of the Year Coach for two-time Division I national champion Maryland, Cathy Reese has been named the IWLCA National Coach of the Year by the IWLCA on Monday morning. July 21, 2015 Wescott Steps Down as Monmouth Head Coach July 16, 2015 NCAA Rules Oversight Panel Approves Possession Clock After discussing the proposals recommended by the NCAA rules committee on a conference call Wednesday, the NCAA playing rules oversight panel approved all 17 rules proposals, including the 90-second possession clock. July 15, 2015 Meet Julie Castner, Lacrosse\u0027s Newest Social Sensation If you\u0027re from Orlando, you surf. But increasingly, you also play lacrosse. University of Detroit midfielder Julie Castner blew up on social media by combining the two. July 13, 2015 Going Pro: Faces of the Game? Paul Rabil may be the most known face in the game today, but there are several other players held in similar regard by the community at large. July 10, 2015 Amanda Belichick Hired as Holy Cross Women\u0027s Coach","hasKeyColumn":true,"keyColumnIndex":0,"headerRowIndex":0}