{"relation":[["CREATOR","Louis Braille","Blaise Pascal","Galileo Galilei","Edwin Land","George Westinghouse","Guglielmo Marconi","Joshua Lederberg","Thomas Edison","Carl Gauss","John Nash","Brian Josephson","James Hillier","Isaac Newton","Louis Parker","Srinivasa Ramanujan","Satyendra Bose","Paul Dirac","Richard Feynman","Walt Disney","Max Perutz","James Clerk Maxwell","Enrico Fermi","Earnest Rutherford","George Eastman","James Watson","Louis Pasteur","Henri Poincare","Albert Einstein","Niels Bohr","Werner Heisenberg","Nicola Tesla","Linus Pauling","Lee Tsung-Dao"],["CREATION","Invented a system of printing and writing for the blind","Formulated Pascal?s Theorem","Discovered the laws of pendulum motion at the age of Law of falling bodies","Patented his first polarizing light filter","First patent for a rotary steam engine Invented airbrakes","Invented a system of radio telegraphy","Discovered bacterial conjugation","Invented automated relaying communications device","Proved the theorem of complex coefficients","Published his theory of non-cooperative games","Predicted the Josephson effect","Developed the electron microscope","Calculus, principles of optics, elements of circular motion inverse square law of gravity","Invented a low frequency receiver for radio waves","Published his first mathematical papers","Published is first statistical mechanics papers","Quantum mechanics for motion of atomic particles","Published his theory of electromagnetic waves","Drew his first animated cartoon","Crystallographic studies of glaciers Applied Xray crystallography to study hemoglobin","Published first paper on electromagnetic lines of force","Postulated his statistical laws","Discovered the alpha, beta and gamma radiation","Made commercial dry photographic plates","Co-published his paper on DNA","Discovered tartarate isomers","Created automorphic functions","Published 3 ground-breaking articles (including relativity)","Proposed his model of the Bohr atom","Derived his uncertainty principle","Constructed his first induction motor","Laid down Pauling?s Rules","Discovered the decay modes of kaon"],["AGE (years)","15","16","17","19","19 22","21","21","22","22","22","22","22","23","23","24","24","24","24","24","24 25","25","25","25","25","25","26","26","26","26","26","27","27","29"]],"pageTitle":"Ken\u0027s Reflections - Bravenet Blog","title":"","url":"http://kenlyen.bravejournal.com/","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"RELATION","tableNum":4,"s3Link":"","recordEndOffset":0,"recordOffset":0,"tableOrientation":"HORIZONTAL","TableContextTimeStampBeforeTable":"{53550\u003dMusical theatre in Singapore is still relatively undeveloped compared to Broadway or the West End. Since the staging of the first Singapore musicals in 1988, there has been some progress over the past 21 years. However, development has been uneven, and the better ?Singapore? shows are actually written at least in part by non-Singaporeans e.g. the book and lyrics for Forbidden City is written by Stephen Clark, and for A Twist of Fate, the lyrics are written by Anthony Drewe, and the book by Stephen Dexter and Tony Petito. While it is expedient to get higher quality bookwriters and lyricists from abroad, this is definitely not the way to go in the long run. Indeed it has often been commented that Forbidden City and A Twist of Fate do not feel like musicals with a Singapore sentiment. Indeed they are really quite un-Singaporean, and they do not represent Singapore artistically or spiritually. To put us back on the right track in creating Singapore musicals, I believe the Government should play a key role. It needs to focus specifically on musical theatre, and to draw up a coherent long-term strategy. Why musical theatre? Because this is the centrepiece of the performing arts, embracing all its major elements, including acting, music, dance, and multimedia. Musical theatre can complement the related entertainment industry, including television, film, animation, advertising, and design. As an added bonus, musical theatre has the potential to a revenue generator in its own right, supporting the tourist industry, and becoming a major player when the integrated resorts become established. Finally, musical theatre plays an important role in encouraging social cohesion, and through its stories, music and dance, it will help us find our own unique creative and artistic heart. What is the current state of musical theatre in Singapore? Let us look at the development of Singapore?s musical theatre from different perspectives. One can examine the state of musical theatre from a developmental standpoint, seeing where we have been in the past, and where we are going in the future. Are we going to follow the West, or are we going to develop our own unique voice? One can look at musicals from a bird?s eye view, seeing where it stands in relation to the overall state of Singapore entertainment, and how it will fit in with the integrated resorts and tourist industry. One can also examine musical theatre from an economic perspective, how it will enhance Singapore as a creative city, and how it can help attract and keep creative people in Singapore. This last point is worth emphasizing. The increasing importance of the creative industries in our economy, the need to attract and retain creative people, and the necessity of anchoring people to its social fabric and cultural roots, make musical theatre an ideal vehicle for enhancing creativity and social cohesion. Why? The reason is that a musical is a collaborative art form par excellence. The members of musical theatre?s creative team are of equal or near-equal importance, and this makes it one of the best training grounds for developing group creativity. Musical theatre is at the crossroads of several art forms. It combines bookwriting, lyric writing, music composition, and choreography. It requires the performers to act, sing, and dance. Set designers, sound designers, and lighting designers, work together to create the appropriate atmosphere essential for theatre. All this is done in real-time, and therefore allows for immediate review, and changes can be made on the spot. Musical theatre is also at the junction between live theatre, and the film industry. Royston Tan?s film, ?881\" and ?Lotus 12? are two good examples where musical theatre (getai) can touch the nerve of the nation, generate some revenue at the same time. This film musical is also exportable, and by being shown overseas, it will enhance Singapore?s reputation. Unfortunately, Singapore?s musical theatre industry is lagging behind, despite being around for 21 years. This is attributable, to a significant extent, to its neglect by the Singapore Government. There are grants given to playwriting and screenwriting, but none for the writing of, music composition and choreography of new musicals. The performance and technical complexities of staging a musical compared to a straight play means that more time is needed for mounting a production. However, no help is given to cover the increased staging costs. The National Arts Council has advised musical theatre creators to write small-scale ?chamber? musicals, and to volunteer for the neighborhood arts festivals. This has led to the writing of small-scale and cheap-to-stage musicals. While this is good for the short-term, I have some reservations about the implications of this advice. Currently, Singaporeans are directing their energies into writing and performing low-cost small musicals. These are unlikely to generate much revenue, are less likely to be exportable, and tend to be mired in the realm of amateur or community theatre. To date the National Arts Council has given relatively little financial support to content development for musical theatre. I believe there should be no restrictions on creativity. Some musicals are small-scale, and others are large-scale. We should not exclude the development of mega-musicals. To redress the problems faced by the entertainment industry in general, and musical theatre in particular, there needs to be greater Government and corporate involvement. I would like to make the following practical recommendations. I am aware that there are some grants already available (eg scholarships for individuals in the performing arts). As for grants for creative writing, the eligibility criteria are sometimes a but too stringent so, that organizations that need this support are not receiving it. A. CREATIVE WRITERS, COMPOSERS, CHOREOGRAPHERS 1. Annual grants for writing new musicals. 2. Annual scholarships or bursaries for talented writers, composers and choreographers to go overseas to study the writing/ composing/ choreographing for musical theatre. B. DEVELOPMENTAL WORKSHOPS AND STAGING 1. Annual grants for development and workshopping new musicals. 2. Grants to invite prominent overseas writers/composers/choreographers to come to Singapore to conduct workshops and give keynote addresses. 3. Annual grants for Singapore artists in residence (creative) to write and teach. 4. Annual grants for workshop no-frills staging of the newly developed musicals. C. STAGING AND FILMING 1. Annual grants to stage the best musical at the Singapore Festival of the Arts or an equivalent festival. 2. Annual grant to bring a Singapore musical overseas. 3. Travel bursaries for directors, performers, technical personnel, and the creative team, to accompany and perform in the Singapore musical overseas. 4. Assistance in advertising and marketing Singapore musicals both in Singapore and overseas. 5. Grants for filming musicals for television and for feature films. D. AUDIENCE DEVELOPMENT 1. Encourage schools to perform musicals, especially musicals written by Singaporeans for Singapore schools. 2. Allow the use of Edusave or other similar funds to encourage school children to attend musicals. 3. Encourage corporations, community groups, retirees, disabled people, to have musicals specially written for them, and wherever possible, to have community groups retirees, and disabled people perform these musicals. E. FUTURE DEVELOPMENTS 1. To research and develop new forms of musicals, and to help bridge musicals with other media, e.g. internet, multimedia, animation, film, puppetry, ?Cirque du Soleil? style of performance, etc. 2. To foster links of musical theatre with all the other art groups in Singapore. 3. To consider the development of an annual Asian Festival of Musicals, similar to the annual New York Musical Theatre Festival http://www.nymf.org/ . Already Korea, Japan and Malaysia are writing and staging new musicals, and shortly China will follow suit. We need to take the initiative and prepare for such an Asian festival of musicals. The role of musical theatre and its role in the shaping of Singapore?s future will depend on the steps taken today. We are at a critical junction. Judicious and wise policies established now will have a profound impact for the future. It is the creative individual that the future of Singapore will depend., 44310\u003dThe Singapore Renaissance City Plan III report published in 2008 concluded: \"Content is at the core of arts, culture and the creative industries. While technology has advanced rapidly, creating new platforms for creative content, at the heart of every work is a story to tell. Writer, composers, choreographers, artists and curators are story-tellers that draw on their past and their imagination to create artistic works that delight and educate. Some of these works will go on to drive the digital media, television and design sectors as intellectual capital.\" What are the problems associated with developing new musicals, and why is it so critical to assist writers and composers in this process? Musical theatre is a highly complex collaborative art form requiring the combination of skills from different talents, including storytelling, music and movement. Getting a musical right is much more formidable than with a straight play. Writing a musical can be likened to assembling a jigsaw puzzle. Each piece must be placed exactly. If you remove one song, you might land up with two ballads in a row, which could affect the scene?s momentum. Or if you add an extra song to a minor character, you might undermine a main character?s developmental arc. Mastering the craft of writing a musical is a long journey that requires guidance. All roads lead to Rome, and this is equally true of musical theatre writing. You can start with a synopsis or plot outline, or you can start with fashioning the main characters. You can start with the book or the songs. No matter which route you take, it is usually difficult for rookie writers and composers to come up with a masterpiece on their first attempt. Each participant is assigned a mentor. A series of readings in front of experienced writers, directors, and performers, who are primed to give diplomatic critiques, is invaluable in the developmental process. A set of assessment rubrics has been developed to allow for more accurate and detailed evaluation of the musical. 1. The first reading focuses on the book and story. 2. The second reading adds singing of the songs. 3. The third is a concert-like performance of the entire musical with no sets, no costumes, and scripts held in the hand. 4. The fourth and final step is a no-frills performance in a small stage. It is through such a process that we can develop thrilling, vibrant and ground-breaking musical theatre. Major cities with a thriving musical theatre scene have organizations dedicated to the creation of new works. These include: a) New York BMI Musical Theatre Workshop http://www.bmi.com/genres/C2687 b) Chicago Theatre Building http://www.theatrebuildingchicago.org/ c) Mercury Musical Developments http://www.mercurymusicals.com/ These companies have played important roles in developing new musicals in New York, Chicago, and London respectively. The developed musicals are then showcased to production houses, who, if they like the musical, take the show to the commercial stage. We have studied the above models when in 2004 we set up Musical Theatre Society (later called Musical Theatre Limited) to develop original Singapore musicals. The founding members have already had 10 years? experience in writing and staging Singapore musicals before setting up Musical Theatre Limited. In a few short years, we have already established an outstanding track record in identifying and nurturing writers, musicians, choreographers, directors, and performers. Since our formation, we have successfully staged over 30 new Singapore musicals. Among our alumni are Iskandar Ismail, Bang Wenfu, Kenny Ngo, Clement Yang, Jack Ho, who are now very successful professional musicians. Our writers include Stella Kon, Robert Yeo, Ng Yi-Sheng, who are also successful professionals. In addition, we have discovered and mentored more than a dozen younger writers and composers. One of the songs written by Sean Wong for the musical ?Heartstrings? was picked up by Universal Music for one of their Hong Kong pop singers. The musical \"Georgette\", featuring the life of pioneer Singapore artist Georgette Chen, has received critical acclaim, and we brought it overseas for a performance in Manila in 2008. Our puppet musical \"The Legend of Red Hill\" has won second prize in an international puppet festival in 2008. We were invited to write the television musical \"School House Rockz\" received the highest AC Nielsen rating of 11% by a local show, and was nominated for an Asian Television Award 2008. Musical Theatre Limited has developed musical content not only for live stage, but also for television, movies, puppetry, and for the pop music industry. In future, we will be exploring the writing of musicals for animation and new media. Musical Theatre Limited is ideally placed to help Singapore develop quality content for musical theatre and its allied industries, and to propel Singapore into the international arena., 38539\u003dShowboat in 1927 ushered the American book musical, where story became unified with the songs. Over the next few decades, musical theatre has changed. The 30s and 40s were dominated by the jazz influences of Cole Porter, George Gershwin, Rodgers \u0026 Hart, Irving Berlin, Jerome Kern, and Sigmund Romberg. The 50s and 60s were led by the melodic strains of Rodgers \u0026 Hammerstein, Lerner \u0026 Loewe, Frank Loesser. The 70s and 80s were eclipsed by the European mega-musicals of Andrew Lloyd Webber, Sch?nberg and Boublil. Some American shows had a renaissance with Marvin Hamlisch and Ed Kleban?s A Chorus Line, and the musicals of Stephen Sondheim. The 90s and 2000s were characterized by the music of Stephen Schwartz, Frank Wildhorn, Jonathan Larsson, and the Disney musicals. The musical styles of each decade lag behind but eventually reflect the contemporary styles of that era. Is Musical Theatre Dead? It is true that the cost of mounting musicals has escalated, and the mean age of the audience has been rising. Most new musicals never survive. At several points in time, journalists and soothsayers have predicted the end of musical theatre. They have been consistently wrong. Musical theatre seemed to lie at death?s door, but at the last minute, always managed to be resuscitated. In evolutionary biology, an organism adapts to different environments by changing its characteristics. In an analogous way, that?s what?s happening to musical theatre. It constantly adapts in order to survive. How Has Musical Theatre Adapted? Here are a few ways that musical theatre has adapted to the ever-changing environment: \"Jukebox musicals\" These are musicals using the songs written by one songwriting team or band as the framework to construct a story linking these songs. In the classical jukebox musical, the lyrics of the original songs cannot be changed. Examples of jukebox musicals are Mamma Mia!, Across the Universe, and All Shook Up. A subset of the jukebox musical is the \"bio musical\", which also uses the songs of a songwriter or band to retell the life story of that composer or band. An example of this is The Buddy Holly Story. \"Hotchpotch Musical\" This is in contrast to the \"hotchpotch musical\" (my terminology), where the story has already been written, and songs from a variety of composers and genres are selected to fit into that story. An example of this is Moulin Rouge, which uses non-original songs to fit into it. These are songs from The Sound of Music, Gentlemen Prefer Blondes, Elton John?s Your Song, and many others. A subset of the hotchpotch musical I will refer to as the \"hotchpotch musical revue\". An example of this is Menopause, which has no story line, but uses well-known songs but tweaks the lyrics to fit the scenes. Other examples are the Forbidden Broadway series satirizing musical theatre. \"Musical Revue\" The \"musical revue\" is not new, but like insects, it has considerable survival instincts. It is a show based on a theme, where original songs are written to a unifying subject, usually devoid of story, or if present, the plot is usually very weak. An example of this is I Love You, You?re Perfect, Now Change. Other examples are Side by Side by Sondheim, Closer Than Ever, etc. Some people have argued that Andrew Lloyd Webber-TS Eliot?s Cats fits more comfortably as a musical revue. \"Dance Musical\" A \"dance musical\" is one where the dance component predominates, and there are examples where the musical may not even contain any songs. An example of this is \"Movin? Out\", and Contact. The latter drew considerable controversy when it won the 2000 Tony Award for Best Musical, as it was mainly dance, used only prerecorded music, and there was no singing. A \"dance musical revue\" is a theme-based dance show, without a story line. An example of this is Fosse. A variation of the \"dance musical\" is the \"kung fu musical\" where pugilistic fighting sequences are choreographed to music. An example of this is Soul of Shaolin. \"Musicalizing Films\" The borrowing of ideas from films is neither new nor original. But it does draw on the popularity and heavy marketing already done for the films. The resulting stage musical succeeds commercially and artistically more often than we might care to admit. All these forms, and many others (e.g. TV or film musicals, animation musicals, puppet musicals, plays with music, computer games with interactive musical theatre songs, etc.) are, in my opinion, good for musical theatre as a whole, because they widen the audience base, and bring in a new generation of musical theatre aficionados.. Purists and traditionalists will always decry these new variations. However, musical theatre is an evolving art form, and will continue to change. It needs to, in order to survive into the distant future. Finding the New Audience Critical to the future success of musical theatre is finding a new and younger audience. There are several places to look for them. The first is to see what attracts present day teenagers. What you hear on MTV and top of the charts may be the place. There is a slew of hip-hop television and film musicals, which are very popular. So updating the musical style is one important way to attract a new audience. The second area to explore is that of the live performance band. Perhaps musicals might need to adopt some of the techniques used by successful rock bands. Is it the star power, or is it the loud sounds, or is it herd behavior that makes them so wildly successful? The third is to find the medium that best massages the audience. The current success of interactive online games and touch-screen devices may give a clue as to where musical theatre might need to venture forth. Who knows, maybe Ninetendo Wii has already invented something akin to their Guitar Hero for musical theatre? It is conceivable that perhaps cross-cultural studies might give some clues as to how musical theatre can survive. For example, Bollywood films are predominantly musicals. How did they endure so many decades? Finally, maybe we should cater to the short attention span of the MTV or post-Y-generation (the grandchildren of the Baby Boomers). Short musicals, lasting 10-15 minutes, seem to be garnering an increasing audience. In Conclusion I am therefore always optimistic about its future. It may change radically. It may be swallowed up by new technology, like the internet or interactive touch screen technology, or three-dimension cinema. It might well change its spots and become quite unrecognizable. But that is the potential power of musical theatre. If it were to go under, then, like the legendary phoenix, it will always arise again from the ashes., 70945\u003dAre Singapore musicals a \u0027copy\u0027 of Broadway/West End musicals? Yes, there is a very strong Broadway/West End influence in Singapore musicals in English. Most of our musicals are fashioned after the Western model. Is this desirable? No, not in the long run. We need to find our own voice, our unique identity. Do you see any distinct difference in local and foreign musical productions? Yes, it is still fairly easy to differentiate a foreign from a local. Foreign musicals are usually slicker, more self-assertive, better marketed, and tend to have higher ticket prices. Singaporeans, in general, hold a higher opinion of overseas productions compared to local ones. With a few exceptions, most locally produced musicals are not as polished or as lavish as foreign productions. The more conspicuous foreign productions that have come to Singapore, like Phantom of the Opera, Les Mis?rables, Cats, etc., cost millions of US dollars. In contrast, most local productions are way under one million Sing dollars. With a budget of millions, one can attract world class singers, directors, designers, beautiful costumes, stunning sets, etc. Of course a high budget does not guarantee quality. But a high budget usually results in better production values, and more effective marketing. Unfortunately it is a vicious cycle. Local shows are strapped for finances. As a result corners are cut, compromises made, resulting in most performances lacking the pizzazz and the wow factor. Audiences come home disappointed, and their opinion of local shows being of inferior quality becomes increasingly ingrained in their psyche. Singapore musicals are still in their infancy. Do you agree? Musicals in the West have been evolving over the course of 100 years, whereas Singapore\u0027s first musicals were staged in 1988, only 21 years ago. We have on average had about 2 to 4 original musicals publicly performed annually in these 21 years. This is in contrast to the 40 or more musicals produced annually in Broadway and West End, of which in good years, some 10-20 are newly written musicals. What is lacking and what are the strengths of Singapore musicals? Because of the relative poverty of musicals staged by local theatre companies, it has been a struggle to sustain a thriving musical theatre industry. There are too few opportunities for writers and composers to have their works staged. This results in directors not getting the opportunity to direct, performers getting the opportunity to perform, and technical crew getting the opportunity to develop their expertise. Furthermore, this affects the quality of musicals because we do not have a strong base of outstanding directors and performers. When the public watches a Singapore musical, they are often disappointed, and they may not return to watch another made-in-Singapore musical. Hence the audience base for local musicals is very small. On the other hand, we do have our own Singapore stories to tell. We are situated in Southeast Asia and we are influenced by many Asian musical and theatre styles. Our ability to fuse eastern and western styles may prove advantageous. Hence our potential for creating a genuine Singapore musical fashion is not only possible, but given time, is very likely. Has the local arts scene developed in any way as compared to previous years? The arts scene has improved dramatically (sorry for the lame choice of word) over the past few decades. Before 1988 there were no locally written musicals. Nowadays we can look forward to a few new made-in-Singapore musicals each year. Overall, production values have improved, with better singers, actors, dancers, sets, sound, and lighting. Audience size has expanded, and there is a larger core group of supporters. There are more venues for staging shows, but the price of rental has remained high. Why aren\u0027t we developing our own brand of musicals? We are strongly influenced by Western musicals, and the big mega musicals like Phantom of the Opera, Les Mis?rables and Cats, have made their mark in Singapore. Audiences like to watch these large scale spectacular musicals, and they in turn influence the style of musicals written. Furthermore, producing musicals is relatively expensive compared to straight plays and concerts. We do not have sufficient financial support from either government or private companies. Few production companies are prepared to take the risk of staging new local musicals. Writers and composers therefore have scarce opportunities to see their works staged, and many are discouraged from writing. Without a flurry of new works, our prospects of evolving our own brand of musicals is dimmed. What is the solution? The answer is if you want to create a brand of musical unique to Singapore, there must be more concerted and pro-active support by the National Arts Council together with the private sector. What does it take to make our own world-class musicals? We need to tell our own special Singapore stories in a way that engages our audience. To be world-class the quality of the musicals must be of the highest level, with world-class performers and staging. This requires a leap of faith and courage to write ground-breaking original musicals coupled with the best production values. It is only through writing and staging many more musicals that will enable us to push our standards up to an international level. What elements would go into it? We should be more willing to explore Asian music and theatre. On the one hand we can explore the fusion of Western and Eastern styles, and on the other, we should write about ourselves, and let our imagination soar. We need to explore developing our musicals with film, television, puppetry, multimedia, animation, and computer games. There is considerable creative synergism when different media meet. In general, we need to continue writing and to stage more original musicals, at ticket prices that people can afford, so we can develop a new audience base. What about turning local stories into huge stage musicals? Indeed, we have a wealth of local stories, myths, and folk tales. This is a huge reservoir of untapped stories, to be told in our own incomparable way. Huge stage musicals are expensive and the risk of failure is high. Therefore, to start off, we should do small-to-medium-scale musicals, until we are confident in producing quality musicals. Do you think we can export our musicals around the world? Yes, I believe there is a hunger for new musicals worldwide. A local Singapore story with universal themes can be exported internationally. We need to concentrate on creating a large number of original works because it is unpredictable which ones can be exported. What stories or material are worth turning into stage musicals? Personal stories, historical stories, myths, and folk tales are eminently suitable for turning into stage musicals. But in essence, we are only limited by our own imagination. It used to be said that horror, action, and extremely sad stories are not suitable for musical theatre. However, this is being disproven, as musicals in these genres are being produced and gaining popularity. In short, the sky\u0027s the limit! Singapore has seen a rise in the staging of local musical like Beauty World, Forbidden City, Man of Letters, Sleepless Town, etc. In your opinion, what could have contributed to this? (i.e. larger audience? Esplanade?s drawing power?) Local musicals can tell stories and touch Singaporeans in ways that imported foreign shows may fail to do. The audience is there. But there are not enough local musicals being written and staged. Every production of a new musical is important. It sparks the creative process, it helps discover new talent, and it widens the audience base. Furthermore, for the creators of new musicals, each time one is staged, something will be learnt, new experiences gained. This is absolutely essential for the evolution of musical theater, and in time, we will find our own unique Singapore artistic voice. The Esplanade has been actively encouraging the incubation of new works, and they should be applauded for this. Our audience size is expanding, but it is still relatively small. Local shows can barely last more than a couple of months at best. We could market our shows better both locally and to the region. Perhaps the Singapore Tourist Promotion Board could be more active in tapping on the tourist market. What are your views on the local market for musicals: Is Singapore ready? Do we have to stick to certain formulas e.g. commercial mass appeal? Or should we merely import Broadway scripts to succeed? The best time to develop and market our musicals is now. We need a multi-pronged approach. There is value in producing well-known musicals, like Cabaret and Little Shop of Horrors. We get to see what the international standard is, and this allows us to benchmark ourselves. However, we must develop our own Singapore musical. While considerable latitude should be given to the writing-composing teams, this does not mean there is a free-for-all. Sadly, some artists tend to forget there is an audience, and become a little too self-indulgent. The result is that their works may either be incomprehensible or somewhat boring. Hence the need for intelligent reviews, especially by the critics writing for the mass media. The problem of nurturing our own creative works is made more difficult by the relative lack of support by our institutions. For example, there have been no Singapore musicals in the main program of the Singapore Festival of Arts for the past 10 years. With large productions being staged here, can Singapore be the \u0027Broadway of the East\u0027? Hollywood for musical performance? Or do we have a long way to go? Yes, Singapore can indeed be the Broadway of the East. We have several unique attributes. Firstly, there is a wealth of stories waiting to be told in the genre of musical theater. We also have a fascinating variety of Asian music, with different rhythms and different instruments. Our talent pool is immense, and largely untapped. We have not reached the stage where musical theater prohibitively expensive to stage. We have a long way to go. Funding Singapore shows is immensely difficult, and attracting large audiences to watch our local shows is an uphill struggle. Our talent is still not quite world-class in ability, but we are reaching international standards very rapidly. We are at a critical level of development, for we have the creative talents, but limited opportunities to stage the musicals that have been written. If we are truly to become a major tourist attraction, integrated resorts notwithstanding, we need to have a more vibrant arts scene, and our institutions should take a more proactive role. What do you think is the formula for success for theater productions in Singapore? i.e. adopt Broadway productions, scripts, engage world class directors, train local talents, etc. Musical theater is a collaborative art form. Every element must work for a show to be successful. The corollary is that failure in any one of its components can result in failure of the entire show. Thus, the main elements of success are: a) Teamwork: collaborative creativity is one of the most difficult and yet the most vital skill that we must learn in Singapore. Choosing the right team is critical for success. b) Attention to detail: it is said that a musical is not written, but rewritten. One needs to adopt a perfectionist attitude. The book, the lyrics, the music, the choreography, arrangement, performance, etc., needs to be close to perfect. This can only be achieved by paying attention to detail, and polishing until the performance sparkles. c) Training: we should learn from the best, and therefore going overseas for training in musical theater is important. Inviting foreign directors, choreographers, are part of the learning process, but it is important that there is transfer of technology. It is sometimes far too easy to invite a famous overseas person for the sake of selling a show, but if there is no attempt to have the person give workshops, tutorials, master classes, it is an effort that goes to waste. d) Flexible mind set: we should not have any rigid mind set about musical theater. Often I encounter people who tell me that they do not support musicals because it is too expensive, too old-fashioned, too plebeian, too superficial, and too western. Of course, musical theater can be all of the above, and also, none of the above. It is up to us to create our own unique and distinct art form. Thus, we should all keep our minds open and flexible. Having said all this, I don\u0027t anybody really knows what the formula for success is! Why do kids seem to love musicals, and how can we foster and turn them into a loyal audience base? Musical theatre is telling a story through a combination of acting, singing, and dancing. It is a very entertaining art form, and with the aid of music, can be very powerful emotionally. Provided we produce quality musicals that can speak and touch our audiences, we will find a very large and loyal audience. Families love musicals, and children are often enthralled by the experience. It is good to start young, and introduce musicals into schools. Where will Singapore go in the next ten years? Development in the arts needs to expand in all directions. At the high end, we need to create high quality shows that can travel internationally. This can only be done if attention is given to the developmental process. Incubation of new works is a high priority in this regard, and funding should be given for this. Training singers, actors, dancers, directors, choreographers, and technical staff, etc., need to be enhanced. More courses should be made available, and subsidies given to allow more people to attend these classes. Production costs for world-class musicals is high, and therefore a system of selecting the best for financial support should be set up. At the community, schools and tertiary educational institution level, encouragement should be given, not only for the writing of new works, but also in having more opportunities to showcase the works and talents. This is where young and promising talent can be spotted and nurtured. Also, those who have been involved in musical theater productions, then to be the most ardent supporters. Therefore, schools, tertiary institutions, and community centers need to have an active program that is focused on the promotion of musical theater. You have been known to advocate musical theater in Singapore, being the brain child of Five Foot Broadway, a program that staged 5 locally produced musicals. Why the initiative and how has it helped? Actually we have already staged over 30 new Singapore musicals under this initiative, and we are continuing our successful incubation program. Content is king, and we are focusing our efforts in creating new Singapore musicals. We have discovered that Singapore has a large pool of tremendously talented individuals in the creative as well as in the performance side. All these people need are encouragement and opportunities to showcase their works. The spinoffs are important and wide-ranging. These include the creation of a wide range of new musicals. Collaboration with filmmakers, animation and games creators, television, puppetry, and the music industry, is already under way, and it underscores the centrality of musical theater in media and entertainment. Musical theater is an important art form in its own right, and there is cross-fertilization with other creative industries. In these difficult economic times we believe that more support is critical in ensuring that this art form continues to grow and evolve. Our National Arts Council needs to play a more pro-active role in this regard., 77153\u003dREFERENCES Nasar S. A beautiful mind: the life of mathematical genius and Nobel laureate John Nash. Touchstone Books 2001.}","TableContextTimeStampAfterTable":"{188642\u003dFull Monty, The (2000). [http://www.broadwaymusicalhome.com/shows/fullmonty.htm] [http://www.musicaltheatreaudition.com/shows/fullmonty.html] [http://www.musicalheaven.com/Detailed/1747.html] Music and lyrics: David Yazbek, Book: Terrence McNally. :Musical version of the movie, about a group of frustrated unemployed steel workers who decide to present a striptease act at a local club. [http://www.youtube.com/watch?v\u003dEoiupccSyy8 YouTube], 319135\u003dFitzgerald M: The Genesis Of Artistic Creativity: Asperger\u0027s Syndrome and the Arts. Jessica Kingsley Publishers 2005., 211962\u003dLittle Night Music, A (1973). [http://www.broadwaymusicalhome.com/shows/nightmusic.htm] [http://www.musicaltheatreaudition.com/shows/alittlenitemusic.html] [http://wiki.stageagent.com/more_show_info.php?id\u003d735] Music and lyrics: Stephen Sondheim, Book: Hugh Wheeler. Based on Ingmar Bergman?s 1956 film, Smiles of a Summer Night, it takes place over a weekend in the country in early 20th century Sweden. The story revolves around 3 couples. Middle-aged widowed lawyer, Fredrik Egerman, has remarried, but his young new wife Anne is still a virgin after 11 months of marriage. He meets up with his former mistress, Desiree, but the latter turns up unexpectedly with her current lover. In the meantime, Fredrik?s son has fallen in love with his father?s young wife. [http://youtube.com/watch?v\u003de0tTCaFEEKI Barbra Streisand], 156712\u003dAvenue Q (2003). [http://www.broadwaymusicalhome.com/shows/avenueq.htm] [http://www.musicaltheatreaudition.com/shows/avenueQ.html] Music and lyrics by Robert Lopez and Jeff Marx. :Muppet-like puppet show for mature audiences, with songs about aids, homosexuality, pornography, and racial discrimination. [http://www.youtube.com/watch?v\u003dazsg4hwpWt4 YouTube] [http://www.theatre.com/video/id/3002972 Theatre.com] [http://www.broadwayworld.com/videoinfo.cfm?showid\u003d37 Broadwayworld.com], 185955\u003dFive Guys Named Moe (1990). [http://www.fiveguysnamedmoe.com/] [http://www.musicalheaven.com/Detailed/1551.html] Music: Louis Jordan. Musical revue about Nomax, who pines for love, and drowns his misery in alcohol. Materializing from a radio that he is listening to, are the five Moes who teach him, through song and dance, about life and love. [http://www.youtube.com/watch?v\u003dfiarcCS1-OU YouTube], 60399\u003dWhy do we buy tickets to watch a musical? What do we want, what do we look for? Personally I want to be entertained, to watch a musical with a good story well acted, a variety of stimulating songs beautifully sung, and exciting movement and dance. Shanghai Blues fails on all counts. Adapted from a 1984 Hong Kong movie written by Raymond To and directed by Tsui Hark, Shanghai Blues is a Mandarin-language musical set during the Japanese invasion of Shanghai, and the years shortly after the war. Wen Chong, a young patriot and a violinist, meets a young woman, Tu Yun, under a bridge. Both are trying to hide from the invading Japanese. In the dark, and unable to see one another clearly, they fall in love. They promise to meet again under the same bridge after the end of the war, but they are separated before they can discover each other?s name. In due course, Wen Chong returns to Shanghai, unaware that the woman he loves is the nightclub singer living in an apartment just below his. In the meantime, another young lady, Dan Lei, has come to Shanghai looking for her fortune, and Tu Yun is persuaded to share lodgings with her. Dan Lei meets Wen Chong and they fall in love. The start of the musical is quite well done, and the plot setup is not bad. However, the musical goes downhill from then on. The problem is for how long can you suspend disbelief that Wen Chong and Tu Yun fail to recognize one another? They live literally on top of each other, and they work at the same nightclub, Wen Chong as a waiter, and Tu Yun as a singer. But nothing happens between them for nearly the entire show. When you add in Dan Lei as a potential love triangle, that simply does not work because Wen Chong and Tu Yun remain as uninvolved colleagues. For a musical that comprises a string of bland songs sometimes sung out of tune, punctuated by a few Maoist-style patriotic songs sans the political passion, and you are heading for two hours of boredom. The lyrics are simply appalling, because they do not rhyme, are far too general, do not advance the plot, and do not even sit comfortably with the melody. The distribution of songs is unbalanced: too many in the first half, and insufficient in the second half. It must be noted that neither the composer nor the lyricist are credited in the program notes or the official website. The main characters are poorly drawn. We do not know what motivates them. We do not know why Wen Chong is still unattached and looking for Tu Yun after eight years of the Japanese war. Nor do we know why he is willing, at the drop of a hat, to jettison Dan Lei, when he has seemingly fallen in love with her. This poor characterization extends to all the other characters. It is not salvaged by dialogue that is trivial and uninteresting. Although there are a few humorous moments, they are few and far between. The war is curiously out of the picture throughout the musical. Then, after the war, when the communists rise to prominence, this too is glossed over and given facile treatment. The white industrialist is the scapegoat for all the capitalist ills, and on the day he is to take Tu Yun to London with him, he disappears completely. Some of the main actors overact like a Chinese soap opera. The dancing style is distracting, and often the wrong dance style for the given music. It must be said that William So, Emma Yong, and Celine Rosa Tan sing and act reasonably well. The supporting cast and ensemble are accomplished. The orchestra sits right in the middle of the stage, which is all right, but sometimes I wish it were out of sight because the musicians? lighting diverts one?s attention away from the actors. The major reasons why this musical fails, is the lack of conflict between the characters, the poor use of the drama of war and the communist ideology, and a plot that is much too simplistic and utterly predictable. It is burdened by bland music, poor pitching in some of the singers, suboptimal direction, inappropriate choreography, and a set design that is interesting but too distracting. In short, this musical is a disaster. It needs a radical revision to make it work., 218018\u003dMary Poppins (1999). [http://www.nodanw.com/shows_m/index.htm] [http://www.musicaltheatreaudition.com/shows/marypoppins.html] Music and lyrics: Richard M and Robert R Sherman, Book by Julien Fellowes, New songs and additional music and lyrics by George Stiles and Anthony Drew. :Adaptation of Disney?s movie, Mary is a magical governess who comes to the Bank?s home to look after the two children, and helps the family find love and understanding. [http://www.marypoppinsthemusical.co.uk/poppins-video-quicktime.php?p\u003d20 Video1] [http://disney.go.com/theatre/marypoppins/ Video2] [http://www.broadwayworld.com/videoinfo.cfm?showid\u003d2184 Broadwayworld.com] [http://www.broadway.com/gen/show.aspx?SI\u003d524489 Broadway.com]   Merrily We Roll Along (1981). [http://www.broadwaymusicalhome.com/shows/merrily.htm] [http://www.musicaltheatreaudition.com/shows/merrilyweroll.html] Music and lyrics: Stephen Sondheim, Book: George Furth. :Story told backwards, centers on Franklin Shepard, a successful composer, whose prodigal life includes betrayal of his wife and friends in pursuit of fame and wealth. [http://youtube.com/watch?v\u003dwwPIUMPAAuk Audra McDonald], 318641\u003dHowwe MJA. Genius Explained. Cambridge Univ Press 2001., 193670\u003dHairspray (2002). [http://www.broadwaymusicalhome.com/shows/hairspray.htm] [http://www.musicaltheatreaudition.com/shows/hairspray.html] Music: Marc Shaiman, Lyrics: Marc Shaiman and Scott Wittman, Book: Mark O\u0027Donnell and Thomas Meehan. :Based on the 1988 movie. When Tracy Turnblad gets a chance to dance on the Corny Collins TV Show, she becomes an overnight teen celebrity. She then embarks on a mission to racially integrate the show. [http://hairspraythemusical.com/ Videos] [http://www.broadwayworld.com/videoinfo.cfm?showid\u003d10 Broadwayworld.com] [http://www.broadway.com/gen/Buzz_Video.aspx?ci\u003d515073 Broadway.com], 188389\u003dFosse (1999). [http://www.broadwaymusicalhome.com/shows/fosse.htm] [http://www.musicalheaven.com/Detailed/1744.html] Creators: Various. :Musical dance revue showcasing pieces choreographed by the late Bob Fosse., 315326\u003dHershman DJ, Lieb J. Manic depression and creativity. Prometheus Books 1998., 260974\u003dWild Party, The (LaChiusa) (2000). [http://www.broadwaymusicalhome.com/shows/thewildparty.htm] Music and lyrics: Michael John LaChiusa, Book: Michael John La Chiusa and George C Wolfe. :Based on Joseph Moncure March\u0027s 1928 poem. Queenie and Burrs throw a party in their Manhattan apartment, but it goes out of control. [http://youtube.com/watch?v\u003d9JwpM97NB2s Tony?s]          Wiz, The (1975). [http://www.broadwaymusicalhome.com/shows/wiz.htm] [http://www.musicaltheatreaudition.com/shows/thewiz.html] Music: Charlie Smalls, Book: William F. Brown. :An all black version of Frank L Baum?s Wizard of Oz. [http://youtube.com/watch?v\u003dodxZqAVEKlE Tony?s] [http://us.imdb.com/title/tt0078504/trailers Movie Trailer], 67739\u003dSingapore Kids Central\u0027s first made-for-TV musical to be televised 17 Feb 2008. Music and lyrics by Kenneth Lyen, Desmond Moey and Jack Ho. Book by Lynette Chiu, Alina Heng, and Raihan Halim. Directed by Yeo Lay Har and Sharon Tan. Music director Iris Koh, choreographed by Trevelyan Neo. Starring Inka Mader, Shawn Tok, Foo Fang Rong, Shraddha Ramsundar, Amni Mumpuni, and Rosalind d\u0027Almeida., 261822\u003dWizard of Oz, The (1939). [http://en.wikipedia.org/wiki/The_Wizard_of_Oz_(1939_film)]  Music: Harold Arlen, Lyrics: EY \u0027Yip\u0027 Harburg. :Film musical. Dorothy is caught in a Kansas tornado and mysteriously transported to a mythical place. She needs to find the Wizard of Oz to help her return home. On the way she meets  Scarecrow, Tinman, and the Cowardly Lion, who join her on the journey to the Emerald City. [http://us.imdb.com/title/tt0032138/trailers Movie Trailer2]   Woman in White, The (2004). [http://en.wikipedia.org/wiki/The_Woman_in_White_%28musical%29] [http://www.stageagent.com/shows.php?id\u003d1133] Music: Andrew Lloyd Webber, Lyrics: David Zippel, Book: Charlotte Jones. :Adaptation of Wilkie Collins? 1860 novel. Late at night, while on the way to Limmeridge House as a drawing instructor, Walter Hartright meets a mysterious woman in white and saves her from her pursuers. At the house, Walter falls in love with his niece, Laura, but she is already engaged to Sir Percival Glyde. [http://www.broadway.com/gen/Buzz_Video.aspx?ci\u003d521667 Broadway.com] [http://www.youtube.com/watch?v\u003dIrUYxVRBc7g\u0026search\u003dthe%20woman%20in%20white YouTube] [http://www.youtube.com/watch?v\u003dh4DQS3f07lo\u0026search\u003dWOMAN%20IN%20WHITE YouTube], 187317\u003dFollies (1971). [http://www.broadwaymusicalhome.com/shows/follies.htm] [http://www.musicaltheatreaudition.com/shows/follies.html] [http://www.musicalheaven.com/Detailed/1610.html] Music and lyrics: Stephen Sondheim. Book: James Goldman. :It takes place during a 30th anniversary reunion of ex-showgirls from the famous Follies revue. Many of them have married, and they reminisce and confront the ghosts of their past, and in so doing, solve their current unhappiness. [http://youtube.com/watch?v\u003dcxx0FMFVjiA Marin Mazzie], 185256\u003dFinian\u0027s Rainbow (1947). [http://www.musicalheaven.com/Detailed/1547.html] [http://www.musicaltheatreaudition.com/shows/finiansrainbow.html] Music: Burton Lane, Lyrics: EY \u0027Yip\u0027 Harburg, Book: EY \u0027Yip Harburg and Fred Saidy. :Political satire about Finian, who steals a pot of gold from Glocca Morra in Ireland, and brings it to America, pursued by Og, a leprechaun. There is a subplot about white racist senator who becomes black following an accidental invocation of one of the leprechaun\u0027s magic wishes. [http://videodetective.com/default.asp?frame\u003dhttp://videodetective.com/trailer-preview.asp?publishedId\u003d979641\u0026customerID\u003d97135 Movie Trailer], 317815\u003dRimland B \u0026 Fine D. Special talents of autistic savants. in The Exceptional Brain, New York, Guilford Press 1988., 106197\u003dAll in all, it is highly unlikely that there ever were lions in Singapore. Tigers, on the other hand, are indigenous to Southeast Asia, and the last wild tiger was observed in Singapore as late as the 13th August 1902., 259066\u003dWhere\u0027s Charley? (1948). [http://www.broadwaymusicalhome.com/shows/charley.htm] [http://www.musicaltheatreaudition.com/shows/wherescharley.html] Music and lyrics: Frank Loesser, Book: George Abbott. :Based on Brandon Thomas? 1892 farce, Charley?s Aunt. Charley and Jack are two undergraduates at Oxford University, and they need a chaperone in order to entertain two young ladies. Initially Charley?s aunt would serve as that role, but her visit is delayed, and so they persuade their friend, Lord Fancourt Babberly, to disguise himself as Charley?s aunt, and act as their chaperone instead. But this phoney aunt is also interested in the two girls., 99685\u003dBeauty World, which I saw successfully performed by TheatreWorks on June 5, may be the first Singaporean musical., 127306\u003d(from Patricia Ryan\u0027s \"Pat\u0027s Premises: Popular Plots, Conflicts and Elements in Romance Novels,\" Romance Writers\u0027 Report, 17(4), April 1997), 158325\u003dBaker\u0027s Wife (1976). [http://www.musicaltheatreaudition.com/shows/bakerswife.html] [http://www.musicalheaven.com/Detailed/929.html] Music and lyrics: Stephen Schwartz, Book: Joseph Stein. :Adaptation of the 1938 movie, La Femme Boulanger. Genevieve is the young wife of a French town\u0027s baker, who is older than her. She has an affair with Dominique, a young amorous villager. [http://www.youtube.com/watch?v\u003dJROrWTAkfXU YouTube], 233889\u003dRagtime (1998). [http://www.broadwaymusicalhome.com/shows/ragtime.htm] [http://www.musicaltheatreaudition.com/shows/ragtime.html] [http://www.musicalheaven.com/r/ragtime.shtml] Music: Stephen Flaherty, Lyrics: Lynn Ahrens, Book: Terrence McNally. :Sung-through musical adaptation of EL Doctorow?s novel. Coalhouse Walker, a Harlem musician wants to win back the affections of his former girlfriend Sarah, by buying a new Ford model T to impress her. One day, while on a leisure drive, he asks directions from a group of white firemen, who harass him, vandalizes and destroys his car. Unable to find justice, Coalhouse burns down fire stations, and to blow up JP Morgan?s library. [http://youtube.com/watch?v\u003dytueYx6HqVk YouTube1] [http://youtube.com/watch?v\u003dOIYL7KUhG-c YouTube2]     Rent (1996). [http://www.broadwaymusicalhome.com/shows/rent.htm] [http://www.musicaltheatreaudition.com/shows/rent.html]  Book, music, and lyrics: Jonathan Larson. :Inspired by Puccini?s La Boheme, this rock musical is about Roger and Mimi, both of whom suffer from Aids, and their bohemian friends living in Manhattan?s Lower East Side. [http://www.movie-list.com/trailers.php?id\u003drent Movie Trailer] [http://www.broadwayworld.com/videoinfo.cfm?showid\u003d24 Broadwayworld.com] [http://www.broadway.com/gen/Buzz_Video.aspx?ci\u003d529131 Broadway.com1] [http://www.broadway.com/gen/Buzz_Video.aspx?ci\u003d521510 Broadway.com2], 65075\u003dPlaywright: Raymond To Kwok-Wai Director: Goh Boon Teck Music Director: Philip Tan Choreographer: Jeffrey Tan Cast: William So, Mindee Ong, Emma Yong, Celine Rosa Tan, Oliver Pang, Daniel Jenkins, Darius Tan, Judy Tan, Chua Choon Hui, Gordon Choy 10 January 2008, 150742\u003d42nd Street (1980). [http://www.broadwaymusicalhome.com/shows/42nd.htm] [http://www.musicaltheatreaudition.com/shows/42ndstreet.html] Music: Harry Warren. Lyrics: Al Dubin. :Musical set during the 1933 Depression. Peggy Sawyer arrives late for an audition but is helped by a fellow actor to get into the chorus. When the leading has an accident, Peggy takes over her role, and becomes a star. [http://www.youtube.com/watch?v\u003dNw6QE1L_T80\u0026mode\u003drelated\u0026search\u003d YouTube], 227566\u003dPaint Your Wagon (1951). [http://www.broadwaymusicalhome.com/shows/paintwagon.htm] [http://www.musicaltheatreaudition.com/shows/paintyourwagon.html] Music: Frederick Loewe, Book and lyrics: Alan Jay Lerner. :Gold is found in Californian mining camp in 1853, and this creates a gold rush and a new town is born. There are 400 men, and Jennifer is the only woman. [http://videodetective.com/default.asp?frame\u003dhttp://videodetective.com/home.asp?PublishedID\u003d5048 Movie Trailer], 260465\u003dWild Party, The (Lippa) (2000). [http://www.broadwaymusicalhome.com/shows/lippawild.htm] [http://www.musicaltheatreaudition.com/shows/wildparty.html] Book, music, and lyrics: Andrew Lippa. :Musical adaptation of Joseph Moncure March\u0027s 1928 poem. Queenie and Burrs throw a party in their Manhattan apartment, but it gets out of hand, becoming violent. [http://youtube.com/watch?v\u003d3fzt46kjclc YouTube] [http://youtube.com/watch?v\u003dKxL-GBS8y6E Idina Menzel], 318064\u003dLyen KR et al. Creativity and education. Armour Publishing 1998., 176639\u003dColor Purple, The (2005). [http://www.broadwaymusicalhome.com/shows/colorpurple.htm] [http://www.musicalheaven.com/Detailed/1611.html] [http://www.musicaltheatreaudition.com/shows/colorpurple.htm] Music and lyrics: Brenda Russell, Allee Willis and Stephen Bray. Book: Marsha Norman. :Adapted from the film, the story centers on Celie, a black girl living in the rural South during the early part of the 20th century. She is made pregnant by her father, who subsequently takes away the baby for adoption. Later, Celie marries a farmer who is a cruel philanderer. Despite all her hardships and suffering, Celie rises above them, and her inner strength and courage embodies the triumph of the human spirit. [http://www.colorpurple.com/sightssounds.php# Video Featurette] [http://youtube.com/watch?v\u003d_sfGsWOqUQc\u0026mode\u003drelated\u0026search\u003d Tony?s] [http://www.broadwayworld.com/videoinfo.cfm?showid\u003d944 Broadwayworld.com] [http://www.broadway.com/gen/Buzz_Video.aspx?ci\u003d522177 Broadway.com1] [http://www.broadway.com/gen/show.aspx?SI\u003d514820 Broadway.com2] [http://www.broadway.com/Gen/Buzz_Video.aspx?ci\u003d540024 Broadway.com3]    Company (1970). [http://www.broadwaymusicalhome.com/shows/company.htm] [http://www.musicaltheatreaudition.com/shows/company.html] [http://www.musicalheaven.com/Detailed/985.html] Music and lyrics: Stephen Sondheim, Book: George Furth. :Concept musical with a nonlinear plot that revolves around Robert, a bachelor, who is being persuaded by five well-meaning friends, to consider settling down. [http://youtube.com/watch?v\u003dcbE_Y_9fMuU Patti Lupone] [http://www.broadwayworld.com/videoinfo.cfm?showid\u003d4200 Broadwayworld.com] [http://www.broadway.com/gen/Buzz_Video.aspx?ci\u003d541299 Broadway.com]   Contact (1999). [http://www.broadwaymusicalhome.com/shows/contact.htm] [http://www.imagi-nation.com/moonstruck/albm89.html] Creators: Susan Stroman and John Weidman. :Three short stories told through dance, containing no original music, no singing, and minimal dialogue. The first piece is about an attractive girl with two men vying for her attention; the second is about a timid woman  married to a controlling husband both having a meal in an Italian restaurant; and the third story is about a middle-aged suicidal man trying to get the attention of a girl in a yellow dress. [http://youtube.com/watch?v\u003dgzP2gi-eGRU Tony?s], 65956\u003dYou are invited to submit short musicals for FIVE FOOT BROADWAY MINI MUSICALS. The deadline for submission is 17 March 2008. Registration fee for the first 3 musicals submitted by Singaporeans waived. This is a new initiative inviting composers and writers to submit scripts for original musicals, lasting from 10 to 15 minutes. The invitation is for the general public, secondary schools and tertiary institutions. Says Stella Kon, Chairperson of Musical Theatre Limited, \"This will create a setting where new writers for the musical theatre can come together. Moreover, writing mini musicals is a great way to get beginners started in this craft. The Mini Musicals provide a testing ground to try out the collaboration of the creative team, in the complex task of bringing together the elements of story, music and lyrics.\" All submitted entries will be reviewed by a Selection Panel, and up to 6 of them will be presented in June 2008 at the Esplanade, in conjunction with the Singapore Festival of Arts 2008. (Please see http://musicaltheatrelimited.org for more details on the submission process)., 77451\u003dProduction Company: Musical Theatre Limited Date: 10 June 2007 Place: Esplanade Recital Studio Book and lyrics: Ng Yi-Sheng Composer: Clement Yang Music Arranger/Music Director: Chris Nolan Director: Lee Yew Moon Vocal Arranger/Vocal Director: Nicole Stinton Cast: Seong Hui Xuan, Eu Jin Hwang, CC Leong, Joyce Liang, Lena Lim, Claire Matthews, Marvelina Pratiwi Setiawan, Windson Liong, Les Merquita, Leonard Augustine Choo, Zarelda Marie Goh, 249051\u003dTarzan (2006). [http://www.broadwaymusicalhome.com/shows/tarzan.htm] [http://www.musicaltheatreaudition.com/shows/tarzan.html] Music and lyrics: Phil Collins, Book: David Henry Hwang. Shipwrecked in a pacific island, infant Tarzan and his parents are the only survivors. Not long after, his parents are killed by a leopard. Found by gorillas, Tarzan is brought up by them. Several years later, a ship arrives, bringing humans to the island. [http://disney.go.com/theatre/tarzan/theshow-video.html Video] [http://www.broadwayworld.com/videoinfo.cfm?showid\u003d1050 Broadwaryworld.com] [http://www.broadway.com/gen/Buzz_Video.aspx?ci\u003d529382 Broadway.com1] [http://www.broadway.com/gen/Buzz_Video.aspx?ci\u003d534020 Broadway.com2], 149647\u003d1776 (1969). [http://www.broadwaymusicalhome.com/shows/1776.htm] [http://www.musicaltheatreaudition.com/shows/1776.html] Music and lyrics: Sherman Edwards, Book: Peter Stone. :A musical comedy about the meeting of the founding fathers in 1776 leading up to the signing of the United States Declaration of Independence. [http://www.youtube.com/watch?v\u003dQvAoW7VVUCk YouTube] [http://www.videodetective.com/default.asp?frame\u003dhttp://www.videodetective.com/trailer-preview.asp?publishedid\u003d526374 Movie Trailer], 200432\u003dJekyll and Hyde (1997). [http://www.broadwaymusicalhome.com/shows/jekyllhyde.htm] [http://www.musicaltheatreaudition.com/shows/jeckylhyde.html] Music: Frank Wildhorn, Book and lyrics: Leslie Bricusse. :Based on the novel by Robert Louis Stevenson, it concerns the brilliant Dr Jekyll, who conducts an experiment on himself, and creates his evil alter ego, Mr Hyde. [http://youtube.com/watch?v\u003d9KiX2Wgo7hg Anthony Warlow] [http://youtube.com/watch?v\u003dR1_JQUy3Dq4\u0026mode\u003drelated\u0026search\u003d Linda Eder] [http://www.broadwayonline.com/ BroadwayOnline]        Jersey Boys (2005). [http://www.broadwaymusicalhome.com/shows/jersey.htm] [http://www.musicaltheatreaudition.com/shows/jerseyboys.html]  Music: Bob Gaudio, Lyrics: Bob Crewe, Book: Marshall Brickman and Rick Elice. Jukebox musical about Franki Valli and the Four Seasons, four blue-collar boys who go from rags to riches. [http://youtube.com/watch?v\u003dWM4fMmMq1S0 Tony?s] [http://www.broadwayworld.com/videoinfo.cfm?showid\u003d954 Broadwayworld.com] [http://www.broadway.com/gen/Buzz_Video.aspx?ci\u003d520911 Broadway.com1] [http://www.broadway.com/gen/Buzz_Video.aspx?ci\u003d532752 Broadway.com2]   Jesus Christ Superstar (1971). [http://www.broadwaymusicalhome.com/shows/jesuschrist.htm] [http://www.musicaltheatreaudition.com/shows/jesusuperstar.htm] Music: Andrew Lloyd Webber, Book and lyrics: Tim Rice. :Rock opera retelling of the life of Jesus seen through the eyes of Judas Iscariot. [http://www.reallyuseful.com/rug/shows/jesus/music/video.htm Video] [http://youtube.com/watch?v\u003d7bA_J0vSNEs\u0026mode\u003drelated\u0026search\u003d Tony?s] [http://www.videodetective.com/default.asp?frame\u003dhttp://www.videodetective.com/trailer-preview.asp?publishedId\u003d837200\u0026customerID\u003d97135 2000 Movie Trailer1] [http://youtube.com/watch?v\u003dZi1WhdcsVoU 1973 Movie Trailer2] [http://us.imdb.com/title/tt0070239/trailers Movie Trailer3], 180915\u003dDreamgirls (1981). [http://www.broadwaymusicalhome.com/shows/dreamgirls.htm] [http://www.musicaltheatreaudition.com/shows/dreamgirls.html] Music: Henry Krieger Tom Eyen. book Bennett. Story of a black singing group inspired by The Supremes. Lead singer Efie White relinquishes the spotlight to allow a more attractive colleague to take over. Later, Effie leaves the group and becomes her own star. [http://www.movie-list.com/trailers.php?id\u003ddreamgirls Movie Trailer1] [http://www.ifilm.com/video/2781830 Movie Trailer2] [http://us.imdb.com/title/tt0443489/trailers Movie Trailer3], 304005\u003dSrinivasa Ramanujan, 186408\u003dFlora the Red Menace (1965). [http://www.broadwaymusicalhome.com/shows/flora.htm] [http://www.musicalheaven.com/Detailed/1555.html] Music: John Kander, Lyrics: Fred Ebb, Book: George Abbott and Robert Russell. Set in the 1930s Depression, it is a story of Flora, a naive young girl, who joins the Communist party purely because of love for her boyfriend., 104037\u003d[Robert Yeo has been Chairman of the Drama Advisory Committee, Ministry of Community Development, for the past 10 years. His play, One Year Back Home, was given a stage at La Mama, New York, in 1985. Another play, Second Chance, was produced in Hongkong and Singapore late last year and early this year.], 187900\u003dFootloose (1998). [http://www.broadwaymusicalhome.com/shows/footloose.htm] [http://www.musicaltheatreaudition.com/shows/footloose.html] Creators: Dean Pitchford, Tom Snow, Walter Bobbie, and Kenny Loggins. :Based on the 1984 movie, about Ren, a city boy who moves back to a backwater town in rural America, where dancing is banned. [http://videodetective.com/default.asp?frame\u003dhttp://videodetective.com/home.asp?PublishedID\u003d2974 Movie Trailer], 315718\u003dLyen KR et al. The education of highly creative people. Armour Publishing 1998., 257000\u003dVictor/Victoria (1995). [http://www.broadwaymusicalhome.com/shows/victor.htm] [http://www.musicaltheatreaudition.com/shows/victorvictoria.html] Music: Henry Mancini and Frank Wildhorn, Lyrics: Leslie Bricusse, Book: Blake Edwards. :Based on the 1982 film, it is about Victoria Grant, who is unable to find work. Her friend suggests that she might secure a job as female impersonator in a nightclub, by posing as a man pretending to be a woman. [http://www.whvdirect.com/trailers/victor_victoria Movie Trailer] [http://youtube.com/watch?v\u003dtdwNoqFUGik YouTube], 213393\u003dLord of the Rings (2006). [http://www.lotr.com/] Music: Varttina and AR Rahman, Book and lyrics: Matthew Warchus and Shaun McKenna. :Musical stage adaptation of JRR Tolkien?s Lord of the Rings. [http://www.broadway.com/gen/Buzz_Video.aspx?ci\u003d522858 Broadway.com] [http://www.youtube.com/watch?v\u003d2ngg7wcbwEU YouTube]  , 316158\u003dMattis S. Dyslexia syndromes: a working hypothesis. In Dyslexia, edited by A L Benton and D Pearl. New York: Oxford University Press, 1978., 237389\u003dScarlet Pimpernel, The (1997). [http://www.broadwaymusicalhome.com/shows/pimp.htm] [http://www.musicaltheatreaudition.com/shows/scarletpimp.html] [http://www.ronbohmer.com/sp.html] Music: Frank Wildhorn, Lyrics: Nan Knighton. :Based on Baroness Orczy?s 1905 novel. Set during the Reign of Terror of the French Revolution, Sir Percy Blakeney, a rich English aristocrat, discovers that his newly married beautiful French actress Marguerite St. Just, has betrayed his friend to the Revolutionary Government, leading to his guillotine. To avenge his friend, Sir Percy disguises himself as the Scarlet Pimpernel, and rescues many innocent lives. French agent Chauvelin is instructed to seek and destroy the Scarlet Pimpernel and his followers. [http://youtube.com/watch?v\u003dvT5UQV8d4UQ YouTube]   Secret Garden, The (1991). [http://www.broadwaymusicalhome.com/shows/secretgarden.htm] [http://www.musicaltheatreaudition.com/shows/secretgarden.html]  Music: Lucy Simon, Lyrics: Marsha Norman. :Based on Frances Hodgson Burnett?s novel, orphaned Mary Lennox returns to England to stay with her uncle Archibald, a depressed widower, who has a sickly bedridden 10-year-old son. Discovery of a secret garden restores love and happiness to the household. [http://youtube.com/watch?v\u003dLubqFxh2SWY YouTube1] [http://youtube.com/watch?v\u003dPTQ58NjrkhA YouTube2], 208031\u003dLennon (2005). [http://en.wikipedia.org/wiki/Lennon_(musical)] [http://theater.about.com/od/broadwaymusicals/p/Lennon.htm] Music and lyrics: John Lennon, Book : Don Scardino. :Jukebox musical biography of John Lennon?s life using his own words and songs. [http://www.broadway.com/gen/Buzz_Video.aspx?ci\u003d516583 Broadway.com]     Les Miserables (1980). [http://www.broadwaymusicalhome.com/shows/lesmis.htm] [http://www.musicaltheatreaudition.com/shows/lesmis.html] Music and book: Claude-Michel Schonberg and Alain Boublil, English lyrics: Herbert Kretzmer. :An adaptation of Victor Hugo?s novel. Jean Valjean, condemned to 19 years? hard labor for stealing a loaf of bread, breaks parole, only to be pursued by obsessional police inspector Javert. Valjean joins the doomed 1832 student uprising in Paris and saves the life of Marius, who is in love with his adopted daughter, Cosette. [http://www.lesmis.com/pages/sights_sounds/video.htm Videos] [http://youtube.com/watch?v\u003dM1JO4p1FElw Lea Salonga] [http://www.broadwayworld.com/videoinfo.cfm?showid\u003d2357 Broadwayworld.com] [http://www.broadway.com/gen/Buzz_Video.aspx?ci\u003d542121 Broadway.com] [http://www.theatre.com/video/id/3004586 Theatre.com], 244310\u003dSpring Awakening (2006). [http://www.springawakening.com/] [http://www.newyorktheatreguide.com/reviews/springawakening106.htm] Music: Duncan Sheik, Lyrics: Steven Sater. :Based on Frank Wedekind?s play, and set in Germany of 1891. This is a coming of age story of Melchior, who learns about love when he meets Wendla in the woods. His friend Moritz commits suicide because of academic failure, and Melchior is blamed for it, leading to his expulsion from school. [http://www.broadwayworld.com/videoinfo.cfm?showid\u003d4203 Broadwayworld.com] [http://www.broadway.com/Gen/Show.aspx?si\u003d530146# Broadway.com1] [http://www.broadway.com/gen/Buzz_Video.aspx?ci\u003d538599 Broadway.com2], 179722\u003dDirty Dancing (2006). [http://www.dirtydancing.com.au/] Music and lyrics: Various, Book: Eleanor Bergstein. :Based on the 1987 movie, this coming of age story is about Baby Houseman who is forced to spend her vacation with her parents in a holiday resort. Initially bored, she discovers a group of young people who devote their free time dancing, and she falls in love with a sexy dance instructor. [http://www.theatre.com/video/id/3004768 Theatre.com]    Dirty Rotten Scoundrels (2004). [http://www.broadwaymusicalhome.com/shows/dirty.htm] [http://www.musicaltheatreaudition.com/shows/dirtyrottenscoundrels.html] Music and lyrics: David Yazbek, Book: Jeffrey Lane. :Based on the 1988 film, it is about 2 con men on the French Riviera placing a bet with each other, that the first to swindle a young heiress of $50,000 will win, and the loser would have to leave town. [http://youtube.com/watch?v\u003d04uNN7yMwMY\u0026mode\u003drelated\u0026search\u003d Tony?s] [http://www.broadway.com/gen/Buzz_Video.aspx?ci\u003d526169 Broadway.com1] [http://www.broadway.com/gen/Buzz_Video.aspx?ci\u003d512808 Broadway.com2], 215272\u003dMame (1966) [http://www.broadwaymusicalhome.com/shows/mame.htm] [http://www.musicaltheatreaudition.com/shows/mame.html] Music and lyrics: Jerry Herman, Book: Robert E Lee and Jerome Lawrence. :Mame is one kookie aunt who attempts to pass on her unconventional lifestyle and philosophy to her orphaned nephew. The 1929 Wall Street Crash leaves her with financial difficulties, which she overcomes when is marries a wealthy ex-client. [http://youtube.com/watch?v\u003dubDADcbS62U Marilyn Horne \u0026 Frederica von Stade], 314275\u003dLudwig AM. The price of greatness. Guilford Press 1996., 65749\u003dFive Foot Broadway Mini Musicals 2008 http://musicaltheatrelimited.org/, 318951\u003dFitzgerald M: Autism and Creativity. Routledge 2004., 320916\u003dGeorge Seurat started painting Un Dimanche ? la Grande Jatte in 1884 at the age of 25 years, and finished it two years later. He employed the theory of colors, and by juxtaposing tiny dots of color, he could painstakingly create an entire picture. This technique was known as \"pointillisme.\" The painting caused quite a stir when it was first exhibited in Paris. Viewers sneered at it, calling it \"bedlam,\" \"a scandal,\" and \"hilarity.\" That was 120 years ago. It is now considered one of the finest post-impressionist works., 95826\u003dThe Rise of Singapore?s New Creative Class: Beat-by-Beat by Leong Phei Phei, The Straits Times, August 9, 2007, 100139\u003dThe second belongs to the history of attempts to put up musicals in the Festival of Arts, of which there were two, The Samseng and the Chettiar?s Daughter, and Bumboat, in the 1982 and 1984 Festivals respectively., 265288\u003d2nd January 2007, 196840\u003dHigh Society (1998). [http://www.broadwaymusicalhome.com/shows/highsoc.htm] [http://www.musicaltheatreaudition.com/shows/highsociety.html] [http://www.musicalheaven.com/h/high_society.shtml] Music and lyrics: Cole Porter, Book: Arthur Kopit. ::Based on the 1940 film Philadelphia Story and the 1956 film High Society. Tracy Lord, a wealthy socialite, is planning to marry her second husband, when her first husband, Dexter Haven, plans to upset proceedings. In the meantime, a magazine reporter sent to cover the story also falls in love with Tracy. [http://videodetective.com/default.asp?frame\u003dhttp://videodetective.com/home.asp?PublishedID\u003d218 Movie Trailer], 183330\u003dFame (1988). [http://www.broadwaymusicalhome.com/shows/fame.htm] [http://www.musicaltheatreaudition.com/shows/fame.html] [http://www.musicalheaven.com/Detailed/1370.html] Music: Steve Margoshes, Lyrics: Jacques Levy, Book: Jose Fernandez. :Based on the movie, Fame is set in New York City\u0027s famous High School for Performing Arts. It follows a batch of new students, portraying their highs and lows, their romances, their sorrows, and triumphs. [http://www.famenetwork.com/video.php], 248650\u003dTaboo (2002). [http://www.broadwaymusicalhome.com/shows/taboo.htm] [http://www.cnn.com/2004/SHOWBIZ/Music/01/14/theater.tabooclosing.ap/] Music and lyrics: Boy George, Kevan Frost, John Themis, and Richie Stevens, Book: Charles Busch. :Set in 1980s London, it follows the life of a pop star. [http://www.btinternet.com/~s.essom/taboovideo.htm Videos], 171002\u003dCaroline or Change (2004). [http://www.broadwaymusicalhome.com/shows/caroline.htm] [http://www.musicaltheatreaudition.com/shows/carolineorchange.html] Music: Jeanine Tesori, Book and lyrics: Tony Kushner. :A sung-though musical engaging in racial and social issues in Louisiana in 1963 during the height of the Civil Rights movement. It is about Caroline is a 39-year-old black woman, who works as a maid in a white Jewish household in Lousiana in 1963. She is persuaded to take the change left in the young white boy?s discarded trouser pocket, but this has tumultuous consequences. [http://video.google.com/videoplay?docid\u003d-5420612676897816496\u0026q\u003dcaroline+or+change\u0026hl\u003den Tonya Pinkins], 72283\u003dThe Media Development Authority (MDA) is a special subset of the civil service, and is responsible for nurturing the creative industries in Singapore. In other words they are trying to convert Singapore from a left brain to a right brain nation. Unfortunately, the term \"creative civil servant\" is regarded as an oxymoron. Thus, the senior civil servants in the MDA have decided to dispel their public image as unimaginative dullards, by performing a rap. A rap? You?re joking? No, they wrote an original rap song, danced to it, and filmed it. Serious. And some kind soul posted it on YouTube: http://au.youtube.com/watch?v\u003dksw2UqTyhhc They did not realize that they had exposed themselves to Jonathan Lim. Poor devils. Jonathan used back their own weapon, a rap, and unleashed a torrent of word bullets, scoring hit upon hit on these sitting ducks. Bang! Bang! Quack! Quack! Flush with victory, Jonathan, an experienced serial killer, brandishes his satirical guns (real guns are banned in Singapore), and goes on his annual rampage, shooting the pompous and the arrogant with verbal chestnuts. Indeed Jonathan is so successful, that some people liken him to a literary terrorist. It is rumored that Michael Moore may be preparing a documentary called \"Dicko\", named after Jonathan?s favorite target. No relation to the other Lee family, which he also takes pot shots at. He takes potter shots at JK Rowling. And he confuses poor Sir Ian who drifts from Gandalf, to Magneto, Dumbledore, King Lear, and to Sarin. Jonathan is at his best when he tackles Beauty World. At a fraction of the cost, he is able to densely populate the stage with six performers, and keep you in stitches throughout. So much so that you cannot even enjoy a nice nap. I especially like his skits on the Pirates of the Caribbean, Greased Lightner, Chitty Chitty Bang Bang, If There?re Reasons, and 881251. I like the comment on the President?s Star Charity, which precipitated a bout of raucous laughter. It is a madcap evening. Jokes arrive wave after wave, like a perpetual tsunami. You barely survive one wave, when another one comes and knocks you down. You are sinking into this torrent of intelligent subversion, and your mind drowns in a sea of parody. But... we have a problem, Houston. The first problem is that in order to best appreciate the jokes, you need to have seen all the films, plays and musicals referred to. In other words, to derive full value for money when watching Chestnuts, you need to do your homework. I have a suggestion for Jonathan. Please give us advance notice as to which movies, plays and musicals to watch. Or perhaps you can run a pre-show educational course, plus a post-show course, where you can slowly explain all the jokes to dimwitted people like myself. Better still, please provide us with lecture notes followed by a test, so we can see if our score improves from year to year. A Diploma awarded by the Academy of Chestnuts would be a bonus. The second problem is that the projected English translation of skits in Chinese, is almost unreadable. Hence most of the jokes are lost. I was sandwiched on all sides by non-Singaporeans, and they did not laugh at the Chinese-language skits. Jonathan, you may have to think of some way to translate the jokes into English auditorily, and not rely on the projections. Chestnuts has grown from a 2-man show to a 6-person show. Jonathan shares the stage with Judy Ngo, Rodney Oliveiro, Celine Rosa Tan, Yeo Yann Yann, and Joakim Gomez. All are brilliant and have perfect comic timing. The music arrangement by Bang Wenfu is just out of this world. Production values are getting better and better. Thanks to Adrian Tan. Chestnuts is an institution. I think that all Singaporeans should go and watch this year?s Chesty Nutty Bang Bang. Have a really good laugh. Laugh at authority. Laugh at others. Laugh at yourself. \"We are not amused.\" - Queen Victoria., 181546\u003dDrowsy Chaperone, The (2006).  [http://www.broadwaymusicalhome.com/shows/drowsychaperone.htm] [http://www.musicaltheatreaudition.com/shows/drowsychaperone.html] Music and lyrics: Lisa Lambert and Greg Morrison, Book: Bob Martin and Don McKellar. :While listening to a record of a fictitious 1920s-style musical called The Drowsy Chaperone, the show suddenly comes to life right in the listener?s apartment. [http://www.youtube.com/watch?v\u003dh0stOiGy0cE Trailer] [http://www.broadwayworld.com/videoinfo.cfm?showid\u003d2321 Broadwayworld.com] [http://www.broadway.com/gen/Buzz_Video.aspx?ci\u003d529136 Broadway.com1] [http://www.broadway.com/gen/Buzz_Video.aspx?ci\u003d530474 Broadway.com2]   \u003d\u003d\u003d[E]\u003d\u003d\u003d, 203934\u003dKismet (1953). [http://www.reference.com/browse/wiki/Kismet_(musical)]  [http://www.musicalheaven.com/k/kismet.shtml] Music: Alexander Borodin, Lyrics: Goerge Forrest and Robert Wright, Book: Charles Lederer and Luther Davis. :Set in the Arabian Nights, a public poet assumes the identity of a beggar, Hajj, and through a series of cons, curses, and mistaken identities, he becomes appointed Emir of Baghdad. He runs off with the beautiful Lalume, after getting rid of her husband, the wicked Wazir. [http://youtube.com/watch?v\u003detGHmduZQyw Johnny Mathis] [http://www.videodetective.com/default.asp?frame\u003dhttp://www.videodetective.com/trailer-preview.asp?customerid\u003d97135\u0026publishedID\u003d2093 Movie Trailer], 195660\u003dHigh Fidelity (2006). [http://www.topfivebreakups.com/] [http://www.guardian.co.uk/usa/story/0,,1971549,00.html] Music Tom Kitt, Lyrics: Amanda Green, Book: David Lindsay-Abaire. :Adaptation of the Nick Hornby novel and 2000 film, this romantic comedy is set in New York, and is about a record-store owner who, when rejected yet again by another girlfriend, revisits his former relationships to ascertain where he went wrong. [http://www.broadway.com/gen/Buzz_Video.aspx?ci\u003d541640 Broadway.com], 220315\u003dMovin\u0027 Out (2002). [http://www.broadwaymusicalhome.com/shows/movinout.htm] [http://wiki.stageagent.com/more_show_info.php?id\u003d1094] Music and lyrics: Billy Joel, Choreography: Twyla Tharp. :Jukebox dance musical concerning five childhood friends who are affected by the Vietnam War. One of them is killed in Vietnam, another turns to drugs, and a third cannot establish a loving relationship. [http://movingout.uvision.net/tour_feb/index.html#firstDRUM Trailer] [http://www.theatre.com/video/id/3002310 Theatre.com], 222716\u003dNine (1963). [http://www.broadwaymusicalhome.com/shows/nine.htm] [http://www.musicaltheatreaudition.com/shows/nine.html]  Music and lyrics: Maury Yeston, Book: Arthur Kopit. :An adaptation of Frederico Fellini?s 1963 film, Eight and a Half. Movie director Guido Contini goes to a Venetian spa to rest, and to get away from his wife, his mistress, his mother, his producer, and his protege, all of whom he recalls as a series of flashbacks. [http://www.youtube.com/watch?v\u003diCwHkuXGGmA\u0026mode\u003drelated\u0026search\u003d YouTube], 183859\u003dFantasticks (1960). [http://www.broadwaymusicalhome.com/shows/fantasticks.htm] [http://www.musicaltheatreaudition.com/shows/fantasticks.html] [http://www.musicalheaven.com/Detailed/1505.html] Music: Harvey Schmidt, Book and lyrics: Tom Jones. :Longest running off-Broadway stage musical. Two neighbours use reverse psychology to help their respective offspring come to a romantic union. [http://youtube.com/watch?v\u003dhuUmENpJ8p4\u0026mode\u003drelated\u0026search\u003d Jerry Orbach] [http://www.videodetective.com/default.asp?frame\u003dhttp://www.videodetective.com/trailer-preview.asp?customerid\u003d97135\u0026publishedID\u003d516212 Movie Trailer] [http://www.broadway.com/gen/Buzz_Video.aspx?ci\u003d541904 Broadway.com]       Fiddler on the Roof (1964). [http://www.broadwaymusicalhome.com/shows/fiddler.htm] [http://www.musicaltheatreaudition.com/shows/fiddler.html]  [http://www.musicalheaven.com/Detailed/1509.html] Music: Jerry Bock, Lyrics: Sheldon Harnick, Book: Joseph Stein. :Set in rural Tzarist Russia during the early years of the 20th century with the escalating threat of anti-Semitism, it follows Tevye, a Jewish milkman, who wants his 5 daughters to get happily married. [http://youtube.com/watch?v\u003dWb_ztw6pVhg Tony?s] [http://www.ifilm.com/ifilmdetail/2316079 Movie Trailer], 225147\u003dOn a Clear Day You Can See Forever (1965.) [http://www.broadwaymusicalhome.com/shows/clear.htm] [http://www.musicaltheatreaudition.com/shows/onaclearday.html] Music: Burton Lane, Book and lyrics: Alan Jay Lerner. :Daisy asks Dr. Brockner to hypnotize her to quit smoking, but instead, she finds that she has the incredible talent to remember past lives, like the 18th Century Melinda Wells. [http://youtube.com/watch?v\u003doZP66focZTc Shirley Bassey], 236583\u003dSaturday Night Fever (1999). [http://www.broadwaymusicalhome.com/shows/fever.htm] [http://www.musicaltheatreaudition.com/shows/saturdaynightfever.html] [http://www.nodanw.com/shows_s/index.htm] Music and lyrics: Bee Gees, Book: Nik Cohn :Adaptation of the 1977 film. Tony Manero, a troubled youth working in a dead end job, escapes into a world of disco music. He enters a competition hoping to become king of disco dancing. [http://film.virgin.net/synopsis/synopsis.asp?filmid\u003d3181\u0026sec\u003dsyn\u0026pgtitle\u003dmovietrailersarchive Movie Trailer1] [http://www.videodetective.com/default.asp?frame\u003dhttp://www.videodetective.com/trailer-preview.asp?customerid\u003d97135\u0026publishedID\u003d1537 Movie Trailer2] [http://youtube.com/watch?v\u003dspBUUoBDS2I YouTube], 190063\u003dGodspell (1971). [http://www.broadwaymusicalhome.com/shows/godspell.htm] [http://www.musicaltheatreaudition.com/shows/godspell.html] [http://www.musicalheaven.com/Detailed/1778.html] Music and lyrics: Stephen Schwartz. :Set in contemporary New York, it is a modern retelling of the Gospel according to St Matthew. [http://videodetective.com/default.asp?frame\u003dhttp://videodetective.com/trailer-preview.asp?customerid\u003d97135\u0026publishedID\u003d890360 Movie Trailer1] [http://www.rogersvideo.ca/movie.asp?mid\u003d2860# Movie Trailer2]    Grease (1972). [http://www.broadwaymusicalhome.com/shows/grease.htm] [http://www.musicaltheatreaudition.com/shows/grease.html] Music and lyrics: Barry Gibb, John Farrar. :Set in the rock and roll era of the 1950s, it follows the story of innocent Sandy Dumbrowski, and macho Danny Zuko who, after a brief summer romance, unexpectedly reunite in their high school. [http://www.videodetective.com/default.asp?frame\u003dhttp://www.videodetective.com/trailer-preview.asp?customerid\u003d97135\u0026publishedid\u003d720 Movie Trailer1] [http://www.movie-list.com/g/grease.shtml Movie Trailer2] [http://www.nbc.com/Grease/ NBC], 315092\u003dJamison KR. Touched with fire: manic-depressive illness and the artistic temperament. Free Press 1993., 155159\u003dApple Tree, The (1966). [http://www.answers.com/topic/the-apple-tree-musical] [http://en.wikipedia.org/wiki/The_Apple_Tree] Music: Jerry Bock, Lyrics: Sheldon Harnick, Book: Jerry Bock and Sheldon Harnick. :Concept musical with three stories whose three main characters are the equivalent of Adam, Eve, and the serpent, and the unifying theme is that of leaving paradise. [http://www.broadway.com/gen/Buzz_Video.aspx?ci\u003d541960 Broadway.com] [http://www.broadwayworld.com/videoinfo.cfm?showid\u003d4199 Broadwayworld.com], 315534\u003dGutin JA. That fine madness. Discover Magazine 1996., 232855\u003dPorgy and Bess (1935). Music: George Gershwin, Lyrics: Ira Gershwin and duBose Heyward, Book: duBose Heyward. Opera based on duBose Heward?s novel, the story is about Porgy, a crippled beggar and the seductive Bess. [http://www.theatre.com/video/id/3004963 Theatre.com]   Producers, The (2001). [http://www.broadwaymusicalhome.com/shows/producers.htm] [http://www.musicaltheatreaudition.com/shows/producers.html] Music and lyrics: Mel Brooks, Book: Thomas Meehan and Mel Brooks. :Adaptation from the 1960 film, Max Bialystock, the worst Broadway producer, is told by his accountant Leo Bloom that he could make more money from a flop show than a successful one. Together they set out to produce the biggest flop. [http://sonypictures.co.uk/movies/theproducers/ Movie Trailer1] [http://www.movie-list.com/trailers.php?id\u003dproducers Movie Trailer2] [http://www.broadwayworld.com/videoinfo.cfm?showid\u003d23 Broadwayworld.com], 212820\u003dLittle Shop of Horrors (1982). [http://www.broadwaymusicalhome.com/shows/shophorrors.htm] [http://www.musicaltheatreaudition.com/shows/littleshophorrors.html] Music: Alan Menken, Book and lyrics: Howard Ashman. : Based on the film, this campy musical with an offbeat humor is about Seymour, a sales assistant at Mushnick?s flower shop, who brings a weird plant to work, but it turns out to be a man-eating monster. [http://videodetective.com/default.asp?frame\u003dhttp://videodetective.com/home.asp?PublishedID\u003d2188 Movie Trailer], 223931\u003dOklahoma! (1943). [http://www.broadwaymusicalhome.com/shows/oklahoma.htm] [http://www.musicaltheatreaudition.com/shows/oklahoma.html] Music: Richard Rodgers, Book and lyrics: Oscar Hammerstein II. :Based on Lynn Rigg?s 1931 play Green Grow the Lilacs. Two ranch hands, Curly and Judd Fry, have eyes for the same girl, Laurey. She actually prefers the handsome Curly, but to make him jealous, she flirts with Jud. [http://www.videodetective.com/default.asp?frame\u003dhttp://www.videodetective.com/trailer-preview.asp?customerid\u003d97135\u0026publishedID\u003d2868 Movie Trailer] [http://youtube.com/watch?v\u003djMoOusco5uA\u0026mode\u003drelated\u0026search\u003d Michael Ball \u0026 Barbara Cook], 214301\u003dMack and Mabel (1974). [http://www.musicalheaven.com/m/mack__mabel.shtml] [http://www.stageagent.com/shows.php?id\u003d1084] Music and lyrics: Jerry Herman, Book: Michael Stewart. Film director, Mack Sennett, recalls the days of the silent movies, and the occasion when a girl, Mabel Normand, accidentally enters the stage trying to obtain money for the sandwich she has delivered, when her performance is filmed. Mack and Mabel fall in love, but they separate and reunite several times over the years. [http://youtube.com/watch?v\u003dYgSATgDjoJA Michael Ball \u0026 Ruthie Henshall] [http://www.theatre.com/video/id/3001963 Theatre.com], 175174\u003dChorus Line, A (1975). [http://www.broadwaymusicalhome.com/shows/chorus.htm] [http://www.musicalheaven.com/Detailed/967.html] [http://www.musicaltheatreaudition.com/shows/achorusline.html] Music: Marvin Hamlisch, Lyrics: Ed Kleban, Book: James Kirkwood and Nicholas Dante. :A group of chorus dancers audition for a show, and tell about themselves one by one. [http://youtube.com/watch?v\u003dfT7Sl2K9CEs Nightline] [http://www.broadwayworld.com/videoinfo.cfm?showid\u003d2981 Broadwayworld.com] [http://www.broadway.com/gen/Buzz_Video.aspx?ci\u003d538281 Broadway.com1] [http://www.broadway.com/gen/Buzz_Video.aspx?ci\u003d535563 Broadway.com2] [http://www.broadway.com/gen/Buzz_Video.aspx?ci\u003d528201 Broadway.com3]   Cinderella (1957). [http://www.broadwaymusicalhome.com/shows/cinderella.htm] [http://www.musicaltheatreaudition.com/shows/cinderella.html] Music: Richard Rodgers, Lyrics: Oscar Hammerstein II. :Made-for-television musical of the fairy tale. [http://youtube.com/watch?v\u003dDzp4UJnzhm4 Whitney Houston], 250353\u003dThoroughly Modern Millie (2002). [http://www.nodanw.com/shows_t/thoroughlymillie.htm] [http://www.broadwaymusicalhome.com/shows/modmil.htm] [http://www.musicaltheatreaudition.com/shows/thoroughlymodern.html] Music: Jeanine Tesori, Lyrics: Dick Scanlan, Book: Morris and Dick Scanlan. :Adaptation of the 1967 movie. Millie Dillmont arrives in New York, coming from rural Kansas, finding a job and a husband. She forms a list of potential employers who, with a bit of luck, will also fall in love with her and become her husband. However, the person who loves her is the young handsome but not wealthy. [http://youtube.com/watch?v\u003d1GVVpzTNEpA\u0026mode\u003drelated\u0026search\u003d YouTube] , 166509\u003dBugsy Malone (1984). [http://www.toacorn.com/news/2006/0921/Dining_And_Entertainment/062.html] [http://www.musicalheaven.com/Detailed/611.html] Music and lyrics: Paul Williams, Book: Alan Parker. :Gangster spoof where the entire cast is played by children. Adapted from the 1976 movie. [http://www.youtube.com/watch?v\u003dNOrgDbldcA4 YouTube], 257648\u003dWedding Singer, The (2006). [http://www.broadwaymusicalhome.com/shows/weddingsinger.htm] [http://www.musicaltheatreaudition.com/shows/weddingsinger.html] Music: Matthew Sklar, Lyrics: Chad Beguelin, Book: Chad Beguelin and Tim Herlihy :Adapted from the 1998 film. Robbie, a wedding singer, and Julia, a waitress, are both engaged to be married to the wrong persons. Then they discover each other. [http://www.broadway.com/gen/Buzz_Video.aspx?ci\u003d528700 Broadway.com1] [http://www.broadway.com/gen/Buzz_Video.aspx?ci\u003d536054 Broadway.com2] [http://youtube.com/watch?v\u003dJKboiPjSr18\u0026mode\u003drelated\u0026search\u003d Tony?s]   West Side Story (1957). [http://www.broadwaymusicalhome.com/shows/westside.htm] [http://www.musicaltheatreaudition.com/shows/westsidestory.html] Music: Leonard Bernstein, Lyrics: Stephen Sondheim, Book: Arthur Laurents. :Retelling of Shakespeare\u0027s Romeo and Juliet, set in New York. Maria, a Puerto Rican girl, falls in love with Tony, a white American. Unfortunately they belong to rival gangs, and their well-meaning attempts to stop the violence between the gangs end up tragically. [http://www.videodetective.com/default.asp?frame\u003dhttp://www.videodetective.com/trailer-preview.asp?customerid\u003d97135\u0026publishedID\u003d474 Movie Trailer] [http://www.ifilm.com/video/2672371 Movie Trailer2], 318260\u003dEysenck JJ.  Genius : The Natural History of Creativity. Cambridge Univ Press 1995, 241273\u003dSingin? in the Rain (1983). [http://www.stageagent.com/shows.php?id\u003d1139] [http://www.musicalheaven.com/s/singin_in_the_rain.shtml] Music: Nacio Herb Brown, Lyrics: Arthur Freed, Book: Betty Comden and Adolph Green. :Based on the 1952 film musical. Lina Lamont is a star of the silent movies, but when the studio converts to sound, her high-pitched grating voice becomes a handicap. The film studio hires an overdub artist, and when leading man Don Lockwood falls in love with her, Lina becomes jealous. [http://www.ifilm.com/video/2672755/channel/movies Movie Trailer] [http://trailers.warnerbros.com/web/play.jsp?trailer\u003dsingin_in_the_rain_trailer Movie Trailer], 95439\u003d21 September 2007, 324878\u003d[Published in BlogCritics http://blogcritics.org/archives/2004/09/06/131253.php]}","lastModified":"","textBeforeTable":"              Arnold Ludwig studied a sample of 59 female writers attending a Women Writers Conference and found that psychiatric problems were higher in writers compared with non-writers:   Kay Redfield Jamison in 1989 studied 47 distinguished British writers and visual artists, and found that 38% of them had been previously treated for a mood disorder, including bipolar disorder, which compares with less than 15% of the British general population.   Fortunately, there are a few studies of contemporary artists, writers and musicians. In 1974, Nancy Andreasen from the University of Iowa studied 30 faculty members attending a writers? workshop and matched them with 30 controls. She found that 80% of participating writers suffered from depression or bipolar disorder, compared to 30% of her controls.   a) Studying Creative Individuals Eminent historical individuals have been studied by researching their biographies to see what percentage of them have psychiatric illnesses. In 1949, Adele Juda investigated 113 German artists, architects, composers","textAfterTable":"Brian Josephson Predicted the Josephson effect 22 James Hillier Developed the electron microscope 22 Isaac Newton Calculus, principles of optics, elements of circular motion inverse square law of gravity 23 Louis Parker Invented a low frequency receiver for radio waves 23 Srinivasa Ramanujan Published his first mathematical papers 24 Satyendra Bose Published is first statistical mechanics papers 24 Paul Dirac Quantum mechanics for motion of atomic particles 24 Richard Feynman Published his theory of electromagnetic waves 24 Walt Disney Drew his first animated cartoon 24 Max Perutz","hasKeyColumn":true,"keyColumnIndex":0,"headerRowIndex":0}