{"relation":[["Company","Sony / Sony Pictures","Dell","Hitachi","Hewlett-Packard Company","Panasonic (Matsushita)","Pioneer","Philips","Samsung","Metro-Goldwyn-Mayer Inc. (MGM)","The Walt Disney Co."],["Industry","Audio \u0026 Video Equipment","Computer Hardware","Electronic Equipment","Diversified Computer Systems","Electronics","Electronic Equipment","Electronic Equipment","Electronics","Move Production, Theaters","Entertainment - Diversified"],["Sales","$71 bil","$47 bil","$83 bil","$78 bil","$36 bil","$7 bil","$38 bil","$41 bil","$2 bil","$30 bil"]],"pageTitle":"HD-DVD versus Blu-ray Disc (BD)","title":"","url":"http://www.somacon.com/p116.php","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"RELATION","tableNum":2,"s3Link":"","recordEndOffset":0,"recordOffset":0,"tableOrientation":"HORIZONTAL","TableContextTimeStampBeforeTable":"{417\u003dHere is a summary of HD-DVD versus Blu-ray, the two primary media formats vying to replace DVD. The DVD Forum is developing HD-DVD, and the Blu-ray Disc Association is developing Blu-ray. Both organizations are consortiums of industry players. The information below was collected on December 9, 2004. Note that Sony has chosen Blu-Ray for its Playstation 3.}","TableContextTimeStampAfterTable":"{4251\u003dTechnically speaking, both HD-DVD and and Blu-Ray would have enough capacity to hold the same ultra-high quality movies. (With stunning 1920x1080 resolution, a lot of people will have to upgrade their TV sets too see it, even recently purchased ones.) The manufacturing process of HD-DVD requires little new investment to existing DVD processes, making the format cheaper to the consumer. Blu-Ray disks are more expensive partly due to the different cover layer depth, requiring new manufacturing processes. On the other hand, the disks holds sixty-seven percent more data.}","lastModified":"","textBeforeTable":"Major Corporate Sponsorshop for HD-DVD Here is a summary of HD-DVD versus Blu-ray, the two primary media formats vying to replace DVD. The DVD Forum is developing HD-DVD, and the Blu-ray Disc Association is developing Blu-ray. Both organizations are consortiums of industry players. The information below was collected on December 9, 2004. Note that Sony has chosen Blu-Ray for its Playstation 3. HD-DVD versus Blu-ray Disc (BD) Hardware Reviews Index \u003e Home \u003e §","textAfterTable":"Hewlett-Packard Company Diversified Computer Systems $78 bil Panasonic (Matsushita) Electronics $36 bil Pioneer Electronic Equipment $7 bil Philips Electronic Equipment $38 bil Samsung Electronics $41 bil Metro-Goldwyn-Mayer Inc. (MGM) Move Production, Theaters $2 bil The Walt Disney Co. Entertainment - Diversified $30 bil Technical Comparison of Read-only Formats   HD-DVD Blu-Ray DVD Storage Capacity (per layer) 15 GB 25 GB 4.4 GB Manufacturing Process Existing New Current Cover Layer 0.6 mm 0.1 mm 0.6 mm Approx. Transfer Rate (Mb/s) 19 36 5 Video Resolution 1920 x 1080 720 x 480 Video Codecs Microsoft VC-9, MPEG-2, MPEG-4 AVC (H.264) MPEG-2 or MPEG-1 Laser Wavelength 405 nanometers (blue-violet) 650 nanometers (red) Launch Date Sept. 2005 2nd half 2005 Aug. 1997 Conclusions Note that the company list above is not exhaustive and is subject to change. Based on the list, Blu-Ray has slightly more companies with bigger aggregate size. There","hasKeyColumn":true,"keyColumnIndex":0,"headerRowIndex":0}