{"relation":[["Province","Colombie-Britannique","","","","","","","","","Alberta","","","","","","","Saskatchewan","Manitoba","","Ontario","","","","","","","","","","","","","","","","","","","","Québec","","","","","","","","","Nouveau-Brunswick","Nouvelle-Écosse","","Terre-Neuve-et-Labrador","",""],["Ville","Vancouver","Vancouver","Vancouver","Vancouver","Vancouver","Vancouver","Vancouver","Vancouver","Vancouver","Calgary","Calgary","Calgary","Calgary","Calgary","Edmonton","Edmonton","Saskatoon","Winnipeg","Winnipeg","London","London","London","London","Toronto","Toronto","Toronto","Toronto","Toronto","Toronto","Kingston","Hamilton","Hamilton","Hamilton","Hamilton","Hamilton","Ottawa","Ottawa","Ottawa","Ottawa","Montréal","Montréal","Montréal","Montréal","Montréal","Montréal","Montréal","Sherbrooke","Québec City","Moncton","Halifax","Halifax","St John’s","St John’s","St John’s"],["Hôpital","Vancouver General Hospital","Richmond General Hospital","Lion’s Gate","Powell River","St. Mary’s Hospital","Squamish Hospital","Victoria General","Royal Jubilee","Children’s and Women’s Health Center","Peter Lougheed","Rockyview General","Foothills Hospital","Alberta Children’s Hospital","Rockyview Hospital","University of Alberta Hospital","Stollery Children’s Hospital","Royal University Hospital","","Université du Manitoba, Maladies infectieuses pédiatriques","St. Joseph’s Health care","Children’s Hospital of Western Ontario","Victoria Hospital","University Hospital","Toronto Western Hospital","Toronto General Hospital","Princess Margaret Hospital","Mount Sinai Hospital","Sunnybrook Health Science Centre","The Hospital for Sick Children","Kingston General Hospital","Hamilton Health Sciences Centre","McMaster Site","Chedoke","Henderson \u0026 General Sites","St. Joseph’s Healthcare","L’Hôpital d’Ottawa","Campus Civic","Institut général et de cardiologie","Centre hospitalier pour enfants de l\u0027Est de l\u0027Ontario","Hôpital général juif – SMBD","Hôpital de Montréal pour enfants","Hôpital Maisonneuve-Rosemont","Hôpital général de Montréal","Hôpital Royal Victoria","Institut neurologique de Montréal","Institut thoracique de Montréal","CHUS Hôpital Fleurimont","Hôtel-Dieu de Québec du CHUQ","The Moncton Hospital","QEII Health Sciences Centre","IWK Health Centre","Health care Corp. of St. John’s General \u0026 Miller Sites","Janeway Site","St. Clare Site"],["Participation","Oui","Oui","Oui","Oui","Oui","","","","","","","","Oui","","Oui","Oui","Oui","Oui","Oui","","","","","Oui","","","Oui","Oui","Oui","","Oui","Non","Non","Non","Oui","Oui","Oui","Oui","Oui","Oui","Oui","","Oui","Oui","Oui","Oui","Non","Non","Oui","Oui","Oui","","",""],["Option*","3","3","3","3","3","3","3","","","","","","Péd VEN†","","3","Péd VEN†","3","3","Péd VEN†","","","","","3","","","3","1","Péd VEN†","","3","","","","1","(Sept)","","","Péd VEN†","3","Péd VEN†","","3","3","3","3","","","3","3","Péd VEN†","","",""]],"pageTitle":"Page 23 - Plan canadien de lutte contre la pandémie d\u0027influenza dans le secteur de la santé - Influenza - Agence de la santé publique du Canada","title":"","url":"http://www.phac-aspc.gc.ca/cpip-pclcpi/ann-n-fra.php","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"RELATION","tableNum":20,"s3Link":"","recordEndOffset":0,"recordOffset":0,"tableOrientation":"HORIZONTAL","TableContextTimeStampAfterTable":"{156160\u003dIl faut en outre mettre à jour ces cas dans le rapport hebdomadaire de la base de données nationale sur la grippe pandémique (H1N1) de 2009 transmis à l’ASPC de la façon décrite ci-dessus. La déclaration cas par cas des décès à la suite d’une hospitalisation liée à la grippe pandémique H1N1 doit demeurer en place le plus longtemps possible., 236683\u003dModifications d’IMPACT par suite de la grippe pandémique (H1N1) de 2009, 237627\u003dConcernant les analyses découlant des formulaires de déclaration de cas, en raison de l’envergure et de la gravité de la pandémie en question, il a été recommandé qu’à partir du 23 juillet 2009, une analyse soit effectuée deux fois par mois pour mieux suivre la tendance des cas graves et mettre en lumière d’autres facteurs caractéristiques qui nous permettraient de mieux comprendre et traiter en milieu clinique les patients atteints du virus de la grippe pandémique (H1N1) de 2009. Cette analyse sera précisée et effectuée par le Centre de l\u0027immunisation et des maladies respiratoires infectieuses.  , 206426\u003dLe réseau du PCSIN compte 52 hôpitaux sentinelles répartis dans 9 provinces au Canada. Au cours des 3 derniers épisodes de la grippe saisonnière (de 2005-2006 à 2008-2009), 15 hôpitaux du PCSIN ont mené des opérations de surveillance des cas d’influenza confirmée en laboratoire auprès de patients hospitalisés âgés de plus de 16 ans. Les patients observés étaient dles malades atteints d\u0027influenza dont l\u0027affection a été confirmée par un résultat positif dans le cadre d\u0027un test expéditif d\u0027antigènes, d\u0027une réaction en chaîne par polymérase (RCP) ou d\u0027une culture d\u0027influenza A ou B., 167884\u003dL’information produite par le PCSIN et le programme IMPACT servira à établir une description clinique plus détaillée de la population touchée par la grippe pandémique (manifestations cliniques, complications bactériennes, niveau de soin nécessaire) et permettra d’évaluer l’efficacité de certaines interventions (vaccins et, à un degré moindre, antiviraux) et d’évaluer l’impact que la grippe pandémique (H1N1) de 2009 a sur le système de soins de santé puisque l’on recevra de l’information sur le nombre de lits., 154226\u003dIl y a du nouveau au cours de la saison de la grippe 2009-2010 : on demande aux PT de faire rapport une fois par semaine, au plus tard le lundi à 17 h HAE, d’une série d’éléments de données, selon les variables de la base de données décrites à l’Appendice C.1, pour tous les cas d’hospitalisations et de décès (voir plus bas pour de plus amples renseignements concernant le signalement de décès) dus à la grippe pandémique H1N1 relevant de leur responsabilité. La base de données hebdomadaire doit être transmise par courriel à HSFLUEPI@phac-aspc.gc.ca La déclaration cas par cas relativement à la grippe pandémique (H1N1) de 2009 doit demeurer en place aussi longtemps que possible., 141803\u003dLes données de surveillance fournies par les partenaires PT jouent un rôle crucial dans la surveillance générale de la grippe pandémique (H1N1) de 2009 et dans Surveillance de l’influenza. Il est recommandé que les partenaires PT déclarent les données de surveillance recommandées le plus rapidement possible, mais il est entendu que l’information n’est pas toujours accessible dans tous leurs systèmes de surveillance., 205885\u003dDepuis sa fondation en 1994, le PCSIN poursuit les objectifs suivants :, 21395\u003dCe document a été rédigé pour faciliter la planification advenant une pandémie et l\u0027adoption d\u0027une approche standardisée de la surveillance nationale de l\u0027influenza durant la période interpandémique. Bien qu’on ne connaisse pas les caractéristiques d’un nouveau virus de l’influenza, l’expérience du SRAS (syndrome respiratoire aigu sévère), les éclosions de l’infection humaine par le virus de la grippe A (H5N1) et la pandémie H1N1 de 2009 ont souligné l’importance de bien se préparer et de créer une infrastructure de surveillance pour détecter et juguler les infections des voies respiratoires émergentes. Le cadre qui suit traite de la planification des mesures de surveillance en termes généraux; il faut cependant comprendre que bien que certaines des mesures recommandées puissent être préparées à l\u0027avance, d\u0027autres recommandations et alertes propres à des situations données devront s\u0027appuyer sur des informations qui ne seront disponibles qu\u0027à mesure que la pandémie évoluera. Signalons également que des stratégies de surveillance particulières pourraient se révéler nécessaires à l’égard des collectivités éloignées et isolées pour décrire correctement une éclosion dans ces régions, notamment à l’égard des nombreuses collectivités des Premières nations et des Inuits., 176328\u003dIl faudrait essayer de recueillir ces renseignements sur tous les patients hospitalisés et décédés à cause de la grippe pandémique (HINI) de 2009 si la communauté ou la régie régionale de la santé où habite le patient est considérée comme isolée ou éloignée par la PT en cause., 191435\u003dIndiquer les principaux types de données pour tous les cas d’hospitalisation et de décès associés à la pandémie d’influenza (H1N1) de 2009.  , 180393\u003dDeux cas ou plus de syndrome grippal en sept jours, y compris au moins un cas de grippe pandémique (H1N1) de 2009 confirmée en laboratoire., 213714\u003dModifications possibles du PCSIN par suite de la pandémie de grippe (H1N1) de 2009, 156624\u003dMême si elles n’y sont pas obligées, les PT en mesure de remplir le Formulaire de déclaration des cas de grippe pandémique (H1N1) de 2009 (Appendice C.3) sont incitées à le faire pour les cas de décès causés par la pandémie. Ces données devraient également figurer dans la base de données hebdomadaire. c. Déclaration sommaire des cas d’hospitalisation et de décès par suite de l’influenza confirmée en laboratoire , 16093\u003dDepuis 2004, les intervenants canadiens responsables de la surveillance de la santé publique, par l\u0027intermédiaire de groupes de travail nationaux, définissent les rôles et les responsabilités, de même que les normes minimales, concernant la collecte des données de surveillance nationales durant les périodes interpandémique et pandémique., 147567\u003dDate de début pour les 45 hôpitaux : le 1er septembre 2009, 207205\u003dChangements apportés au PCSIN par suite de la grippe pandémique (H1N1) de 2009, 179124\u003dHospitalisations causées par la grippe pandémique (H1N1) de 2009 Toute personne hospitalisée qui a la grippe H1N1 confirmée en laboratoire12 ., 10208\u003dRemarque : Nouvelle annexe publiée avec la version 2006 du Plan canadien de lutte contre la pandémie d’influenza., 182080\u003dDeux cas ou plus de syndrome grippal en sept jours, y compris au moins un cas de grippe pandémique (H1N1) de 2009 confirmée en laboratoire., 154079\u003da. Hospitalisations dues à la pandémie (HINI) de 2009 (signalement fondé sur les cas), 138047\u003dLa stratégie de surveillance de la grippe appliquée cette année (2009) diffère considérablement de celle des saisons précédentes, car le Canada est en période de pandémie de la phase 6. Les recommandations nationales sur l’orientation et la déclaration qui portent sur la surveillance de la grippe pandémique (H1N1) de 2009 aideront à assurer que les données soumises à l’Agence de la santé publique du Canada (ASPC) sont normalisées d’un bout à l’autre du pays. Cela facilitera l’établissement de comparaisons entre les administrations et permettra au Canada de satisfaire aux obligations relatives aux déclarations internationales imposées par l’Organisation mondiale de la santé (OMS)., 137128\u003dVersion la plus récente : 6 février 2010, 229684\u003dIMPACT est administré par la Société canadienne de pédiatrie et financé par la Division de l’immunisation et des infections respiratoires de l’ASPC. Le programme a débuté en décembre 1990 à titre de projet pilote dans cinq centres pédiatriques spécialisés au Canada. Le réseau compte maintenant 12 centres, ce qui représente environ 90 % de tous les lits pédiatriques de soins tertiaires au Canada., 231401\u003dL’influenza est devenue une cible de surveillance en 2004 lors du lancement d’une étude pilote sur l’influenza. La surveillance de l’IMPACT s’était alors donné les objectifs suivants :, 155167\u003dMême si elles n’y sont pas obligées, les provinces/territoires en mesure de remplir le Formulaire de déclaration des cas de grippe pandémique (H1N1) de 2009 (Appendice C.3) sont incitées à le faire pour les cas d’hospitalisation causée par la pandémie. Par ailleurs, si elles fournissent ces données, celles-ci devraient également figurer dans la base de données hebdomadaire. b. Décès dus à la pandémie (HINI) de 2009 (signalement fondé sur les cas) , 174110\u003dLe CIMRI prévient le centre des rapports sur la santé internationale de l’OMS et de l’OPS pour le Canada d’événements grippaux inhabituels (cas de résistance aux antiviraux du virus de la grippe pandémique [H1N1] de 2009, grappe de maladies respiratoires graves, souches nouvelles du virus de la grippe, etc.) conformément aux exigences des rapports sur la santé internationale., 180043\u003dÉclosions d’influenza et de grippe pandémique (H1N1) de 2009 dans des établissements de soins de santé et établissements résidentiels (hôpitaux, établissements de soins de longue durée, établissements correctionnels, établissements de soutien), 145825\u003dProduire de l’information agrégée sur les hospitalisations liées à la grippe confirmée en laboratoire (selon le groupe d’âge, le type de grippe, la date d’admission) et les décès chez les enfants de moins de 16 ans. À compter de l’automne 2009, ils doivent fournir des rapports de cas détaillés aux deux semaines, 180562\u003dÉclosion d’influenza et de grippe pandémique (H1N1) de 2009 dans les écoles13 Absentéisme qui dépasse 10 % OU absentéisme plus élevé que les niveaux de référence établis par les écoles ou la région de surveillance qui est probablement attribuable au syndrome grippal., 177529\u003dCas de grippe pandémique (H1N1) de 2009 confirmée en laboratoire, 165329\u003dLe programme IMPACT doit soumettre aux deux semaines des rapports de cas détaillés sur les patients hospitalisés avec la grippe pandémique (H1N1) de 2009 confirmée en laboratoire. Ces rapports fournissent de l’information clinique détaillée sur le patient, comme la présence de problèmes médicaux sous-jacents, l’existence d’infections bactériennes secondaires, de l’information sur les antécédents vaccinaux et le traitement aux antiviraux. L’Appendice E contient plus d’information sur le programme IMPACT., 208286\u003dLe nombre d’hôpitaux dans le réseau d’influenza du PCSIN s’est accru, passant de 15 à 40 sur un total de 52 établissements faisant partie du réseau. La période de surveillance s’étend du 1er juin 2009 au 31 mai 2010. À toutes fins utiles, la collecte des données a débuté le 1er juillet 2009. Tous les hôpitaux du PCSIN auront le choix d’effectuer une surveillance : 1) de cas de grippe confirmée en laboratoire; 2) des cas d\u0027hospitalisation diagnostiqués d\u0027une affection potentiellement associée à la grippe, ou 3) les deux., 166105\u003dCe sera la première fois au cours de la saison de la grippe de 2009-2010 que le PCSIN participera à la surveillance habituelle de la grippe assurée par le programme Surveillance de l’influenza. Ce programme doit fournir de l’information sur la population adulte hospitalisée. Le PCSIN présente par courriel, une fois par semaine, un dénombrement des admissions causées par la grippe (voir la liste des problèmes au protocole de l’Appendice D) et de l’ensemble des hospitalisations et des décès causés par la grippe confirmée en laboratoire. Une fois par mois, ces intervenants doivent soumettre des rapports de cas détaillés sur les patients hospitalisés à cause d’une grippe confirmée en laboratoire., 181530\u003dAutres éclosions communautaires d’influenza et de grippe pandémique (H1N1) de 2009 (petites localités, milieu de travail, etc14., 175309\u003dIl faudrait essayer de recueillir de l’information sur l’obésité de tous les patients hospitalisés et décédés à cause de la grippe pandémique (H1N1) de 2009. Si le dossier du patient mentionne le poids en kilogrammes et la taille en centimètres, on peut les indiquer sur le formulaire de déclaration de cas ou dans la base de données. L’ASPC convertira ces renseignements et calculera l’indice de masse corporelle (IMC). Si on ne dispose que du poids, prière de l’indiquer. Lorsque l’on inscrit la mention « obésité » dans le dossier, prière de l’indiquer, sans égard à la gravité de celle-ci (qu’il s’agisse d’obésité, d’obésité morbide ou grave)., 153971\u003dA.2.1.ii Surveillance de la grippe pandémique (H1N1) de 2009, 236792\u003dPar suite de la pandémie émergente au Canada, il a été décidé de continuer à déclarer par voie électronique les données globales sur une base hebdomadaire. Toutefois, comme il a déjà été mentionné, depuis la semaine 17 (26 avril – 2 mai 2009), le nombre et la proportion d’hospitalisations et de décès d’enfants atteints d’influenza confirmée en laboratoire attribuables au virus pandémique (H1N1) de 2009 sont affichés sur Surveillance de l’influenza sur une base hebdomadaire. Pour ce qui est de la déclaration des cas, le formulaire de déclaration des cas axée sur IMPACT a été mis au point.  , 10112\u003dDate de la version la plus récente : février 2010, 179704\u003dDécès causés par la grippe pandémique (H1N1) de 2009 Décès de toute personne qui a la grippe pandémique (H1N1) confirmée en laboratoire chez laquelle il n’y a pas eu de période de rétablissement complet entre la maladie et la mort., 142621\u003dToute collecte, utilisation et divulgation d’information identifiable par l’ASPC se déroulera conformément à la Politique sur la collecte, l’utilisation et la diffusion de données sur la santé publique de l’Agence datée de juin 2009., 135948\u003dLe questionnaire suivant a été élaboré par le BC Centre for Disease Control (BCCDC) pour être utilisé au cours de l’éclosion d’influenza aviaire H7N3 en 2004 en Colombie-Britannique, grâce à la contribution des scientifiques qui avaient déjà participé à l’intervention lors d’une éclosion d’influenza aviaire H7N7 aux Pays-Bas en 2003.}","lastModified":"","textBeforeTable":"3. Période interpandémique   Haut de la page Remarque : Dans la description des phases, le terme  « animal » utilisé englobe tant les oiseaux que les mammifères. Les tableaux qui suivent décrivent les objectifs de la surveillance, les rôles et responsabilités des intervenants en santé publique à chaque niveau (FPT et local). Ils sont présentés pour chaque phase successive d\u0027une pandémie d\u0027après les phases pandémiques au Canada, qui rendent compte tant de la situation mondiale (phases 1.0, 2.0, 3.0, etc.) que du niveau le plus élevé d\u0027activité du nouveau virus au Canada (sous-phases 3.1, 4.1, 5.1, etc.). Voir la section sur le contexte du Plan canadien de lutte contre la pandémie d’influenza pour obtenir d’autres précisions. Effectuer une surveillance de la santé animale (détection précoce des éclosions chez les animaux ou de la transmission de l\u0027animal à l\u0027humain durant les périodes d\u0027alerte pandémique et interpandémique). Tirer profit des systèmes de surveillance améliorés qui existent pour recueillir des données de surveillance supplémentaires et/ou procéder en temps utile à l’analyse des variables importantes permettant de comprendre la pandémie; Plusieurs autres activités de surveillance de la pandémie d\u0027influenza sont recommandées tant pour la détection améliorée des premiers signaux avertisseurs que pour la surveillance durant une pandémie, notamment : Échange continu de l\u0027information par des réseaux établis de communication (p. ex., le CCSIE [Centre canadien de surveillance intégrée","textAfterTable":"Données nationales de surveillance Surveillance des maladies (a) Niveau d’activité grippale par région PT (d’après les définitions du programme Surveillance de l’influenza); (b)  Taux de consultations pour SG (nombre de consultations de médecins sentinelles pour SG par 1 000 consultations); (c) Nombre d’éclosions confirmées en laboratoire dans les établissements de soins de longue durée; (d) Nombre d’hospitalisations et de décès associés à l’influenza chez les enfants âgés de 0 à 18 ans obtenu par l’intermédiaire des hôpitaux pédiatriques sentinelles (IMPACT). Surveillance des laboratoires e) Pourcentage de tests positifs d’influenza (nombre total de tests d’influenza effectués en laboratoire et nombre de résultats positifs, selon le type de virus A ou B); (f) Caractérisation des souches, nombre identifié pour chaque souche et sous-type et pourcentage de l’ensemble en ce qui concerne environ 10 % des isolats provenant du système de détection des virus respiratoires dans les laboratoires sentinelles; (g) Caractérisation accrue des souches ciblées en fonction de l’évaluation du risque dans les zones où circulent des souches animales; (h) Étude de la résistance aux antiviraux des isolats du virus grippal. Évaluation des risques (i) Sommaire des zones, au Canada et à l’étranger, où l’activité du virus chez les animaux a été confirmée; (j) Sommaire de l’activité du virus à l’échelle internationale chez les humains. Phase pandémique au Canada 3.1 Chez les humains, des cas isolés d’infection causée par un nouveau","hasKeyColumn":true,"keyColumnIndex":2,"headerRowIndex":0}