{"relation":[["römischer Kaiser","Augustus","Tiberius","Claudius","Nero","Domitian","Trajan","Hadrian","Marc Aurel","Commodus","Caracalla","Diokletian"],["Zeit (n. Chr.)","13 v. Chr.","14 - 37","41 - 54","54 - 68","81 - 96","98 - 117","117 - 138","161 - 180","180 - 192","211 - 217","284 - 305"],["Bauprojekt","Augustus-Tempel; 2. Ostkolonnaden (kleine Bibliothek) des Isis-Tempels; Säulenhof des Hathor-Tempels, Reliefs im Mammisi und an Außenwand (Sankuarbereich) des Isis-Tempel; Terrassenanlagen","Reliefs im Mammisi, Westkolonnade und innere Fassade des 2.Pylons des Isis-Tempels; ebenso Reliefs an Außenwand Isis-Tempel (Sanktuarbereich); Reliefs im Arensnuphis-Tempel; Torbau in der Ostkolonnade im Isis-Tempelhof","Reliefs im Harendotes-Tempel","Reliefs in Westkolonnade des Isis-Tempels","Kiosk vor Dodekaschoinos-Stele","Kiosk vor Dodekaschoinos-Stele; Trajan-Kiosk","Kiosk vor Dodekaschoinos-Stele; Hadrian-Tor","Reliefs im Hadrian-Tor; Vorraum Osiriszimmer (am Dach des Isistempels)","Kartuschen im Hadrian-Tor","Reliefs im Vestibül der Osiris-Dachkapelle des Isis-Tempels und im Hadrian-Tor","Diokletian-Tor; Stadtmauer (?)"]],"pageTitle":"römisches Philae","title":"","url":"http://www.sennefer.at/Tempel/Nubien/Philae_rom.htm","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"RELATION","tableNum":0,"s3Link":"","recordEndOffset":0,"recordOffset":0,"tableOrientation":"HORIZONTAL","TableContextTimeStampAfterTable":"{10989\u003dLiteratur: Heft KEMET Jahrgang 12, Heft 1 Januar 2003 in: 32; Günther Hölbl, Altägypten im Römischen Reich in 40 - 98;, 5085\u003dDie größte Bedeutung hatte Philae zur Zeit der Römer. Zwei Gründe sprechen für die späte Blüte der Tempelinsel Philae. Erstens war der Isis-Kult schon vor den Römern, in der ptolemäischen Zeit, im Mittelmeerraum bekannt und hatte auch außerhalb von Ägypten seine Anhänger. Unter den Römern wurde der Isis-Kult dann erst so richtig populär. Ich möchte da nur darauf Hinweisen, dass es in Rom auf dem Marsfeld einen Isis-Tempel aus der Zeit Caligulas (38 n. Chr.) gegeben hat. Der zweite Grund war, dass sich die Römer mit dem Isis-Kult ein gewisses wohlwollen bei den nubischen Stämmen erkauften und dadurch nicht dauernd mit der Verteidigung ihrer Südgrenze beschäftigt waren. Dementsprechend waren auch die jeweiligen römischen Herrscher bemüht, zumindest ihren Namen zu hinterlassen oder gar ein Heiligtum zu stiften. So haben wir in Philae in einzigartiger Weise eine bauliche Chronologie aus der römischen Zeit vorliegen, die sonst nirgends in Ägypten zu finden ist. Wenn man jetzt den Zeitraum betrachtet, so kann man grob drei Perioden von Bautätigkeiten unterscheiden. Die erste, gleich am Beginn der römischen Herrschaft mit den Kaisern Augustus und Tiberius, die doch einiges in Philae verändert haben. Die zweite Periode mit den Kaisern Domitian, Trajan und Hadrian. Von denen kennen wir vor allen den berühmten Trajan-Kiosk und das Hadrian-Tor. Die dritte und letzte Periode mit Kaiser Diokletian mit seinem Diokletian-Tor. Dazwischen gibt es noch vereinzelnde Reliefs der anderen Kaisern, wie z.B. Kaiser Nero oder Kaiser Marc Aurel. 392 n. Chr. wurde die letzte datierbare Hieroglyphen Inschrift am Hadrian-Tor angebracht. Noch im Jahre 451/452 enthielt ein Vertrag zwischen dem byzantinischen General Maximinus und den Blemmyren und Nobaden den Passus, dass ihnen weiterhin \"nach altem recht\" freier Zugang zum Heiligtum der Isis gewährt wurde. Die altägyptischen Kultue auf Philae wurden erst zwischen der Mitte des Jahres 535 und dem Ende con 537 n. Chr. auf Anordnung von Kaiser Justinian zwangsweise beendet. Dieses Datum gilt zugleich als Ende der ägyptischen Kultur. In die Tempelanlage wurde dann in der nachfolgenden Zeit gleich vier Kirchen eingebaut. Nachstehend habe ich in übersichtlicher Form eine kurze Auflistung der Bauten und Abbildungen aus römischer Zeit erstellt.}","lastModified":"","textBeforeTable":"Die größte Bedeutung hatte Philae zur Zeit der Römer. Zwei Gründe sprechen für die späte Blüte der Tempelinsel Philae. Erstens war der Isis-Kult schon vor den Römern, in der ptolemäischen Zeit, im Mittelmeerraum bekannt und hatte auch außerhalb von Ägypten seine Anhänger. Unter den Römern wurde der Isis-Kult dann erst so richtig populär. Ich möchte da nur darauf Hinweisen, dass es in Rom auf dem Marsfeld einen Isis-Tempel aus der Zeit Caligulas (38 n. Chr.) gegeben hat. Der zweite Grund war, dass sich die Römer mit dem Isis-Kult ein gewisses wohlwollen bei den nubischen Stämmen erkauften und dadurch nicht dauernd mit der Verteidigung ihrer Südgrenze beschäftigt waren. Dementsprechend waren auch die jeweiligen römischen Herrscher bemüht, zumindest ihren Namen zu hinterlassen oder gar ein Heiligtum zu stiften. So haben wir in Philae in einzigartiger Weise eine bauliche Chronologie aus der römischen Zeit vorliegen, die sonst nirgends in Ägypten zu finden ist. Wenn man jetzt den Zeitraum betrachtet, so kann man grob drei Perioden von Bautätigkeiten unterscheiden. Die erste, gleich am Beginn der römischen Herrschaft mit den Kaisern Augustus und Tiberius, die doch einiges in Philae verändert haben. Die zweite Periode mit den Kaisern Domitian, Trajan und Hadrian. Von denen kennen wir vor allen den berühmten Trajan-Kiosk und das Hadrian-Tor. Die dritte und letzte Periode mit Kaiser Diokletian mit seinem Diokletian-Tor. Dazwischen gibt es noch vereinzelnde Reliefs der anderen Kaisern, wie z.B. Kaiser Nero oder Kaiser Marc Aurel. 392 n. Chr. wurde die letzte datierbare Hieroglyphen","textAfterTable":"Literatur: Heft KEMET Jahrgang 12, Heft 1 Januar 2003 in: 32; Günther Hölbl, Altägypten im Römischen Reich in 40 - 98; © Karl Mustafa","hasKeyColumn":true,"keyColumnIndex":0,"headerRowIndex":0}