{"relation":[["","Fianna Fáil","Fine Gael","Labour Party","Progressive Democrats","Green Party","Sinn Féin","Socialist Party","Total"],["Funding received under the Party Leaders Allowance for 2006 ?","2,704,169","2,115,054","1,417,105","510,410","385,271","321,060","64,212","7,517,281"],["Funding received under the Electoral Acts for 2006 ?","2,199,254","1,249,867","665,286","324,948","319,165","452,186","Nil","5,210,706"],["Total Exchequer Funding for 2006 ?","4,903,423","3,364,921","2,082,391","835,358","704,436","773,246","64,212","12,727,987"]],"pageTitle":"Press Releases, Standards in Public Office Commission","title":"","url":"http://www.sipo.gov.ie/en/PressReleases/Name,7099,en.htm","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"RELATION","tableNum":0,"s3Link":"","recordEndOffset":0,"recordOffset":0,"tableOrientation":"HORIZONTAL","TableContextTimeStampAfterTable":"{11478\u003dFunding received under the Party Leaders Allowance for 2006 ?, 8736\u003d1. Report to the Minister for Finance concerning Statements of Expenditure and Public Auditors\u0027 Reports, in respect of 2006, furnished under the Party Leaders Allowance legislation by qualified political parties. Table 1 of this report provides details of the funding received in respect of 2006 while Table 2 shows how the funding was used., 6650\u003dExchequer funding received and spent by political parties in 2006, 6596\u003dDate Released: 21.06.2007, 11590\u003dFunding received under the Electoral Acts for 2006 ?, 7957\u003dNon-party members of Dáil Éireann and Seanad Éireann also receive funding under the Party Leaders Allowance scheme. The total amount paid to non-party members of Dáil Éireann during 2006 was ?514,158. The total amount paid to non-party members of Seanad Éireann was ?104,970. Non-party members of Dáil or Seanad Éireann are not required to furnish to the Standards Commission a Statement of Expenditure in relation to the allowance., 7111\u003dSix qualified parties (Fianna Fáil, Fine Gael, Labour, Sinn Féin, Progressive Democrats and the Green Party) received funding of ?5,210,706 in respect of 2006 under the Electoral Acts. The same six parties together with the Socialist Party qualify for funding under the Party Leaders Allowance legislation and received payments of ?7,517,281 in respect of 2006. Table A gives a breakdown of the funding received by qualified political parties in respect of 2006., 9552\u003d2. Report to the Ceann Comhairle concerning Statements of Expenditure and Public Auditors\u0027 Reports, in respect of 2006, furnished under the Electoral Acts by qualified political parties. Table 1 of this report provides details of the funding received in respect of 2006 while Table 2 shows how the funding was used., 13635\u003dIssued by the Standards in Public Office Commission on 21 June 2007, 11693\u003dTotal Exchequer Funding for 2006, 6920\u003dFigures released today by the Standards Commission show that qualified political parties received ?12,727,987 in direct funding from the Exchequer during 2006.}","lastModified":"","textBeforeTable":"Table A: Total Exchequer funding of qualified political parti es in 2006 under the Electoral Acts and the Party Leaders Allowance    The Statements of Expenditure and Auditors\u0027 Reports furnished to the Standards Commission may be inspected and copied by members of the public at its offices at 18 Lower Leeson Street, Dublin 2. The information is also available, in summary form, on the Standards Commission\u0027s website http://www.sipo.gov.ie. 2. Report to the Ceann Comhairle concerning Statements of Expenditure and Public Auditors\u0027 Reports, in respect of 2006, furnished under the Electoral Acts by qualified political parties. Table 1 of this report provides details of the funding received in respect of 2006 while Table 2 shows how the funding was used. 1. Report to the Minister for Finance concerning Statements of Expenditure and Public Auditors\u0027 Reports, in respect of 2006, furnished under the Party Leaders Allowance legislation by qualified political parties. Table 1 of this report provides details of the funding received in respect of 2006 while Table 2 shows how the funding was used. Details of the Exchequer funding received by qualified political parties and how it was spent are contained in two separate reports published today by the Standards Commission and available on www.sipo.gov.ie. These reports are: Non-party members of Dáil Éireann and Seanad Éireann also receive funding under the Party Leaders Allowance scheme. The total amount paid to non-party members of Dáil Éireann during 2006 was ?514,158. The total amount","textAfterTable":"Issued by the Standards in Public Office Commission on 21 June 2007 Fax: 01-6395684 email: sipo@sipo.gov.ie Website: http://www.sipo.gov.ie Back to contents Home - Sitemap - Contact Us | | |","hasKeyColumn":true,"keyColumnIndex":0,"headerRowIndex":0}