{"relation":[["Party","Unity List","Socialist Party","Social Democrats","Social Liberal Party","Christian Democrats","New Alliance","Liberal Party","Conservative Party","Danish People\u0027s Party"],["05-02-08","3,4","6,0","25,8","9,2","1,7","","29,0","10,3","13,3"],["Min","1,7","10,8","24,5","5,7","0,6","3,8","24,5","8,4","12,2"],["Max","2,2","13,4","25,5","7,0","1,2","7,2","25,7","10,1","13,4"]],"pageTitle":"2007 November 08 at Jacob Christensen","title":"","url":"http://jacobchristensen.name/2007/11/08/","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"RELATION","tableNum":0,"s3Link":"","recordEndOffset":0,"recordOffset":0,"tableOrientation":"HORIZONTAL","TableContextTimeStampBeforeTable":"{2567\u003dNovember 8th, 2007 at 11:17 pm, 3994\u003dNovember 8th, 2007 at 11:30 pm, 285\u003dI was a little curious about how support for the parties has varied during the campaign. Here are the highs and lows according to Gallup’s almost-daily index from 24 October to 7 November:, 1106\u003dNovember 8th, 2007 at 5:31 pm}","TableContextTimeStampAfterTable":"{3319\u003dTagged with Denmark, Elections 2007, 9257\u003dTagged with Denmark, Elections 2007, Media, 5929\u003dNovember 8th, 2007 at 3:10 pm, 16116\u003dNovember 8th, 2007 at 12:42 am, 9030\u003dNovember 8th, 2007 at 2:58 pm, 14685\u003dNovember 8th, 2007 at 2:44 am, 6322\u003dTagged with Books and research, Denmark, Elections 2007, Media, 12789\u003dNovember 8th, 2007 at 2:51 am, 11451\u003dNovember 8th, 2007 at 2:28 pm, 3092\u003dNovember 8th, 2007 at 5:00 pm}","lastModified":"","textBeforeTable":"I was a little curious about how support for the parties has varied during the campaign. Here are the highs and lows according to Gallup’s almost-daily index from 24 October to 7 November: without comments Ups and Downs in the Campaign Tagged with Cycling, Media, Watching Posted in Spare time November 8th, 2007 at 5:31 pm Written by Jacob Christensen Question: If it is revealed that a professional cyclist has lied, is it news? without comments Lies, Damned Lies and Professional Cycling Tagged with Computers, Media, quote of the day, Reading Posted in General,Spare time November 8th, 2007 at 11:17 pm Written by Jacob Christensen Statistically speaking, half of ALL people are below-average intelligence. That fact can explain MANY things. and received the answer: Who are the morons who respond to junk-mail offers, thereby keeping spammers in business? David Pogue of the New York Times asked: with one comment Quote of the Day","textAfterTable":"I find the stability of the Liberals and Social Democrats interesting. (Both parties record new maximum values in Thursday’s index). Written by Jacob Christensen November 8th, 2007 at 5:00 pm Posted in Politics Tagged with Denmark, Elections 2007 Horse Race Coverage without comments I linked to this Paul Krugman post about political journalism-as-horse-race-reporting some week ago. The always readable Andrew Gelman came up with an interesting explanation: My theory, at least for the general election, is that most of the voters have already decided who they’re going to vote for–and even the ones who haven’t decided are often more predictable than they realize. Suppose, for example, that 40% have pretty much already decided they’ll vote for the Democrat, 40% will vote for the Republican, and the fight is over the remaining 20%–most of whom do not follow politics closely in any case. Now think of the audience for political news. 80% of the people don’t need to know the candidates’ positions–they’ve already decided their votes–but they’re intensely interested in the horse race: are “we” going to win or lose? The substantive coverage that Krugman and I might want is really just for 20% of the audience. So, from that perspective, it makes sense for the media to give people the horse","hasKeyColumn":true,"keyColumnIndex":0,"headerRowIndex":0}