{"relation":[["","Greek era","1704","1803","1832","1859","1869","1873","1879","1886","1894","1895","1896","1897","1897","1898","1898","1900","1900","1903","1904","1905","1906","1909","1911","1914","1919","1922","1923","1927","1929","1930","1930","1932","1938","1941 - 51","1942","1950\u0027s -"],["","Democritus","Isaac Newton","John Dalton","Michael Faraday","J. Plucker","Dmitri Mendeleev","James Clerk Maxwell","Sir William Crookes","E. Goldstein","G.J. Stoney","Wilhelm Roentgen","Henri Becquerel","J.J. Thomson","J.J. Thomson","Rutherford","Marie Sklodowska Curie","Soddy","Max Planck","Nagaoka","Abegg","Albert Einstein","Hans Geiger","R.A. Millikan","Ernest Rutherford","H.G.J. Moseley","Aston","Niels Bohr","de Broglie","Heisenberg","Cockcroft / Walton","Schrodinger","Paul Dirac","James Chadwick","Lise Meitner, Hahn , Strassman","Glenn Seaborg","Enrico Fermi","New findings/particles"],["","\"by convention bitter, by convention sweet, but in reality atoms and void\"","Proposed a mechanical universe with small solid masses in motion.","Proposed an \"atomic theory\" with spherical solid atoms based upon measurable properties of mass.","Studied the effect of electricity on solutions, coined term \"electrolysis\" as a splitting of molecules with electricity, developed laws of electrolysis. Faraday himself was not a proponent of atomism.","Built one of the first gas discharge tubes (\"cathode ray tube\").","Arranged elements into 7 groups with similar properties. He discovered that the properties of elements \"were periodic functions of the their atomic weights\". This became known as the Periodic Law.","Proposed electric and magnetic fields filled the void.","Discovered cathode rays had the following properties: travel in straight lines from the cathode; cause glass to fluoresce; impart a negative charge to objects they strike; are deflected by electric fields and magnets to suggest a negative charge; cause pinwheels in their path to spin indicating they have mass.","Used a CRT to study \"canal rays\" which had electrical and magnetic properties opposite of an electron.","Proposed that electricity was made of discrete negative particles he called electrons \". (Link to info on electrons)","Using a CRT he observed that nearby chemicals glowed. Further experiments found very penetrating rays coming from the CRT that were not deflected by a magnetic field. He named them \"X-rays\".","While studying the effect of x-rays on photographic film, he discovered some chemicals spontaneously decompose and give off very pentrating rays.","Used a CRT to experimentally determine the charge to mass ratio (e/m) of an electron \u003d1.759 x 10 8 coulombs/gram.","Studied \"canal rays\" and found they were associated with the proton H + .","Studied radiations emitted from uranium and thorium and named them alpha and beta.","Studied uranium and thorium and called their spontaneous decay process \"radioactivity\". She and her husband Pierre also discovered the radioactive elements polonium and radium.","Observed spontaneous disintegration of radioactive elements into variants he called \"isotopes\" or totally new elements, discovered \"half-life\", made initial calculations on energy released during decay.","used the idea of quanta (discrete units of energy) to explain hot glowing matter.","Postulated a \"Saturnian\" model of the atom with flat rings of electrons revolving around a positively charged particle.","Discovered that inert gases had a stable electron configuration which lead to their chemical inactivity.","Published the famous equation E\u003dmc 2","Developed an electrical device to \"click\" when hit with alpha particles.","Oil drop experiment determined the charge (e\u003d1.602 x 10 -19 coulomb) and the mass (m \u003d 9.11 x 10 -28 gram) of an electron.","Using alpha particles as atomic bullets, probed the atoms in a piece of thin (0.00006 cm) gold foil . He established that the nucleus was: very dense,very small and positively charged. He also assumed that the electrons were located outside the nucleus.","Using x-ray tubes, determined the charges on the nuclei of most atoms. He wrote\"The atomic number of an element is equal to the number of protons in the nucleus\". This work was used to reorganize the periodic table based upon atomic number instead of atomic mass.","Discovered the existence of isotopes through the use of a mass spectrograph.","Developed an explanation of atomic structure that underlies regularities of the periodic table of elements. His atomic model had atoms built up of sucessive orbital shells of electrons.","Discovered that electrons had a dual nature-similar to both particles and waves. Particle/wave duality. Supported Einstein.","Described atoms by means of formula connected to the frequencies of spectral lines. Proposed Principle of Indeterminancy - you can not know both the position and velocity of a particle.","Built an early linear accelerator and bombarded lithium with protons to produce alpha particles","Viewed electrons as continuous clouds and introduced \"wave mechanics\" as a mathematical model of the atom.","Proposed anti-particles . Anderson discovered the anti-electron (positron) in 1932 and Segre/Chamberlain detected the anti-proton in 1955..","Using alpha particles discovered a neutral atomic particle with a mass close to a proton. Thus was discovered the neutron.","Conducted experiments verifying that heavy elements capture neutrons and form unstable products which undergo fission. This process ejects more neutrons continuing the fission chain reaction.","Synthesized 6 transuranium elements and suggested a change in the layout of the periodic table.","Conducted the first controlled chain reaction releasing energy from the atoms nucleus.","Follow this link to current theories about atomic stucture."]],"pageTitle":"Atomic Structure Timeline","title":"","url":"http://www.logansonline.com/atomictimeline/","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"RELATION","tableNum":1,"s3Link":"","recordEndOffset":0,"recordOffset":0,"tableOrientation":"HORIZONTAL","TableContextTimeStampAfterTable":"{14724\u003dReferences Asimov,I. 1965,A short history of chemistry,  Anchor, NY CHEMS , 1966, Chemistry-An experimental science, Freeman, San Fran Dampier,W. 1971, A History of Science, Cambridge,England Jaffe, B. 1976, Crucibles: The story of chemistry, Dover, NY Pais,A. 1991, Niels Bohr\u0027s Times, Oxford}","lastModified":"","textBeforeTable":"Early theories of the structure of matter were not based upon experiments. As scientists began to study the relationship between several physical phenomenon such as electricity, and magnetism they began to develop different models about atomic structure. Visit these sites for original papers in chemistry. 1. Selected Classic Papers from the History of Chemistry by Carmen Giunta at Le Moyne College. 2. John Parks Chem Team site on Classic Papers from the History of Chemistry Created by Lee Buescher, ScienceDept, Watertown High School Watertown, Wisconsin 53098 USA Welcome to the atomic structure timeline.   This site explores discoveries related to atomic structure including the electron, proton and neutron.   The dates used for events are open to debate since many scientist\u0027s spent decades studying  a topic. Check the links for more in depth material. Most of all  enjoy . Atomic Structure Timeline","textAfterTable":"You are visitor number 2235065 Return to Lee Buescher\u0027s Home Page Copyright © 2004 - 2012 All Rights Reserved References Asimov,I. 1965,A short history of chemistry,  Anchor, NY CHEMS , 1966, Chemistry-An experimental science, Freeman, San Fran Dampier,W. 1971, A History of Science, Cambridge,England Jaffe, B. 1976, Crucibles: The story of chemistry, Dover, NY Pais,A. 1991, Niels Bohr\u0027s Times, Oxford","hasKeyColumn":true,"keyColumnIndex":1,"headerRowIndex":0}