{"relation":[["Party","Democratic Unionist Party (DUP)","Sinn Féin (SF)","Ulster Unionist Party (UUP)","Social Democratic and Labour Party (SDLP)","Alliance Party of Northern Ireland (APNI)","Green Party","Progressive Unionist Party (PUP)","United Unionist Coalition (UUC)","Newtownabbey Ratepayers Association","Socialist Environmental Alliance (SEA)","Conservative Party","Workers\u0027 Party (WP)","Socialist Party","Northern Ireland Women\u0027s Coalition (NIWC)","United Kingdom Unionist Party (UKUP)","Independent Candidates","Total"],["First Preference Votes","208,278","163,650","126,353","121,991","35,149","5,703","4,591","2,064","1,897","1,321","1,164","1,052","828","738","734","27,676","703,189"],["% Valid Poll","29.62%","23.27%","17.97%","17.35%","5.00%","0.81%","0.65%","0.29%","0.27%","0.19%","0.17%","0.15%","0.12%","0.10%","0.10%","3.94%","100.00%"],["No. of Seats","182","126","115","101","30","3","2","2","1","0","0","0","0","0","0","20","582"]],"pageTitle":"CAIN: Politics: Elections: Local Government Elections (NI) Thursday 5 May 2005","title":"","url":"http://www.cain.ulst.ac.uk/issues/politics/election/rd2005.htm","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"RELATION","tableNum":1,"s3Link":"","recordEndOffset":0,"recordOffset":0,"tableOrientation":"HORIZONTAL","TableContextTimeStampAfterTable":"{1942\u003dThis page contains the results of the District Council (local government) Elections held on 5 May 2005 . See also:, 3767\u003dThe Local Government elections on Thursday 5 May 2005 were held to choose 582 councillors for the 26 District Councils in Northern Ireland. Voting in the election was by Proportional Representation (PR) using the Single Transferable Vote (STV) system. A total of 918 candidates took part in the contest. As the election took place on the same day as the Westminster General Election it was not surprising that the general trend in results reflected the general election., 4245\u003dThe Electoral Office for Northern Ireland intend to publish a booklet with the Northern Ireland Local Government Election 2005 Results detailing the full results on a stage-by-stage basis. Due to differences in the results published by local newspapers in the days following the election the tables below should be considered as DRAFT results. The tables will be checked at a later date.}","lastModified":"","textBeforeTable":"Introduction The Local Government elections on Thursday 5 May 2005 were held to choose 582 councillors for the 26 District Councils in Northern Ireland. Voting in the election was by Proportional Representation (PR) using the Single Transferable Vote (STV) system. A total of 918 candidates took part in the contest. As the election took place on the same day as the Westminster General Election it was not surprising that the general trend in results reflected the general election. The Electoral Office for Northern Ireland intend to publish a booklet with the Northern Ireland Local Government Election 2005 Results detailing the full results on a stage-by-stage basis. Due to differences in the results published by local newspapers in the days following the election the tables below should be considered as DRAFT results. The tables will be checked at a later date. Note: In the Electoral Area of Ballinderry in Cookstown District Council six candidates stood for six seats so the candidates were deemed elected without a contest. Summary of Northern Ireland Results Eligible Electorate: 1,142,433 Number of Votes Cast (Turnout / Poll): Percentage Turnout / Poll:  % Number of Invalid / Spoilt Votes: Number of Valid Votes Cast: 703,189 Percentage Valid Votes Cast: 61.55% List of candidates standing in the 2005 Westminster Election Detailed results of the 2005 Westminster Election also held on Thursday 5 May 2005 Electoral Office Northern Ireland (EONI). (2005)","textAfterTable":"Details of distribution of seats on the 26 District Councils Council DUP SF UUP SDLP APNI Others No. Seats Antrim 6 3 5 3 2 0 19 Ards 12 0 7 1 3 0 23 Armagh 6 5 5 6 0 0 22 Ballymena 14 1 5 3 0","hasKeyColumn":true,"keyColumnIndex":0,"headerRowIndex":0}