{"relation":[["Release date","1973","1976","1982","1986","1991","1992?present","1992","1993","1996","1996","1996","1997","1997","1997?present","1999","2002","2002","2003","2003, 2007","2003","2004","2004","2005","2006","2006","2006","2006","2006","2006","2006","2006","2007","2007","2007","2008","2008","2009","2009","2009","2009","2009","2010","2011","2011"],["Title","Gotcha","Death Race","Custer\u0027s Revenge","177","J.B. Harold Murder Club","Mortal Kombat series","Night Trap","Doom","SimCopter","Duke Nukem 3D","Tomb Raider","Carmageddon","Postal","Grand Theft Auto series","Kingpin: Life of Crime","Ethnic Cleansing","State of Emergency","Postal II","Manhunt and Manhunt 2","Dead or Alive Xtreme Beach Volleyball","The Sims 2","Grand Theft Auto: San Andreas","Super Columbine Massacre RPG!","Bully","The Elder Scrolls IV: Oblivion","Hitman: Blood Money","Mind Quiz","Left Behind: Eternal Forces","Resistance: Fall of Man","RapeLay","Rule of Rose","BioShock","Mass Effect","Mario Party 8","Muslim Massacre: The Game of Modern Religious Genocide","LittleBigPlanet","MadWorld","Resident Evil 5","Saw","Left 4 Dead 2","Call of Duty: Modern Warfare 2","Six Days in Fallujah","Bulletstorm","Call of Juarez: The Cartel"],["Platform","Arcade","Arcade","Atari 2600","NEC PC-8801","TurboGrafx-16","Arcade","Sega CD","PC","PC","PC, Sega Saturn, Playstation","PC, PlayStation, Sega Saturn","PC, Mac, N64, PS1","PC","PC, PS1, PS2, PS3, Xbox, Xbox 360","PC","PC","PC, PS2, Xbox","PC","PS2","Xbox","PC","PC, PlayStation 2, Xbox","PC","PlayStation 2, Xbox 360, Wii","Xbox 360, PC","PC, PS2, Xbox, Xbox 360","Nintendo DS, PlayStation Portable","PC","PS3","PC","PS2","Xbox 360, PC, PS3","Xbox 360, PC","Wii","PC","PS3","Wii","PS3, Xbox 360, Microsoft Windows","PS3, Xbox 360, Microsoft Windows","Xbox 360, Microsoft Windows (Steam)","Xbox 360, Microsoft Windows, PlayStation 3","Microsoft Windows, PlayStation 3, Xbox 360","PS3, Xbox 360, Microsoft Windows","PS3, Xbox 360, Microsoft Windows"],["Manufacturer","Atari","Exidy","Mystique","dB-soft","NEC","Midway (later Warner Bros. Interactive)","Digital Pictures","id Software","Maxis","3D Realms","Eidos","SCi, Interplay Entertainment","Ripcord Games","Rockstar Games","Interplay Entertainment","Resistance Records","Rockstar Games","Running with Scissors","Rockstar Games","Tecmo","EA Games","Rockstar Games","Danny Ledonne","Rockstar Games","Bethesda Softworks","IO Interactive","Ubisoft","Left Behind Games","Insomniac Games","Illusion Soft","Punchline","2K Games","BioWare","Nintendo","Eric \u0027Sigvatr\u0027 Vaughn","Media Molecule","Platinum Games","Capcom","Konami","Valve Corporation","Infinity Ward","Atomic Games","Electronic Arts","Ubisoft"],["Reason(s)","It was controversial due to the controls being perceived as pink rubber bulges that were meant to represent breasts and were squeezed in order to control the action.[1]","Violence (running over stickmen \"gremlins\", who then scream)[2][3]","Nudity, rape, and racism[2][4][5]","A bishoujo game revolving around rape, it ignited a public furor that reached the National Diet of Japan.[6]","Sexual themes, including reference to an unsolved rape. [7]","Blood, violence and gore. First fighter to introduce \"Fatalities\" to finish off opponents[2][4][5][8][9][10]","Violence, child abuse and sexual themes.[2][4][8]","Violence, gore, and Satanic themes[2][5][8][9]","A programmer named Jacques Servin introduced unauthorized \"bimbo\" characters into the game, who would appear on certain dates and kiss.[11]","Violence, sexual themes, nudity.[12][13]","An unauthorized software patch nicknamed \u0027Nude Raider\u0027 was created which allowed players to play as a nude version of Lara Croft.[14]","Violence against pedestrians[15]","Violence[8]","See also: Grand Theft Auto IV controversies Sexual themes, drug use, racism, nudity, language, drink driving, violence (against civilians and law enforcement officers; in Grand Theft Auto 3, there is also a cheat called \u0027Extra Gore Mode\u0027 in which, if you shoot at someone you can blow off their limbs), criminal behavior. Grand Theft Auto: San Andreas was originally rated \"Mature\" in the US, but was re-rated \"Adults Only\" after controversy surrounding a fanmade \"hot coffee mod\" which unlocked a hidden sex scene (which was in the game\u0027s code, but left out of the final version). It was re-rated \"Mature\" after Rockstar Games removed this scene from the game\u0027s code. Grand Theft Auto IV was referred to as a \"terrorist simulator\" due to the fact that the city was loosely based on New York City.[2][4][8][16]","Violence[17]","Racially-motivated violence, white supremacist themes[18]","Contains military-style violence, including political assassinations and coup d\u0027etats. Additionally, the game caused controversy in Washington due to the game\u0027s similarities to the World Trade Organization riots in Seattle.[19]","Violence against civilians (including LGBT and police officers), sexual themes, drug use, racism, language, animal abuse, and references to past and current events of terrorist attacks. Banned in New Zealand, Sweden and Australia.[20]","Violence (allowed player to take the role of a serial killer). Gained significant controversy after it was alleged that the game inspired a teenager to commit a murder. Banned in Australia.[4][8][21]","Nudity and sexuality[5]","A cheat allows for the blur effect that appears when a character is nude to be removed.[22]","Main article: Hot Coffee mod An unauthorized \"Hot Coffee\" mod unlocked a hidden sex scene left out of the game\u0027s final version. Was briefly re-rated \"Adults Only\" by the ESRB, but had a \"Mature\" rating reinstated after Rockstar Games removed this scene from the game\u0027s code in a different version.[23]","The game simulated the events of the Columbine High School shootings.[24][25][26][27]","Violence in a school setting[8]","Main article: ESRB re-rating of The Elder Scrolls IV: Oblivion Re-rated by the ESRB after a third-party mod revealed a nude topless graphic hidden in the game\u0027s data files. While the graphic did not warrant a re-rating of the game in and of itself, upon review, the ESRB noted that the game contained much more explicit violence than had been submitted to them in the original rating submission.[28]","Violence and assassinations; magazine ads for the game featured pictures depicting murder victims.[29]","Recalled in the United Kingdom due to use of the word \"spastic\", which is considered highly offensive in the UK.[30]","Accusations that the game promoted religious \"convert or kill\" violence, sexism and racism.[31][32][33] Some reviewers[34][35][36] denied that the game contained any truly controversial gameplay.","Main article: Controversy over the usage of Manchester Cathedral in Resistance: Fall of Man The Church of England objected to the game\u0027s use of Manchester Cathedral\u0027s interior as a backdrop during a gun battle, and called for the game to be withdrawn or for the cathedral to be removed from the game.[37]","Rape forms a core part of the gameplay leading to controversy raised in the UK Parliament and elsewhere.[38]","The mayor of Rome called for the game to be banned from Italy, saying children \"have the right to be shielded from violence\".[39] The then European Union justice and security commissioner wrote an open letter condemning the game for \"obscene cruelty and brutality\". An Italian magazine, Panorama, claimed that in order to win the game players must bury a girl alive which the game\u0027s European publisher disputed.[40] On the UK release day, the publisher announced that Rule of Rose would not be published in the UK, despite the game being approved for release by the Pan European Game Information (PEGI) and Video Standards Council regulatory bodies.[41]","An article in The Patriot Ledger, the local paper of developer Irrational Games,[42] argued that the game is \"testing the limits of the ultraviolent gaming genre with a strategy that enables players to kill characters resembling young girls.\"[43] The game presents an ethical choice to players, whether to kill \u0027Little Sisters\u0027 for extra abilities or save them and receive less. 2K president Ken Levine defended the game as a piece of art, stating \"we want to deal with challenging moral issues and if you want to do that, you have to go to some dark places\".[44] Jack Thompson took issue with advertisements for the game appearing during WWE SmackDown\u0027s airtime, writing to the Federal Trade Commission and stating that M-rated games should not be advertised when large numbers of under-17s are watching.[45]","Falsely accused by evangelical blogger Kevin McCullough of containing \"rape and sodomy\", which later led to the removal of McCullough\u0027s blog entry on Townhall.com. The game was featured on the Fox News Channel following the controversy,[46] with Fox News host Martha MacCallum, which included the headline \"full graphic sex\".[47] In actuality, the game\u0027s most explicit content is an indirect \"sideboob\" shot of a humanoid alien breast.[48]","Use of the phrase \"Turn the train spastic! Make this ticket tragic!\" by the character Kamek caused controversy in the United Kingdom, where the word spastic is considered offensive. This led to a recall of the game; it was later re-released with the word changed to erratic.[49]","The game\u0027s contents and subject have been the subject of strong negative response; a spokesperson for the Muslim Council of Britain, said \"The makers of this \u0027game\u0027 and the ISPs [Internet service providers] who are hosting it should be quite ashamed of themselves. Anti-Muslim prejudice is already on the increase and needs to be challenged and not reinforced through tasteless and offensive stunts like this.\"[50]","Lyrics from a licensed song, \"Tapha Niang\", were removed due to fears that Muslims would be offended. This led to controversy about the removal itself.[51]","Violence. Described by the Daily Mail as the \"most violent video game ever\".[52]","For a pre-release trailer that contains scenes of racism,[53] according to Newsweek journalist N\u0027Gai Croal in an April 2008 interview. He also stated that organizations and retailers would object to the game and that it would cause controversy on release.[53]","Several news publishings stated that the game\u0027s only purpose was to torture and kill people in violent ways with no sense of restraint or morality. Some editorials called it \"depraved and inhumane\" and stated that \"Konami should be ashamed\".[54] It was also listed in the \"Top ten most controversial games of 2009\".[55]","The cover art in the UK had to be altered due to a potentially offensive hand gesture being depicted.[56] The game was banned in Australia for its excessive violence and gore.[57] The game\u0027s New Orleans setting so soon after Hurricane Katrina was considered \"a bad call\".[58] Finally, Left 4 Dead 2 was accused of being racist after incorporating black infected into the game, Valve quickly stated this was only for population diversification purposes.[59]","Main article: Controversies surrounding Call of Duty: Modern Warfare 2 A level in the game entitled \"No Russian\" has the player assume control of a deep cover Central Intelligence Agency agent, joining a group of Russian nationalist terrorists in enacting an airport massacre. The player is given the option to skip the level at any point.[60][61] The game was discussed briefly in the House of Commons of the United Kingdom after the issue was brought to the attention of MP Keith Vaz, a long time opponent of violence in video games, with fellow Labour Party politician Tom Watson arguing that the level was \"no worse than scenes in many films and books\" and criticising Vaz for \"collaborating with the Daily Mail to create moral panic over the use of video games\".[62] The mission was removed in the Russian version of the game.[63]","The game was opposed by both the public and critics alike for \"glamorizing\" and \"glossing over\" the real-life Battle of Fallujah. This caused the former publisher, Konami, to oppose the game and stop publishing it.[64]","Fox News Channel called out the title as the \"Worst Video Game in the World\" due to the extreme amount of violence; claims made in the original article were dispelled by video game journalists including Rock Paper Shotgun, but Fox News continues to assert the game as too violent.[65]","Residents of Ciudad Ju?rez and Mexico protested the announcement of the game, believing it to highlight the Ju?rez Cartel, who are believed responsible for over 3000 homicides in the city in 2010.[66]"]],"pageTitle":"List of controversial video games - Wikipedia, the free encyclopedia","title":"","url":"http://en.wikipedia.org/wiki/List_of_controversial_games","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"RELATION","tableNum":0,"s3Link":"","recordEndOffset":0,"recordOffset":0,"tableOrientation":"HORIZONTAL","TableContextTimeStampAfterTable":"{125464\u003dFamily Entertainment Protection Act ? Truth in Video Game Rating Act ? Video Game Decency Act ? Video Recordings Act 1984 ? California Assembly Bills 1792 \u0026 1793 ? Law 3037/2002}","lastModified":"","textBeforeTable":"This video game-related list is incomplete; you can help by expanding it. [edit] Table of controversial games This is a list of video games described explicitly as \"controversial\" in secondary sources. Some of the video games on this list have been banned or censored. search navigation, Jump to: List of controversial games) ??(Redirected from From Wikipedia, the free encyclopedia List of controversial video games","textAfterTable":"[edit] Notes ^ Gotcha at the Killer List of Videogames ^ a b c d e f David Craddock, \"The Rogues Gallery: Controversial Video Games,\" Shacknews (Sep 29, 2005). ^ DeMaria, Rusel; Wilson, Johnny L. (2003). High Score!: The Illustrated History of Electronic Games. McGraw-Hill Professional. pp. 27,28. ISBN 0072231726. http://books.google.com/?id\u003dHJNvZLvpCEQC.  ^ a b c d e ; Fecal Jesus, \"The Seven Most Controversial Games and why most of them are complete crap,\" GamerHelp (02/14/08). ^ a b c d Kearney, Paul; Pivec, Maja (May 2007). \"Sex, lies and video games\". British Journal of Educational Technology 38 (3): 489?501. doi:10.1111/j.1467-8535.2007.00712.x. http://www.ingentaconnect.com/content/bpl/bjet/2007/00000038/00000003/art00010. Retrieved 2008-07-23.  ^ Retro Japanese Computers: Gaming\u0027s Final Frontier, Hardcore Gaming 101, reprinted from Retro Gamer, Issue 67, 2009 ^ Video Games and Computer Entertainment. July 1991. Pg. 44 ^ a","hasKeyColumn":true,"keyColumnIndex":1,"headerRowIndex":0}