{"relation":[["Name","Honorius","Gildo","Marcus","Gratian","Konstantin (III.)","Priscus Attalus","Maximus","Jovinus","Heraclianus","Constantius III.","Johannes","Valentinian III.","Vortigern","Pirrus","Petronius Maximus","Avitus","Majorian","Marcellus","Libius Severus","Aegidius","Anthemius","Arvandus","Romanus","Olybrius","Glycerius","Julius Nepos","Romulus Augustulus"],["Vollständiger Name","Flavius Honorius","unbekannt","unbekannt","unbekannt","Flavius Claudius Constantinus","unbekannt","unbekannt","unbekannt","unbekannt","Flavius Constantius","unbekannt","Flavius Placidus Valentinianus","unbekannt","unbekannt","Flavius Petronius Maximus","Flavius Eparchius Avitus","Flavius Iulius Valerius Maiorianus","unbekannt","Flavius Libius Severus","unbekannt","Flavius Procopius Anthemius","unbekannt","unbekannt","Flavius Anicius Olybrius","unbekannt","Flavius Iulius Nepos","Romulus A(u)gustus"],["Regierungszeit","395–423","397–398","406","407","407–411","409–410 414–415","409/10–411 418/19–420/21","411–413","412–413","421","423–425","425–455","426–441?","428","455","455–456","457–461","457?","461–465","461–464/65","467–472","468","470","472","473–474","474–480","475–476"],["Anmerkungen","Mitkaiser von Theodosius I. und Arcadius seit 393 (gegen Eugenius); Regent: Stilicho (bis 408)","Usurpator (?) in Africa","Usurpator in Britannien","Usurpator in Britannien","Gegenkaiser in Gallien, Spanien und Britannien (409 nominell Mitkaiser des Honorius), ab 409/10 mit Constans (II., Caesar seit 408); Caesar: Julian (ab 409/10)","Gegenkaiser in Italien (durch Alarich) bzw. Südgallien (durch Athaulf)","Gegenkaiser in Spanien (durch Gerontius bzw. Gunderich)","Gegenkaiser in Gallien (durch Gundahar und Goar), ab 412 mit Sebastianus","Usurpator (?) in Africa","Mitkaiser des Honorius (Mitregent seit 417), von Theodosius II. nicht anerkannt","durch Castinus (?), von Theodosius II. nicht anerkannt","Caesar unter Theodosius II. seit 424 (gegen Johannes); Regenten: Galla Placidia (bis 437), Aëtius (435–454); erkannte Geiserich als Regenten in Africa an","Usurpator (?) in Britannien; Nachfolger: ?Ambrosius Aurelianus","Usurpator (?) in Italien","von Markian nicht anerkannt; Caesar: Palladius","durch Theoderich II., von Markian nicht anerkannt (?)","durch Ricimer (?), 457 nominell Caesar (?) unter Leo I.","Usurpator (?) in Gallien","durch Ricimer, von Leo I. nicht anerkannt (?)","Usurpator (?) in Gallien; Nachfolger: Paulus (469?), Syagrius (bis 486/87)","467 Caesar unter Leo I.; Mitregent: Ricimer (bis 470/71)","Usurpator (?) in Gallien (durch Eurich)","Usurpator (?) in Italien (durch Ricimer?)","durch Ricimer (und Geiserich?), gegen Anthemius, von Leo I. nicht anerkannt (?)","durch Gundobad, von Leo I. nicht anerkannt","474 Caesar (?) unter Leo II. und Zenon (gegen Glycerius), Exil ab 475 in Dalmatien; erkannte Eurich als Regenten in Südgallien und Spanien an","Gegenkaiser in Italien (durch Orestes), von Odoaker abgesetzt"]],"pageTitle":"Wikipedia - SPIEGEL ONLINE","title":"","url":"http://www.spiegel.de/wikipedia/Westrom.html","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"RELATION","tableNum":1,"s3Link":"","recordEndOffset":0,"recordOffset":0,"tableOrientation":"HORIZONTAL","TableContextTimeStampBeforeTable":"{1225\u003dDas Weströmische Reich endete – je nach Sichtweise – im August 475 mit der Vertreibung des letzten vom oströmischen Augustus Zenon anerkannten weströmischen Kaisers Julius Nepos durch den weströmischen Feldherrn Orestes, im August 476 mit der Absetzung des jugendlichen Usurpators und Gegenkaisers Romulus Augustus (spöttisch „Romulus Augustulus“ genannt) durch den weströmischen Heerführer Odoaker oder im Jahre 480 mit der Ermordung des in die Provinz Dalmatia geflohenen Julius Nepos, der sich trotz Vertreibung weiterhin als Augustus (Kaiser) Westroms betrachtet hatte.}","TableContextTimeStampAfterTable":"{24839\u003dNach mehreren unkriegerischen Zivilisten auf dem Thron versuchte man nun den entgegengesetzten Weg: Der tatkräftige General Majorian, bislang als zweiter magister militum der Kollege Ricimers, wurde am 1. April 457 von den Truppen zum Herrscher ausgerufen; von Ostrom bald anerkannt, bemühte er sich um ein gutes Verhältnis zum Senat und blieb knapp vier Jahre lang Kaiser. Er versuchte, seine Stellung durch militärische Leistungen zu stabilisieren. Nach den Jahren des Niederganges der Zentralregierung gelang es ihm tatsächlich, die Kontrolle über Italien und große Teile Galliens zeitweilig wiederzuerlangen; die Westgoten und Burgunden wurden wenigstens vorübergehend ruhiggestellt. Auch Teile Hispaniens konnte Majorian - seit langem der erste und zugleich der letzte Westkaiser, der selbst ein Heer befehligte - befrieden. Innenpolitisch gelang es, den Senat durch mehr Zugeständnisse und das Volk durch eine verbesserte Wirtschaftspolitik vorerst auf seine Seite zu bringen; in der Stadt Rom ließ man Renovierungsarbeiten an öffentlichen Gebäuden durchführen. Von Papst Leo wurde er jedoch nicht als Kaiser anerkannt, da er aus Sicht der Kirche zu tolerant gegenüber Häretikern (insbesondere jenen Christen, die das Konzil von Chalkedon nicht anerkannten) agierte. Majorian wurde, nachdem eine Strafexpedition gegen die Vandalen 460 bereits im Ansatz gescheitert war und er sich nach Gallien zurückgezogen hatte, Anfang August 461 auf dem Weg nach Rom von Ricimer gestürzt und kurz darauf hingerichtet. Ricimer konnte jedoch als Arianer (Anhänger einer nicht-orthodoxen christlichen Glaubensgruppe) und Nicht-Römer offenbar nicht selbst die Herrschaft übernehmen. Entscheidend war aber wohl, dass das zunehmend machtlose und in seiner Handlungsfähigkeit eingeschränkte Kaisertum des Westens für tatkräftige Männer wie ihn mittlerweile nur noch bedingt von Reiz war: Die Position des starken Mannes hinter dem Thron war jetzt attraktiver.[4], 22528\u003dAls hochrangiger Senator wurde zunächst Petronius Maximus in dem Chaos nach dem Tode Valentinians III. (16. April 455) Kaiser. Er versuchte, sein Kaisertum dynastisch, durch Einheirat in die theodosianische Dynastie, zu legitimieren, verlor als Zivilist jedoch schnell die lebenswichtige Unterstützung des Heeres. Auf der Flucht vor einem erneuten vandalischen Plünderzug in Rom wurde Petronius am 31. Mai erschlagen. Die Vandalen raubten eine Tochter Valentinians III., und in den Jahren nach ihrem Romzug 455 eroberten sie den Rest Nordafrikas, Sizilien, Korsika und die Balearen, was die römische Seehoheit im Mittelmeer beendete, und verheerten die Küsten. Ein Sieg über Geiserichs Vandalen und die Rückgewinnung des reichen Nordafrika wurde damit endgültig zur Überlebensfrage für Westrom., 27240\u003dRicimers Hauptanliegen war die Verteidigung Italiens, am Rest des Westreichs hatte er nur nachgeordnetes Interesse; dies mag auch der Grund für den Bruch mit Majorian und den anschließenden Militärputsch gewesen sein. Auf Ricimers Betreiben wurde nach einem Interregnum im November 461 der Senator Libius Severus neuer Kaiser von Westrom, da der übermächtige General auf einen Augustus auf Dauer nicht verzichten zu können glaubte. Dieser wurde aber von Ostrom nicht anerkannt und blieb daher formal ein Usurpator. Unter seiner Regierung begannen die Plünderungen der Vandalen an der italischen Westküste erneut, und die Lage wurde immer kritischer. Währenddessen hatte sich der Heermeister Galliens, Aegidius, ein Freund Majorians, gegen Ricimer und die Regierung in Ravenna erhoben und in Nordgallien, gestützt auf die Reste der Rheinarmee, ein gallo-römisches Sonderreich errichtet, das bis 486 Bestand haben sollte. Nach vier Jahren starb Libius Severus 465 (angeblich von Ricimer vergiftet). An seine Stelle trat 467, nach einer zweijährigen Thronvakanz, während der der Kaiser in Konstantinopel formal auch über den Westen herrschte, der oströmische Aristokrat und Militär Anthemius. Dieser wurde vom oströmischen Kaiser Leo I. mit Geld und Truppen ausgestattet; er gilt gemeinhin als der letzte wirklich handlungsfähige und tatkräftige Herrscher Westroms. Ricimer und Anthemius verfolgten als vordringliches Ziel die Wiederherstellung der kaiserlichen Herrschaft gegenüber den Vandalen zur Sicherung Italiens. Die Flotte des römischen Generals Basiliscus verbuchte einige erste Erfolge. 468 kam es dann zu einer großen Flottenexpedition, bei der oströmische und weströmische Truppen gemeinsam gegen die Vandalen kämpften. Doch überraschend besiegten die Vandalen Basiliscus vor der afrikanischen Küste. Nun versuchte Anthemius sein Glück in Hispanien. Doch der Feldzug gegen die Westgoten, die unter ihrem König Eurich den Vertrag von 418 gebrochen hatten und seit 469 weitere Gebiete eroberten, blieb erfolglos und führte letztlich zum Bruch zwischen dem Kaiser und Ricimer. Diese letzten kriegerischen Anstrengungen hatten die finanziellen und militärischen Möglichkeiten Westroms stark strapaziert. Hispanien ging nun verloren. Auch Ostrom hatte einen großen Teil seines Staatsschatzes in die Flottenexpedition gegen Geiserichs Vandalen gesteckt und konnte dem Westen nun nicht mehr helfen. Schließlich brach wegen der Konflikte zwischen Ricimer und dem Kaiser, der nicht nur eine Marionette seines Heermeisters sein wollte, ein Bürgerkrieg aus. Dabei stand die Kirche auf der Seite des Heermeisters, denn Anthemius war aufgrund einer toleranten Religionspolitik beim römischen Bischof in Ungnade gefallen.[5], 34289\u003dIm Jahre 474 wurde Glycerius von dem oströmischen Heerführer Julius Nepos, der mit Truppen in den Westen gesandt worden war, abgesetzt und abgelöst. Julius Nepos wollte den Konflikt mit den Westgoten zunächst diplomatisch lösen. Der Erfolg war mäßig. Inzwischen hatten die Vandalen das ganze westliche Mittelmeer unter ihre Kontrolle gebracht. Schließlich wendete sich auch das Blatt in Rom gegen ihn: Sein Patron Flavius Orestes, der für sich in Anspruch nehmen konnte, Sekretär des Hunnenkönigs Attila gewesen zu sein, übernahm die Heeresführung, jagte Nepos im August 475 aus dem Amt und setzte, obwohl er selbst hätte Kaiser werden können, lieber seinen Sohn Romulus Augustus als Strohmann auf den Thron - so unattraktiv war das westliche Kaisertum inzwischen für machtbewusste Männer geworden. Nepos konnte sich in der Provinz Dalmatia allerdings noch bis 480 halten, bis er dort - vermutlich auf Veranlassung Odoakers, vielleicht aber auch auf Anstiftung des Glycerius, der nach seinem Sturz Bischof geworden war - ermordet wurde.}","lastModified":"","textBeforeTable":"Liste der weströmischen Kaiser Der Niedergang des weströmischen Kaisertums und der Stadt Rom ging einher mit dem Aufstieg der Kirche. Seit dem 5. Jahrhundert war der Einfluss des Bischofs von Rom stetig gewachsen. Im späteren 6. Jahrhundert rückte er zunehmend an die Stelle der zerfallenden weltlichen Autoritäten in der Stadt, und spätestens seit Gregor dem Großen agierte der Bischof, nunmehr als Papst, mehr oder weniger als Stadtherr Roms. In der Nachfolge der Kaiser beanspruchte er fortan als Bischof des caput mundi die Oberhoheit über die Christenheit. Um 534 dürfte die Stadt noch immer um die 100.000 Einwohner gezählt haben. Dann markierte der Krieg des oströmischen Kaisers Justinian I. gegen die Ostgoten die eigentliche Zäsur in der Stadtgeschichte: Zwischen 535 und 549 wurde Rom mehrfach belagert, die lebenswichtigen Aquädukte zerstört sowie ein Großteil der Senatoren deportiert oder getötet. Den letzten Schlag für die antiken Strukturen Italiens stellte dann der Einfall der Langobarden 568 dar, wenngleich Rom selbst nicht erobert wurde. Der weströmische Senat verschwand bald darauf (um 590). Im Mittelalter lebten nur noch höchstens 20.000 Menschen in der Stadt. Auf dem Forum Romanum, dessen letztes antikes Monument, die Phokas-Säule, 608 errichtet worden war, wurde schließlich Ackerbau betrieben. Antike Bauten dienten als Steinbruch oder wurden durch Umbauten auf niedrigem Niveau zweckentfremdet. Der Niedergang des Weströmischen Reiches machte sich auch in der Stadt Rom bemerkbar: Die Stadt, in der um 250 nach Christus über 1 Million Menschen gelebt","textAfterTable":"Legende: Farbe Bedeutung Unterkaiser oder Mitregent Gegenkaiser oder Usurpator Siehe auch Römisches Reich Spätantike Völkerwanderung Untergang des Römischen Reiches Liste der römischen Kaiser der Antike Literatur Vergleiche auch die entsprechenden Abschnitte zur späten römischen Kaiserzeit. Henning Börm: Das weströmische Kaisertum nach 476. In: Josef Wiesehöfer u.a. (Hrsg.): Monumentum et instrumentum inscriptum. Stuttgart 2008, S. 47-69. Averil Cameron u.a. (Hrsg.): The Cambridge Ancient History. Bd. 13 und 14, 2. neugestaltete Aufl., Cambridge 1998–2000. (Hervorragende Gesamtdarstellung; dort findet sich auch weiterführende Literatur, größtenteils jüngeren Datums.) Alexander Demandt: Die Spätantike. 2. erweiterte Auflage. München 2008. (Solide und gut lesbare Darstellung, die aber nicht immer den aktuellen Forschungsstand wiedergibt.) Adrian Goldsworthy: The Fall of the West. London 2009. (Populärwissenschaftliche Darstellung.) Andreas Goltz: Marcellinus Comes und das \"Ende\" des Weströmischen Reiches im Jahr 476. In: Dariusz Brodka u.a. (Hrsg.): Continuity and Change. Studies in Late Antique Historiography (Electrum 13). Krakau 2007, S. 39-59. Guy Halsall: Barbarian Migrations and the Roman West, 376–568. Cambridge 2007. Peter J. Heather: The Fall of the Roman Empire. London 2005. (Detaillierte Darstellung des Untergangs Westroms; vor allem hinsichtlich militärgeschichtlicher Fragen sehr nützlich.) Dirk Henning: Periclitans res Publica: Kaisertum und Eliten in der Krise des weströmischen Reiches,","hasKeyColumn":true,"keyColumnIndex":0,"headerRowIndex":0}