{"relation":[["Party","Unity List","Socialist Party","Social Democrats","Social Liberal Party","Christian Democrats","New Alliance","Liberal Party","Conservative Party","Danish People\u0027s Party"],["05-02-08","3,4","6,0","25,8","9,2","1,7","","29,0","10,3","13,3"],["Min","1,7","10,8","24,5","5,7","0,6","3,8","24,5","8,4","12,2"],["Max","2,2","13,4","25,5","7,0","1,2","7,2","25,7","10,1","13,4"]],"pageTitle":"Ups and Downs in the Campaign at Jacob Christensen","title":"","url":"http://jacobchristensen.name/2007/11/08/ups-and-downs-in-the-campaign/","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"RELATION","tableNum":0,"s3Link":"","recordEndOffset":0,"recordOffset":0,"tableOrientation":"HORIZONTAL","TableContextTimeStampBeforeTable":"{285\u003dI was a little curious about how support for the parties has varied during the campaign. Here are the highs and lows according to Gallup’s almost-daily index from 24 October to 7 November:}","TableContextTimeStampAfterTable":"{6038\u003dTagged with Denmark, Elections 2007, 5811\u003dNovember 8th, 2007 at 5:00 pm, 5008\u003dAfter the Election: First Thoughts... On the Second and Third Day of Campaigning... The 2012 Budget...}","lastModified":"","textBeforeTable":"I was a little curious about how support for the parties has varied during the campaign. Here are the highs and lows according to Gallup’s almost-daily index from 24 October to 7 November: without comments Ups and Downs in the Campaign Notes from the Outside of the Inside Jacob Christensen","textAfterTable":"I find the stability of the Liberals and Social Democrats interesting. (Both parties record new maximum values in Thursday’s index). Share this: Print Email Facebook After the Election: First Thoughts... On the Second and Third Day of Campaigning... The 2012 Budget... Related posts brought to you by Yet Another Related Posts Plugin. Written by Jacob Christensen November 8th, 2007 at 5:00 pm Posted in Politics Tagged with Denmark, Elections 2007 « Horse Race Coverage Lies, Damned Lies and Professional Cycling » Follow @jacobchr Pages","hasKeyColumn":true,"keyColumnIndex":0,"headerRowIndex":0}