{"relation":[["Questions","What did Solomon have many of that turned away from the Lord?","What Edomite was an enemy of Solomon during his life?","Who was Solomon\u0027s servant that rebelled against him?","How long did Solomon reign in Israel?","Who was Solomon\u0027s son that reigned after his death?","What book of the Bible does Solomon share his wisdom?","What did Solomon want his readers to get out of the book from question 16?","What book of the Bible is based on songs and poetry by Solomon?","What two types of flowers does Solomon refer to his love as?","When does his love come to the door?"],["Answers","","","","","","","","","",""]],"pageTitle":"Bible Trivia-Solomon Quiz - By bworden_99","title":"","url":"http://www.sporcle.com/games/bworden_99/solomonslife","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"LAYOUT","tableNum":2,"s3Link":"common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989178.64/warc/CC-MAIN-20150728002309-00273-ip-10-236-191-2.ec2.internal.warc.gz","recordEndOffset":731936367,"recordOffset":731918867,"tableOrientation":"HORIZONTAL","textBeforeTable":"Full Results Challenge Friends Replay Game Share Result Average Score: % % correct You got Enter answer: Challenge Play Timer 03:00 ll Score 0/20 var showNext \u003d true; function displayAnswer(answerSlot, answer, gameOver) { /* If the game is over and either bonus answers are wrong, or the showNext flag has been set to false, we won\u0027t display the answer text */ var showAnswer \u003d (gameOver \u003d\u003d\u003d true \u0026\u0026 (_spwr || !showNext)) ? false : showans; var theAnswer \u003d (!showAnswer \u0026\u0026","textAfterTable":"Questions Answers What did Solomon have many of that turned away from the Lord? What Edomite was an enemy of Solomon during his life? Who was Solomon\u0027s servant that rebelled against him? How long did Solomon reign in Israel? Who was Solomon\u0027s son that reigned after his death? What book of the Bible does Solomon share his wisdom? What did Solomon want his readers to get out of the book from question 16? What book of the Bible is based on songs and poetry by Solomon? What two types of flowers does Solomon refer to his love as? When does his love come to the door? You\u0027re not logged in! Compare scores with friends on all Sporcle quizzes. Connect","hasKeyColumn":false,"keyColumnIndex":-1,"headerRowIndex":0}