{"relation":[["ISBN","ISBN-13","Pages","Publisher","Published","Language","Alibris ID"],["0679441239","9780679441236","303","Knopf Publishing Group","05/1996","English","12807910118"]],"pageTitle":"Anything Considered book by Peter Mayle | 9 available editions | Alibris Books","title":"","url":"http://www.alibris.com/booksearch?qwork\u003d365251\u0026cm_sp\u003d1rec-_-RHS-_-p1-0","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"ENTITY","tableNum":25,"s3Link":"common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042991019.80/warc/CC-MAIN-20150728002311-00090-ip-10-236-191-2.ec2.internal.warc.gz","recordEndOffset":278734479,"recordOffset":278714100,"tableOrientation":"VERTICAL","TableContextTimeStampAfterTable":"{31774\u003d1996, Knopf Publishing Group, 31833\u003dISBN-13: 9780679441236, 131519\u003dPublishers Weekly, 1997-03-17 Mayle\u0027s third fictional trek through the French countryside, involving an English expat and a secret formula for the cultivation of truffles, was a four-week PW bestseller. (Apr.) (c) Copyright PWxyz, LLC. All rights reserved, 123577\u003d1996, Hardcover, 127372\u003d1996, Audiobook cassette, 99006\u003dGood. 1997-Paperback-Used-Good--Shows some shelf-wear. May contain old price stickers or their residue, inscriptions or dedications from previous owners in first few pages and remainder marks.-. -Hall Street Books proudly ships from Brooklyn, NY. All orders are processed and shipped within 24 business hours, Mon-Fri. Expedited shipping and tracking available within the US. Hall Street\u0027s No-Worry guarantee lets you buy with confidence!, 121682\u003d1997, Mass-market paperback, 28455\u003d1997, Penguin Books Ltd, 113980\u003dISBN-13: 9780679762683, 47264\u003d1997, Penguin Books Ltd, 122627\u003d1997, Hardcover, 123704\u003d9780679441236, 131800\u003dPublishers Weekly, 1996-05-06 Again venturing into the wryly humorous thriller territory of Hotel Pastis, Mayle has produced another caper heavily larded with local color and gastronomic adventures. And again, as in his novels and his nonfiction evocations of Provence, truffles play a crucial role. Here his protagonist is Bennett, a Brit expatriate on his uppers. Having lost his savings in an investment scam, he is intent on finding the means to reside in Saint-Martin in Provence. He advertises his services: \"Anything considered except marriage\u0027\u0027-and is hired by Julian Poe, a stupendously wealthy fellow Brit, who needs help in evading the French income tax. Pretending to be Poe in the latter\u0027s Monaco apartment, Bennett becomes involved in the hijacking of a case containing the secret formula for the successful cultivation of the elusive black truffle. When the Italian Mafioso who stole the formula auctions his loot aboard his yacht, Poe, scheming to substitute a fake, sends Bennett to steal it back. He also sends Anna, a savvy and sexy mercenary enforcer from New York, to help protect his interests. After they recover the formula, Anna persuades Bennett to up his fee to a cool million. With the furious Italians joining Poe in the hot pursuit, the now romantically involved extortioners gormandize their lusty way across the south of France while outwitting their pursuers. Mayle makes froth highly palatable in this larky chronicle of sybaritic pleasures and larcenous activities. 150,000 first printing; BOMC and QPB selections. (June), 30115\u003d1997, Vintage, 120859\u003d9780679762683, 53790\u003d1997, Vintage, 60346\u003d1996, Knopf Publishing Group, 115640\u003dISBN-13: 9780679441236, 120726\u003d1997, Trade paperback, 128314\u003d1991, Hardcover, 152625\u003dTerms of Use | Privacy Policy | Recommendations by Simularity | Copyright © 1998 - 2015 Alibris. All rights reserved., 125460\u003d1996, Trade paperback, 30159\u003dISBN-13: 9780679762683}","textBeforeTable":"Details + $3.99 shipping Add to Cart $0.99 Mass-market paperback, Very Good 1997, Penguin Books Ltd \u003c See All Copies Next\u003e 10 9 8 7 6 5 4 3 2 43: 1 1 of Page $0.99 $15.00 Add to Cart Once Upon A Time Books BEST Tontitown, AR, USA 1997, Vintage ISBN-13: 9780679762683 Trade paperback, Good $0.99 $15.00 Add to Cart thriftbooks","textAfterTable":"Shipping Options: Standard Shipping: $3.99 *You will be able to select a shipping option during Checkout. Shipping costs can vary based on destination. Sold by the3purrs Books BEST Ships from Barberton, OH, USA Questions? Contact the seller. Seller\u0027s Description Very Good. Very good condition with some edgewear. \u003c See All Copies 1997, Vintage Trade paperback, Very Good $0.99 $15.00 Add to Cart + $3.99 shipping Details ISBN 067976268X ISBN-13 9780679762683 Pages 320 Publisher Vintage Published 1997 Language English Alibris ID 12187100943 Shipping Options: Standard Shipping: $3.99 Trackable Expedited: $7.99 *You will be able to select a shipping option during Checkout. Shipping costs can","hasKeyColumn":true,"keyColumnIndex":3,"headerRowIndex":0}