{"relation":[["147","96","71","62","62","49","47","42","42","40","39","38","33","31","29","29","28","28","28","27"],["*** This Week Through YOUR m4/3 2015.08.01 ***","Good bye to an old friend, and an entire brand and system","PART 2 *** This Week Through YOUR m4/3 2015.08.01","a6000 users - when do we abandon hope?","Mini Challenge #386 ***At the Fair***","How many still on the fence on A7R Mark II?","My A7RII shows concentric ring artifacts","Just can\u0027t get my head around going back now to flapping mirrors","****This week with your A7x, 8/01/2015****","First comparison - A7RII vs A7RI Photos","How to avoid this false advertising?","Who would love to have touchscreen on the higher-end Sony cameras?","Are you a happy camper?","Canon 5D Mark III vs Sony A7RII vs A7 Low Light/ISO/Noise","More than once in a blue moon (FZ1000)","Image-resource released GX8 samples.","Is 9mm wide enough for landscapes?","Lumix GX8\u0027s Dual Image IS Sample Images","Anyone see that crazy moon last night?","And they said it couldn\u0027t be done..."]],"pageTitle":"Art or intrusion? Photographer Johnny Tergo\u0027s \u0027drive-by\u0027 portraits: Digital Photography Review","title":"","url":"http://www.dpreview.com/articles/2517968313/johnny-tergo-drive-by-portraits","hasHeader":false,"headerPosition":"NONE","tableType":"ENTITY","tableNum":16,"s3Link":"common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989178.64/warc/CC-MAIN-20150728002309-00273-ip-10-236-191-2.ec2.internal.warc.gz","recordEndOffset":416529007,"recordOffset":416493488,"tableOrientation":"HORIZONTAL","TableContextTimeStampAfterTable":"{42729\u003dhttp://www.nytimes.com/2006/03/17/arts/17iht-lorca.html?_r\u003d0 America land of lawsuits...I would still ask for model release signature., 17053\u003dAs long as you have money to afford good lawyer you can sue photographer anytime http://www.nytimes.com/2006/03/17/arts/17iht-lorca.html?_r\u003d0, 65470\u003dOther than the fact Tergo\u0027s images are a bit rawer and less polished, and arguably less artistic, how are they fundamentally different in process from the sidewalk strobe photos taken by celebrated art photographer Philip Lorca Dicorcia. Google his name for images and decide for yourself. Dicorcia set up a camera, a strobe and triggering mechanism on a covered sidewalk and took random portraits of people in New York. He blew them up in all their exquisite detail, printed a book and sold prints for $20 -30 thousand dollars each. He was sued by the elderly Jewish man you\u0027ll see in the Google images for violating his privacy and won. see also: http://www.nytimes.com/2001/09/14/arts/art-in-review-philip-lorca-dicorcia-heads.html ... and ... http://en.wikipedia.org/wiki/Nussenzweig_v._DiCorcia}","textBeforeTable":"}); MainSiteSearch(); { $(document).ready(function()","textAfterTable":"To take his curb-side portraits, LA-based photographer Johnny Tergo pulls up alongside his subjects and takes their photograph from his truck, using a remote-triggered Canon EOS-1D Mark IV rigged up to two studio lights. In an interview published by wired.com Tergo explains that as a freelance photographer he spends a lot of time on the road, and wanted to \u0027exploit his time behind the wheel\u0027 for a series of candid portraits of people going about their everyday lives. According to an interview published at wired.com, Tergo \u0027leads moving subjects by pulling forward slightly, waiting for them to enter the frame\u0027. To achieve the studio-like lighting, Tergo has rigged his Chevy Silverado with two high-powered strobes, powered by twin 4000W generators in the truckbed. Inside, a Canon EOS-1D Mark IV is connected to a laptop, and triggered by a Pocket Wizard. Tergo has a dashboard-mounted iPhone for reviewing his shots via onboard Wi-Fi. On a normal day, Tergo claims to take \u002740 to 50\u0027 shots.  This is Johnny Tergo\u0027s Chevy Silverado truck, rigged up with two studio strobes and twin 4000W gas-powered generators which are nestled in the truckbed.","hasKeyColumn":true,"keyColumnIndex":1,"headerRowIndex":-1}