{"relation":[["Pat","Pat","Wallander","Pat","Pat","Wallander","Pat","Pat","Fishtits","Wallander","Pat","Milkshake","Wallander","Milkshake","Mel","Claire","Pat","Pat","Pat","Pat","Milkshake","Pat","Mika","Milkshake","Pat","Mika","Milkshake","Pat","Ed","Wallander","Pat","Pat","Milkshake","Wallander","Pat","Milkshake","Pat","Wallander","Pat","Milkshake","Pat","Wallander","Milkshake","Wallander","Milkshake","Bam Bam","Milkshake","Wallander","Wallander","Milkshake","Pat","Pat","Pat","Wallander","Milkshake","Ed","Pat","Wallander","Wallander","Ed","Wallander","Milkshake","Wallander","Pat","Amanda","Milkshake","Wallander","Pat","Pat","Pat","Wallander","Pat","Wallander","Pat","Pat","Wallander","Joe","Wallander","Wallander","Ed","Pat","Wallander","Ed","Pat","Milkshake","Ed","Bam Bam","Milkshake","Jimbo","Life Enjoyer","Claire","Jim","Milkshake","Ken","Ocean","Wallander","Tom","Pat","Pat","Wallander","Ed","Pat","Joe","Loopy","Pat","Ed","Tee","Pat","Milkshake","Pat","Wallander","Pat","Pammie","Ed","Bill","Bam Bam","Wallander","Milkshake","Wallander","Milkshake","Wallander","Shel","Sue","Pat","Wallander","Wallander","Wallander","Now\u0026Here","Tom","Wallander","Wallander","Milkshake","Milkshake","Wallander","Wallander","Michael","Pat","Now\u0026Here","Wallander","Wallander","Tom","Milkshake","Michael","Now\u0026Here","Michael","Milkshake","Pat","Bam Bam","Joe","Pat","Wallander","Pat","Milkshake","Ginny","Pat","Milkshake","Wallander","Joe","Ed","Pat","Joe","Wallander","Wallander","Wallander","Pat","Wallander","Tigger Bente","Wallander","Pat","Ed","Pat","Milkshake","Pat","Milkshake","Pat","Pat","Bam Bam","Gamo_Pressure","Insider","Pat","Nadia","Tigger Bente"],["01/06/09","12/24/08","12/23/08","12/23/08","12/23/08","12/23/08","12/23/08","12/23/08","12/22/08","12/22/08","12/22/08","12/21/08","12/21/08","12/21/08","12/21/08","12/21/08","12/19/08","12/19/08","12/19/08","12/19/08","12/19/08","12/19/08","12/19/08","12/19/08","12/19/08","12/19/08","12/18/08","12/18/08","12/18/08","12/18/08","12/18/08","12/17/08","12/17/08","12/17/08","12/17/08","12/17/08","12/16/08","12/16/08","12/16/08","12/15/08","12/15/08","12/15/08","12/15/08","12/14/08","12/14/08","12/14/08","12/13/08","12/13/08","12/13/08","12/12/08","12/12/08","12/12/08","12/12/08","12/11/08","12/11/08","12/11/08","12/11/08","12/11/08","12/11/08","12/11/08","12/11/08","12/11/08","12/11/08","12/11/08","12/10/08","12/10/08","12/10/08","12/10/08","12/10/08","12/10/08","12/10/08","12/10/08","12/10/08","12/10/08","12/09/08","12/09/08","12/09/08","12/09/08","12/09/08","12/09/08","12/09/08","12/09/08","12/08/08","12/08/08","12/08/08","12/08/08","12/07/08","12/07/08","12/07/08","12/07/08","12/07/08","12/06/08","12/06/08","12/06/08","12/05/08","12/05/08","12/05/08","12/05/08","12/05/08","12/05/08","12/04/08","12/04/08","12/04/08","12/03/08","12/03/08","12/03/08","12/02/08","12/02/08","12/02/08","12/02/08","12/02/08","12/01/08","12/01/08","12/01/08","12/01/08","12/01/08","12/01/08","11/29/08","11/29/08","11/28/08","11/27/08","11/27/08","11/27/08","11/26/08","11/26/08","11/25/08","11/25/08","11/25/08","11/25/08","11/25/08","11/25/08","11/25/08","11/25/08","11/25/08","11/25/08","11/24/08","11/24/08","11/24/08","11/23/08","11/23/08","11/23/08","11/22/08","11/22/08","11/22/08","11/22/08","11/21/08","11/21/08","11/21/08","11/21/08","11/21/08","11/21/08","11/21/08","11/20/08","11/20/08","11/20/08","11/20/08","11/20/08","11/20/08","11/20/08","11/20/08","11/19/08","11/19/08","11/19/08","11/19/08","11/19/08","11/19/08","11/19/08","11/18/08","11/18/08","11/18/08","11/18/08","11/18/08","11/18/08","11/17/08","11/17/08","11/17/08","11/17/08","11/17/08","11/17/08","11/17/08","11/17/08","11/17/08"],["10:44am","6:19am","6:44pm","1:47pm","1:14pm","11:50am","5:55am","4:48am","11:13pm","6:34pm","9:44am","12:20pm","11:10am","9:42am","9:08am","2:27am","2:32pm","1:50pm","1:25pm","12:32pm","12:04pm","11:56am","9:24am","8:56am","5:25am","1:40am","5:32pm","3:39pm","8:48am","7:05am","3:17am","4:00pm","1:35pm","12:15pm","9:26am","8:36am","2:00pm","11:29am","4:53am","2:01pm","11:57am","10:55am","7:46am","9:57pm","9:05am","7:29am","7:22pm","4:56pm","2:41am","7:14pm","2:45pm","10:27am","6:00am","8:55pm","2:41pm","1:52pm","12:44pm","11:14am","10:54am","10:51am","8:52am","8:15am","7:11am","5:11am","7:41pm","7:21pm","2:10pm","2:05pm","1:28pm","1:01pm","12:41pm","11:55am","9:11am","5:02am","1:12pm","12:25pm","9:24am","9:04am","8:05am","7:41am","6:05am","5:21am","1:37pm","11:07am","7:44am","5:10am","7:34pm","12:14pm","9:13am","7:46am","6:20am","3:10pm","9:14am","3:51am","8:39pm","8:26pm","4:14pm","2:31pm","12:27pm","10:53am","5:22am","4:21am","4:21am","3:58pm","2:17pm","5:40am","8:18pm","2:51pm","1:09pm","12:24pm","11:09am","2:41pm","12:04pm","11:36am","11:10am","8:45am","12:44am","9:19am","3:01am","8:30am","11:46pm","4:17pm","8:37am","3:30pm","1:05pm","8:40pm","8:37pm","4:40pm","3:07pm","12:11pm","11:44am","11:36am","9:07am","5:36am","2:50am","6:18am","6:00am","4:08am","8:10pm","2:00pm","9:39am","7:43pm","3:15pm","2:28pm","1:28am","7:51pm","2:54pm","11:49am","9:51am","8:42am","5:56am","4:02am","7:06pm","2:53pm","11:13am","9:32am","7:26am","6:28am","5:25am","3:40am","5:29pm","3:49pm","3:15pm","2:10pm","11:34am","9:12am","1:55am","5:24pm","2:22pm","11:48am","10:21am","8:57am","8:24am","6:57pm","2:36pm","12:23pm","9:01am","8:18am","7:19am","5:57am","5:31am","12:58am"],["I miss you!","Wallander, sweetie, you are a nut in a good way, always a good way. I think if we lived close to each other we would be such good friends. That is how I love you, even though we just go by what is on here. I even have a telescope for being out under the stars and looking at even some of the planets and enjoying talking to each other.","LOL....ok fine, i give up...i\u0027m a nut....but in a good way...always in a good way. Hope you\u0027ll have a GREAT Xmas Pat....until we talk again in the new poll after this one. : )","I\u0027m heading home. I hope I can get back in here tomorrow. If not, see ya on the next page. Still love ya, you flirt.","Wallander, you are so sweet and I love our flirting. Until you find your dream girl...then I guess I\u0027ll boo-hoo. Laughing so much. Man, you are a nut!","Haha...WOW...you\u0027re right Pat, he doesn\u0027t sound very clever. I am 38 yrs old. And i know what you\u0027re going to ask...\u0026 my answer to you is, i don\u0027t know why!?? I just think you\u0027re a lovely dame.","Oh yeah, about his family, they seemed like they were a loud, funny, fun-loving to the hilt kind of people. They told me about their hunting and showed me all the guns and knives and other things they had. At that time all the weapons made me stop and think, but I proceeded on. I understand hunting to feed a large family of eleven, including the parents. After we married, I learned over time they were a bunch of tough *ss rednecks that love to kill lots of animals, not just for food. Just kill it and leave it there and they liked to torment each other. We were married for two years before I had a baby, I should have walked away then, but I couldn\u0027t.","Wallander, what question? And how old are you? The truth now.","\u003esquirting fish milk\u003c","You were absolutely right in your previous comment from last Thursday. I need to get A LOT better at talking \u0026 listening...especially the last part. I dont know when it happened but at some point i decided to close my heart to the outside world, and unfortunately my ex had to pay the price for it as well. So all in all, it was a GOOD thing that she let me go, however painful it may have been for both her \u0026 myself. And again you\u0027re correct with regards to how i SHOULD be perceiving these events in my own life...instead of seeing them ONLY as emotional losses, i need to learn to look at them as \"completions\", and by doing that i can always turn a painful turn of event into a VERY POSITIVE thing for myself. Btw before i end this comment, i have two things to say; 1st of all, i liked your somewhat older comment regarding being a \"salmon\". I really liked that metaphor because i can also identify with that feeling myself. And 2ndly in your comment from last Thursday(again), you said that you \"should have seen the red light when meeting his family\"....what was it about your ex\u0027s family that should have caught your attention, if you dont mind my asking? You dont have to be so specific if you dont want to...just as a whole? Last but not least, your very last comment was VERY gracious. I totally understand the marriage thing...that whole 70\u0027s-80\u0027s \"get laid\" mentality is just not right these days...it\u0027s much too painful. If i get rich by next yr. i\u0027ll make sure to ask you again..;-)... that is, if you\u0027re still \"available\" by then, ofcoarse. Anyways Merry Xmas to everyone from mysticgames poll. :-)))","You naughty man, Wallander. I\u0027ll have to talk to Santa to visit you. Sorry, sugar-pie, honey-bun, but you couldn\u0027t get me in the sack unless we were married and we both know that\u0027s not gonna happen. That\u0027s cool, I am that faraway star...to long for, but can\u0027t reach. I do love you.","Given the 4 choices we have on this poll, it looks as though it came out to be a close tie. I think it matters more on everyones income and bills rather than thier heart. Okay, with that said........NEXT POLL?????","LOL....Milkshake i have a feeling you\u0027re like Will Ferrell in ELF. I saw the movie yesterday. He\u0027s fantastic in that movie. But i was VERY thankful to read both Ed\u0027s \u0026 Pat\u0027s posts. Ed, i consider you almost as a \u0027brother\u0027. I hope you have a nice \u0026 cozy time up in your cabin. That sounds really cool though...are you going to hunt for food, \u0026 stuff like that?? There\u0027s NOTHING as refreshing as camping out in the nature. You become WHOLE again. Hey Pat, i\u0027m going to keep this one short because i need to re-read your entire post, but i just wanted to say you have SO MUCH to give...if i lived close to you, i would have put on my BEST charming act, just to get you in the sack!!!! OMG did i say that??? ***Wallander looking at a distant star out the window \u0026 sighing....\u0026 deciding to call it \"Pat\" *** :-D .......i\u0027m going to post a better response to your last comment, a little later on Pat. For now, Happy Holidays everyone.... :-)))","Maybe next poll can be about which Christmas show we like best?.......Frosty the Snowman, Rudolph, A Charlie Brown Christmas, Santa Claus is Coming to Town, etc.........My all time favorite is Rudolph the Rednose Reindeer. I still cry when I watch Rudolph and Bambi. Have a Merry Christmas everyone!!","Santa has been arrested for been drunk and disorderly Beam me up Scotty","It is time desperately for a new poll!","Have a nice weekend, everyone. Good night, Wallander, talk to you Monday. Love ya.","Mika, I was checking out Warsaw. I was thinking it was in Russia. I didn\u0027t realize it was Poland. Now I see why you said you were the new pole. I didn\u0027t catch it, that\u0027s funny.","I went back through the polls of this year and this poll is the 2nd longest one. I hope the pollster is okay. I saw Thomas\u0027s name. Wonder where he went to?","Mika should come by and pick us up.","Maybe on your trip to the North Pole Mika, you can meet Santa Claus and Rudolph!","Bring back something great!","I,m going to the north pole","Hi Mika. I\u0027m Milka. Welcome to the poll.","Milkshake, that was so funny. Let\u0027s be kids! Whoopie! Santa and his reindeer and Rudolph are coming! Oh boy!!! Mika, are you saying that you are the pollster or are you saying that we can talk about Warsaw? Have you given comments in any of the past polls under this name or an anonymous name? I still feel that the pollster is close. What was your other name in here? I am so curious. If you don\u0027t want to say, that\u0027s okay. What is it like living in Warsaw? How expensive is a loaf of bread? Is it still over five dollars? Do the people there have to still stand in long lines just to get a little bit of food?","Hi everyone Im the new pole Im 36 years old and from Warsaw","Gee! I wonder what or new poll will be about? Hmmm.....Im sure it\u0027s something interesting. Maybe if there is such thing as a Santa Claus? Or Rudolph? Is Rudolph\u0027s nose really red? When will we have new poll????????????","Wallander, that\u0027s sad you had to go through that. Some women and men can hide their feelings when going through a bad marriage or at the end of a marriage that has started going bad. I was relieved and hurt at the same time when we split, h*ll, I went through many different emotions for a while, until I dug deeper into spiritualism and mysticism. The only thing good that come from our marriage are \"my\" two kids. Wallander, it is not good for a person\u0027s mind, body and soul to have to carry the other one in a marriage. Walking hand in hand through life with some light arguments and disagreements and lots of talking and loyalty and romance is a marriage. Even in rough patches, healthy arguing and forgiving is normal. The making up should be soooooo wonderful. I know there are still marriages out there like that, but they are few and far between these days. It\u0027s especially bad when kids are involved. You didn\u0027t really sell yourself short and don\u0027t look at the battles being in vain. Take it as a life lesson learned and someday you will meet the true love of your life and the past experience will be used to help each other through hard times that will appear from time to time. Talking and listening are very important in a marriage. You are right about my ex as far as feelings go. He really didn\u0027t have them, it was just lust. If I hadn\u0027t been so young and inexperienced I wouldn\u0027t have gotten with him. I knew him from high school and I was scared of him because he was wild. He was so smart, but he quit and around 2 yrs. later we met again, started dating and 5 mos. later, we married. Before we married I met his family and that\u0027s when I should have seen the red light. That\u0027s why I said one time, that in my next life I am going for the geek, not the bad boy. As far as my \"dad\" goes...he is 86 and my brother in the other state we came from, said he is as mean and evil as he always was. Maybe he will change on his death bed, but I won\u0027t be there. I don\u0027t hate him or love him anymore, I don\u0027t feel anything. Love ya. Ed, we are all wondering about the pollster. Maybe the person is giving us a reprieve until after the holidays. To me, for some reason, it doesn\u0027t feel like Christmas this year. From your description of what your ex looked like the last time you saw her, she may be on hard drugs. If she is not careful with drugs and these men, she might catch something that could kill her. But if she wasn\u0027t a faithful wife, I\u0027m sure you could care less. The sanctity of marriage is getting lost in the shuffle just like morals. How is she with the kids? I think you said you had a daughter and a son. I can\u0027t remember. There are good men that marry the wrong person and there are good women that marry the wrong person. Like I told Wallander, maybe someday a good woman will enter your life, also. Just be careful that you don\u0027t judge her by what your ex was like. I know I missed my soul mate, but I\u0027m okay with that. I\u0027ve been single for so long, I don\u0027t think I would be happy being married anymore. I can understand the tripping, but tsk, tsk, tsk. I\u0027m feeling okay, except I have no energy at all. Thank you for the prayers. I still believe in miracles. I enjoy talking to you, too. Remember when we were snapping at each other? I laugh at it, because it was so silly. You have a Merry Christmas and a Happy New Year. I will miss you, but enjoy your time in the woods. I envy you going to your cabin in the woods, that is heaven. Just kidding about the envy(wellll, a little bit). Relax. Love ya. I\u0027m heading home.","Hi Everyone, I\u0027m still around. I am waiting for a new poll. What happened to the poll master---was he or she fired or on vacation. Please for Christmas can we have a new poll.........Hi Pat and Wallander hope things are ok for you both. With the Christmas season I have been trying to get in the spirit and I do fine during the day, but when evening comes I find myself starting to get upset. So to try and get through it. I am remodeling my basement. It keeps my mind on other things. Talking about X\u0027es (I hope that is correct) I saw mine the other day. She looks like a ****. I was hoping she did not see be but she did and came over to my table in the restaurant and just sat her self down. She changed alot in the looks department. She dresses like a ****, but her big mouth has not changed. Bragging about all the men she is dating. I looked up at her and corrected her by saying \"you mean all the men your sleeping with.\" I also told her how bad she looked and asked if she was on drugs. She naturally got upset and tried to hit me, big mistake. Lets just say she picked herself off the floor and left. Please don\u0027t get me wrong. I do not hit women, never have and never will. she just tripped over my outstreched big foot. :) I respect women and I love all women. I just was not expecting to ever see her again...I am glad we are divorced. Well enough of my screwed up life. How is everyone else. Pat how are you feeling? I pray to God that you will be ok. You are a very special person and I enjoy talking with you. Wallander how is it going my friend. I just want to say thanks for your support. I pray and wish you both the very best especially now at Christmas. This time of year is special and magical so please enjoy it. Take care! I am going to be out of town for two weeks. I am going to my cabin in the woods to get away for a while. So I will talk to you next year. :)","Looking back now, i think i was \"trying hard to wear a smile\" because i felt i had to do it in order to give my ex a feeling of satisfaction about her own decision to end our relationship. I was just trying to spare her from my own feelings of hurt ego. That\u0027s about the best way i can put it. I was basically hurt that she wasn\u0027t willing to save our relationship, the way i was willing to do(despite the fact that i was in serious doubt, myself). I wanted so badly to remind her how in numerous occasions i was hurt \u0026 disappointed by her, but in the end i always fought to save our relationship from falling apart...how so many times, i put my own ego aside just to pick her up from her own slumps(is that the right word btw?). The long \u0026 the short of it is, that in the end i felt as though i had sold myself short all that time, and all my battles had been in vain. Anyways i\u0027m pretty sure my story is NOT in any way unique, seen in a larger perspective...but it still doesn\u0027t change the fact that it hurt like hell. With regards to your ex, i believe everything you\u0027re saying. Apparently he had a strange idea of \"unconditional love\"....or maybe he didn\u0027t have/feel any AT ALL. I mean, is it just me, or isn\u0027t the whole idea of a marriage supposed to be, to be able to merge or \"melt together\" \u0026 become ONE?? I don\u0027t know, maybe i\u0027m being naive or \"immature\" in my way of looking at a relationship. The story of your father made me rather sad...but he had around 40 yrs. to try to improve his way of doing things, and he failed to do so. But i appreciate the fact that you\u0027ve brought it up in here, because there is a moral lesson to be learnt from this tragic story, and that is to STOP CLINGING ONTO YOUR OWN EMOTIONS, AS IF IT IS MEANT TO BE SOMETHING CONSTANT, UNCHANGEABLE \u0026 INFLEXIBLE......and STOP CONFUSING PRINCIPLES WITH EMOTIONS...\u0026 VICE VERSA.","Good morning, everyone. Well, I had hoped for a new poll this morning. Oh well. Tis the season to be jolly!","First...I\u0027d like to say that I wouldn\u0027t mind helping the pollster, also. Since some of us vote and give as many comments that we can, then are finished, then go on to converse about other things. Considering the fact, s/he is very, very nice to let us do that. The pollster might want to know based on how the voting is going and comparing it to how much the economy effects donations. Milkshake, maybe by Friday there will be a new poll(I truly HOPE.) Second, this is going to be long. Wallander, if you don\u0027t mind me asking, why did you feel you had to try hard to smile? Were you unhappy or did she expect you to smile all the time for her to feel everything was okay? Even the very best of marriages have their ups and downs. The \"downside of her personality\" might have been, maybe, just a tiny bit far to go...but then again, maybe you were trying to open up a conversation with her about the resentment and hate she was dealing with? I\u0027m not meaning it as criticism, just wondering further about it. Something in her life from childhood into adulthood somewhere made her have those emotions. Astrological signs and genetics and our surroundings all play a part in each individual personality of each person. Some people say it takes two to make a marriage...that\u0027s true, as long as both really want it to work. Some people say it takes two to break a marriage..that is not always true, because most people are dysfunctional in one way or another. A truly good-hearted person can marry a bad person and not know it. I\u0027m not talking about your ex, just in general. For an example: my mom married my \"dad\" when she was 16 and he was 32. He was very, very abusive with her (and us kids) and nearly killed her 3 different times that I can remember. This was during the times when the law did not interfere in \"domestic problems\", as they called it. After 28 yrs. she found a vicious, mean woman lawyer that chewed my \"dad\" up in court and spit him out. My mom got everything and he couldn\u0027t come around, because she could put him in jail and he loved his money too much to lose anymore of it(which was very little by then). Like you, Wallander, I used to put guilt on myself, also, for my part in our marriage breaking up, but through the years when I look back on it, he started torturing me after one week of marriage. Not beatings, but mental abuse and actual physical torture. Not counting being a manwh*re. Here is just one tiny example: When I was 7 mos. pregnant with our daughter, he went down to the basement and turned off the cold water while I was showering and burned me. I screamed and cried. He was never mean to our daughter, but when I was pregnant with our son, he was just mentally abusive with me. BUT when he started on our son, when he was a toddler, that was when he went too far. Shortly after that we split. I thought all of the things I went through was normal, because of my childhood. I didn\u0027t do anything to him in our marriage for him to be the way he was. If you think back on your marriage, maybe you really didn\u0027t do anything, either. If your ex-wife has the problems you say she has, and I do believe you, then she will never be happy even in another marriage. Someday, if she can face her demons and work on herself, then she can be truly happy, because carrying around resentment and hate is a truly heavy burden to carry. About my health, it is not anything you are saying. I have known for awhile that something was wrong with me, but like most people, I got tired of going to the doctor all the time for different things, that I should have pursued more. I pursued and didn\u0027t give up in the early 90s when I had cancer and found a doctor to listen to me. I could have pursued about my health more this time and didn\u0027t. I\u0027ll keep you up on it. Ed and Bam Bam, if you\u0027re still around, hope things are cool. Well, I\u0027m going to head home. Love ya.","Then poll master, for a nice Christmas present to all of us; can we please have an interesting, new poll?","Pat, you hit the nail on the head. I had a VERY tough time when my ex \u0026 I got seperated in 2006, and while i was slowly trying to pick up the pieces after a brutal breakup(emotionally) i was constantly reminded by all kinds of WEIRD incidents, how bitter \u0026 brutal the whole breakup was....obviously my ex couldn\u0027t stand me TRYING HARD to wear a smile on my face. But in one of our last meetings, i was talking about something related to astrology[\"what day of the month were you born?\"], and i told her rather nonchalantly that \"the downside of her day of the month, was that she had to struggle with a resentful personality\"....\u0026 suddenly i realized i\u0027d said a few words too many to her. Anyways i still take most of the blame for the way our relationship turned out in the end, BUT in the bigger picture of things, i was actually quite innocent. It was just me who was so \"blissfully ignorant\" to the fact that she had A LOT of hate issues....maybe if i KNEW it earlier, i would have treated her differently, and made her feel somehow less guilty for having such a passionate hate for so many things[it\u0027s that \"jealousy \u0026 rage\" thingy that keeps following me] but in defense of myself, i need to say that i said/did many things from a VERY PURE heart, \u0026 i NEVER IN MY LIFE meant to make her feel bad about herself. Anyways i\u0027m quite sure if she were here, you would have heard a COMPLETELY DIFFERENT account of what really took place....which ultimately leads me to the CORE of my problem right now: i\u0027m trying VERY HARD to get over the very fact that she has a different opinion of me now. But with regards to your new diagnosis Pat, i honestly don\u0027t know what to say! I somehow feel the less i say, the better the outcome of your results.....yes i\u0027m being superstitious right now. I won\u0027t even say i\u0027m going to pray for you. The only thing i\u0027ll say is, please bring us some good news, the next time you get the results of your tests....and i do NOT mean that you should stay silent just because you don\u0027t have any \"good news\". I hope you\u0027re appreciating what i\u0027m trying to say. And with regards to this poll.....i have a feeling our admin is trying to make a point! Maybe s/he would like to ask us to pay for the site.....if that is the case, i am game?! I don\u0027t mind sending a small contribution to the admin(s) of the mysticgames.com! Cheers for now...","Oh! No, Milkshake, you\u0027re not being rude. I totally agree. How many times have we asked for a new poll? That\u0027s why I said one day that the pollster must be on vacation. To me, we see how the votes are going. Time for a change. That\u0027s why we just go on with conversations, unless we protest by not coming back on until a new poll shows up. Love ya.","I don\u0027t mean to be rude, but this is the longest damn poll and we are not discussing anything about this poll......Isn\u0027t it time we make a change? Can we please have a new poll?","Hi! Wallander, I understand a little bit more why at times you have a hard time concerning your emotions about your ex. My lord, because of your ex in-law and your ex, no wonder your emotions are up and down. You are on a wild roller coaster ride and can\u0027t get off. I wonder why she wants to even know what you are up to? Is she still interested or is she just trying to mess with your head? That is so awful!!! Okay, about me. Two neurologists saw me, did a lot of tests on me all over my body, took six vials of blood and are ordering 7 or 8 tests to be done. A couple I have heard about before, the others I don\u0027t know. The top neurologist said there is something wrong deep inside my brain. Something else to scare me. And of course I cried. I am heading home now, I\u0027ll tell you more tomorrow. Love ya. Ignore any mistakes.","Hi there Milkshake, you can easily find a Biorhythm Calculator by googling it....make sure though you find the kinds that show you your rhythms on ANY DAY that you choose to see, and not just \"today\". Here is the address of one that does just that(http://www.freebiorhythm.net/biorhythm.html) Hi Pat....you\u0027ve succeeded in making me a little nervous. I\u0027m almost certain that you\u0027re going to hear something VERY serious from your Neurologist, but somehow i don\u0027t think it is going to be THAT serious. Maybe you\u0027ll have to make some radical changes in your life VERY SOON, but i don\u0027t believe it is going to be worse than that. Just a kind of \"warning\". Anyways, you\u0027ll be here either later on tonight or tomorrow(my time) to give us more details about how it went...i can\u0027t wait...i\u0027m a little anxious. But regarding your question about my ex, you know, the interesting thing is that we don\u0027t live close by each other, but the SUCKY thing is that her younger brother--with whom i had a VERY TOUGH time feeling comfortable around--lives only a few blocks away from me, and we actually run into each other once in a while...much to my own dislike. I discovered that he was playing the role of \"sister\u0027s little spy\" the first year or so i had moved into my new apartment, and i found out later on that he was rather VERY UNKIND in his observations of me, which made me EVEN MORE uncomfortable being around with the guy. The last couple of times i accidentally saw him in the street, i made a VERY conscience choice to not answer back his greeting...infact i made sure it looked as \u0027obvious\u0027 as possible, so that he\u0027d get the msg once \u0026 for all. Mind you, he was/is NOT necessarily a bad guy, infact if i somehow had known him before meeting his sister, i\u0027m pretty sure we would\u0027ve become much more friendly than we ultimately were....and i would\u0027ve been able to tolerate his annoying habits much better, but i met him approximately 1 yr after i\u0027d been acquainted with his sister, \u0026 therefore in my mind he became nothing more than an in-law to me...and i mean that in the most negative sense of the word. If it were up to me, i would have tried to establish a more EQUAL relationship with the guy, but he wanted it differently....he just wanted to me in the role of an \"older brother\" towards him, which is a nightmare scenario for MANY guys...because it gives the \"younger brother\" unlimited amount of privileges. Anyways sorry for the rant...talk to you soon...hugs. [ps!] Sorry for that misunderstanding btw Pat.","Thank you, Milkshake. I brought my mom in and fixing to leave. I am so nervous. I hope I have good news. I\u0027ll let you know either this evening when I pick my mom up or tomorrow. Love ya!","I wish you luck and love, Pat! Thanks for the advice. I don\u0027t know what my biorythm is Wallander. How do I find out?","Hi everyone. I guess people will continue to vote and we will continue our conversations. Milkshake, I\u0027m sorry your friend didn\u0027t show up for your B-day, but I\u0027m glad you got a buzz. Hopefully, watched a good movie or something? I\u0027m going to pretend right now to have Bahama Mama for your B-day and yummy is it ever good!!! Wallander, I didn\u0027t mean for that last comment to sound cocky. I was just letting you know I found it. You weren\u0027t being insistent, I thought you were very sweet in letting me know about it. I don\u0027t care what anyone thinks of me, either. As long as it is a truth about me. I do care if it is something false about me. I can get myself in trouble or not on my own and not care what anyone says, but not if someone lies on me. That I totally despise. Now about your ex...that takes time to get over. It doesn\u0027t happen fast and 3 yrs. is still a short time. Does she live in the same area as you? That would make it harder. Do you see her out sometime? Answer only if you want to. Milkshake, our mom is 72 yrs. old and she was feeling tired and wore out all the time(which it would help if she would at least semi-retire or retire, but she won\u0027t), but she bought some Royal Jelly capsules to take one in the morning and the Royal Jelly in the jar and takes one teaspoon every night. She said she can feel her energy building up and she doesn\u0027t feel wore out. My aunt is 69 yrs. old and she is doing the same thing and she said it is working for her. Now they are 72 and 69, just imagine what it could possibly do for you at the young age of 41. Wallander, I always try to go with the flow and try not to be a salmon, but the last 8 yrs. have made people be salmon and we know what is waiting for them swimming upstream. Some make it and some don\u0027t. That is exactly what stress does. Hey Bam Bam, how\u0027s things with you? Ed, are things a tiny bit better? Well, I will be gone all day tomorrow. I\u0027m seeing a couple of doctors, one is a neurologist. Everyone, wish me luck. Excuse any misspelled words.","I see, Milkshake. What does your Biorhythm say at the moment? Do you know? Mine is down to -100% on EVERY count, and they\u0027re all going to peak again(100%) around the Xmas holidays.","Thanks Wallander, but it\u0027s NOT depression.....I\u0027ve been stressed and LOW on energy.","I can tell you a number of things that can help prevent winter depression Milkshake. Btw that B-50 Vitamin sounds very interesting Bam Bam. I\u0027ll have to check that one out some other time. But my personal fav. is drinking 2 glasses of Blackberry juice per day...one in the morning \u0026 one in the evening. Eating fish(Cod) helps as well as taking Fish Oil pills regularly. Personally when i\u0027m feeling low in energy[which is sometimes an indication of depression] i try NOT to whip myself up into shape with HARD military discipline, but rather i aim solely for balance instead. The former is NOT always possible to achieve, and yet the latter is always within reach, and you actually DO feel energized after it. Fortunately life is NOT like the American Football where \"negative yardage\" is considered a NO-NO....in life you can actually USE the \"negative yardage\"....infact you can pretty much use ANYTHING, once you learn the trick of appreciating whatever that life throws at you. Anyhoo sorry for getting too moralizing in the end Milky...but you know what, i consider you as a VERY intelligent girl, and i am rather confident you\u0027ll find out exactly what you need to do in order to feel good \u0026 \u0027bubbly\u0027 deep inside. There were a couple of other things i wanted to mention, but i\u0027ve forgotten what they were....i\u0027ll post them later on, as soon as they come back to me. Hugs. :-))","Wow. Thanks Bam Bam. I am going to go to the vitamin store next week and I need as much advice I can get. I will try the vitamin B and YES I have been under alot of stress.","Milkshake. Vitamin B honey. Take a Vitamin B-50 Complex for energy. It will say B 50 complex right on the bottle. You\u0027ll notice a BIG difference after a couple of days. It\u0027s nourishment for your bod believe me and it\u0027s just a vitamin. So no shakes or hyperactivity at all. Just pure \"I feel good\" whoo! If your anything like me though with a new vitamin it will take a day or two for your digestive tract to get used to it. Always check with your Dr too. Now, if your bogged down and tired because of stress take the vitamin B for stress it will say right on the bottle for stress. It\u0027s a different mixture of B vitamins for stress and it\u0027s litte higher dose but totally safe. When I worked in the news room I needed it Big time and it saved me. I swear by it!","To anyone (Wallander, Pat, etc.....who likes to give advice).....Is there something (a vitamin, teas, etc) that a person can take or drink during the winter months that can help a person feel more energized and lively?? Just wondering.","Here is something for fun, if you\u0027re bored...a place where you can make your own comics... and here is the address: http://www.wittycomics.com/make-comic.php","It\u0027s cool Pat. Sorry for being too insistant regarding that thingy. It didn\u0027t cross my mind that it could have seemed like a Teddy Bear for little kids...LOL...but i honestly dont care one bit what ppl think. Been there, done that, got a T-shirt with the writings \"i cared what ppl thought of my things, and now i got a bleeding as.s hole to show for it\"! LoL...And you were absolutely right. During the winter we have much shorter days \u0026very long nights. It can give winter depressions to ppl with fragile state of mind. I\u0027m not suffering from that though. More like suffering from not having been able to get my ex 100% out of my system. Mind you, it is NOT an obsession. It is more like trying to shed one\u0027s own skin before moving on with your life. That\u0027s what long term marriages do to you. Anyways enough said. Have a nice weekend everyone. Btw the way you described your bday Milkshake, you made it sound fun without meaning to. :-D The next time i\u0027m here, i hope the poll has changed. Bye for now...","Well Pat. To answer your question.....I had an alright birthday. I didn\u0027t get a milkshake....hee hee. My ex boyfriend and I are speaking again. He lives in another state. He sent me some cash, which I thought was very sweet!! My dad also gave me some cash and my mom sent me a gift card to a store. I ate some sandwhiches from the deli and had a health-food desert.....yum yum. I also drank a little bit of Sherry and got a little buzzed. I know a girl named Sherry and she said she may come by. I thought it would be cool to drink a sherry with Sherry....LOL. But Sherry didn\u0027t come by so I drank sherry by myself. And now I\u0027m 41 and that was my \"alright\" birthday. Nothing excting.","Have a very nice weekend, everyone. Heading home. Love ya.","Milkshake, Now tell me about your B-day. How was it? What did you do? What did you get? Nosey, aren\u0027t I? So.......tell me, tell me, tell me! I also wish for us to have a new poll. I still believe the pollmaster is on vacation. I know there are many people out there waiting for something else to vote on and get to comment on. It just keeps hanging on like the energizer bunny.","Milkshake, he is long gone out of my life. He left in \u002781\u0027 and I told him to file for the divorce if he didn\u0027t want to stay married with me. He tried one time to get back together, but once we were apart, I knew I didn\u0027t want to get in that entanglement again. We divorced in \u002782\u0027. Anytime I feel pain, it is just the remembering of the pain he put me through all the years we were married and then the divorce. The mental pain and the physical torture I went through. I have to say there were some good times, but the bad outweighed the good. I made a comment somewhere in one poll that I could write a book on it and I believe it would sell off the shelves. Wallander, read my last comment. I found all the cool stuff about the pillow, thank you. Norway has those beautiful northern lights and is a beautiful country. Maybe your aggravation, irritation and depression comes from living in that sort of darkness time now? Just a guess. Ed, I have never flown. I am terrified of heights and planes are never being a part of my life...ever. I\u0027d for sure have a heart attack on a plane in the air. There are probably a lot of misspelled words in here. It is happening more and more. I see a neurologist next week.","Once again happy birthday to you Milkshake. I hope you have a good 365 days ahead of you...you deserve it, because i\u0027m assuming that if you\u0027ve been generally behaving the way you\u0027ve been treating me, then karmically you are supposed to have a good year. And thanks for the words of support Ed. I definitely need the change of scenery. You know, where we live, it is rather common for everyone to be going thru the winter season with a mild-to-severe \"Cabin Fever\"...and i\u0027ve been quite resistant all these yrs., but suddenly this yr. i feel it VERY intensely. Don\u0027t know what\u0027s happened to me?? Anyways you guys, enough about the poor old me...here is a short clip i found on Youtube about My Beating Heart, Pat...... http://www.youtube.com/watch?v\u003dVAd_t6rugDo","Pat, you deserve way better than that piece of SH..it ass shmuck!! Sorry he hurt you. For my birthday wish............A NEW POLL! And Itailian guys are handsome and I loveee thier accent!! I want to go to Italy too!","Hello my dear Pat! I am doing fine, working alot of hours. I look forward to talking with everyone and Wallander, man don\u0027t be so hard on yourself about the smoking. I smoke and really enjoy it. I am not a chain smoker, but do enjoy a smoke especially when I am upset or stressed. Sometimes it calms me down. Your trip to Italy and Spain, that sounds great. Enjoy it buddy, who knows who you will meet!!! I have never been out of the states. I use to travel till 911 and now I have to think twice before I get on a plane. Italy sounds like a great place to go. You will have to let us know how your trip went. Well have to go, Take care my friends!","Hi Wallander. I found about the pillow early this morning. Thank you. I love it! If my cardiologist says yes, I\u0027m going to order one. I read everything it said about them and the man. I\u0027m so happy he had that experience while meditating, which I believe was meant to happen, so he could help many people. When I have been in deep meditation, it feels like I am floating above my body and when I come out of the meditation I have a huge natural high for quite awhile. I\u0027ll tell you more later about my marriage and the divorce. It was awful! Many friends knew things before I did(a few even enjoyed him), even though I always had suspicions about so much stuff. He would never talk. I would beg him to talk, he wouldn\u0027t. When we split, then EVERYBODY was coming and telling me all these awful things about him. That is why I have trust issues with people. I never claimed a friend after that, I always called anyone an aquaintance or aquaintance friend, not a true friend. But I did get to the point of calling some of you \"ghost friends\", which by the way was a huge step for me. I love now that I can say...FRIEND. Soooooo, I have you curious about who the pollmaster is, huh? It\u0027s been bugging me for awhile, but I know it\u0027s close. I just don\u0027t know who...yet. Milkshake, HAPPY BIRTHDAY!!! I guess I got you confused with someone on here about something on the Nov. 28th, because my sister\u0027s B-day was on Nov. 26th. \"Happy Birthday to you\" and many mooorrreee! Wallander, I love any kind of animal and have had many pets and different kinds of pets since I was a kid. Right now I have a female Pit Bull and six cats, yes, six. They age from 14 years old to 2 yrs. old. The 2 yr. old has 3 legs, someone had shot her back leg off. She was rushed to my vet and they saved her, but no one came and claimed her. When I saw her I had to have her. She has long hair and is gorgeous. She was scared and depressed when I brought her home. She was a 1 yr. then, my next young kitty 6 mos. older than her, babied her, cleaned her and made her start playing, once she wasn\u0027t sore. Now she doen\u0027t know she is one leg short. She can run fast and jump. Ed, Hi! Are YOU doing okay? I still have you in my prayers. Our conversations are pretty colorful, aren\u0027t they? Yes, my ex was a @%*#$\u0026^^*@ and a #%%*\u0026% and a ^$@@!!!%$^\u0026* and even more!!! Wallander, when you take your trip in January, who knows what might happen in Italy...especially! The trip will be good for you, you might even stop smoking again. Love all of you.","Hi Ed. Hope you\u0027re doing just fine. As for me, i\u0027ve been having to deal with a lot of nervousness lately. And it isn\u0027t because i don\u0027t know why i\u0027m nervous..i do...it is because i\u0027ve started smoking cigarets again. I had quit it 8 yrs ago, and everything was just great all this time, and i was not missing it at all....but lately i\u0027ve been feeling a bit restless \u0026 bored, and it eventually led me to start all over again. Mind you, i \"only\" smoke max. 10 cigarets a day, but maybe it\u0027s 10 too many for me!? I\u0027m looking forward to a trip down to Italy \u0026 Spain towards the end of this coming January...i can\u0027t wait!! :-)))","Just in case my error from yesterday caused any bad feelings, i like to say that i hope you will put it on the count of an HONEST MISTAKE based on my bad English!! I used to think a \"ticking heart\" was just another term for a \"beating heart\" because obviously i associated the word \"ticking\" with a ticking clock. Thanks for your understanding. New poll please. : )","Hello Everyone! I had to work some extra hours so a little tried, but wanted to check in with everyone to make sure all is ok! Pat I am sorry about your issues with your ex. He is a (excuse my french) F-cking Moran for doing that to you. You know what they say, \"what goes around comes around.\" Hopefully his D-ck will fall off. :D Happy Birthday Milkshake and have a wonderful day!!! Wallander my friend how are you my friend. Hope all is well. I wish the pollmaster would give us another poll. This one is so outdated. Maybe this person is not changing it because he or she is enjoying our conversations. Everyone be safe and take care!","Correction, it was MILKSHAKE who mentioned the \"WOW poll\". Happy birthday Milky. I hope you have a WONDERFUL \"Milky day\"!;-) Btw i saw Mr Sparta Pat...awfully cute. Cats are fantastic creatures.","Hey Pat! Couldnt tell you about my birthday, because the big day is TODAY!..........TODAY is my birthday! 12/11. I am 41 years old. Don\u0027t know how it is yet. Still too early.","Hi there again Pat. I made a GIANT error yesterday when i called that pillow \"my ticking heart\"! LOL....i had to go \u0026 find a re-run of that News program on the net, and it turned out that the name of that pillow is simply \"My Beating Heart\". It has been designed by a guy who lives in NY called Yuri Gitman. Anyways when you google the name My Beating Heart, it is the very 1st article that shows...so it is very easy to find! Once again i\u0027m sorry for that GIANT blunder from yesterday. With regards to your ex, you have made me very curious now! But i believe you when you say that he was insensitive \u0026 careless towards you. You deserve A LOT better than that Pat, and you KNOW it. ;-) Anyways i hope my correcting the error from yesterday, will be of help. I know i\u0027m going to get one of those pillows myself, once they have been imported here. Btw what is a \"wow poll\" Amanda??? Is it of political, spiritual, extra terrestrial or romantic nature?? Or something else completely different? Come on you guys, i\u0027m pretty sure the admin of this poll could benefit from our help...btw i\u0027m NOT the admin of these polls! Now you got me curious Pat.....hmm....which one of you people is the admin?? I\u0027m putting my money on the LEAST conspicuous character in here.","Amanda, hey girl!!! Been missing you on here. If you didn\u0027t see my other comments in here, your website is beautiful and I know you\u0027re busy with that now. Yes, this poll just goes on and on. I bet the pollmaster is on vacation again. Milkshake, hey sweetie. You never have told us about your birthday yet. Hello, Ed, where are you at? Wallander, my ex and a partner started an asphalt business in the late 70s and early 80s. At first he brought home maybe around $500-$1,000 a week. Then very soon after that he was bringing home between $1,000-$3,000 a week home and the money was starting to roll in more and more. We were becoming pretty well off, BUT he decided he didn\u0027t want to be married anymore and didn\u0027t want his kids, so he walked away. He was messing around on me a lot. He liked girls from 12 yrs. to 17 yrs., also, and even older. He was a man wh*re. He gave me an STD he got from some sl*t and at that time I was so innocent, the doctor had to explain what that was to me and I started crying so hard. There is so much more to this, you wouldn\u0027t believe. I\u0027ll add more later as we go on. It hurts if I say too much at a time, so I\u0027ll say a little more as time goes by. Enough of that crap though, I have to close my heart again now...not from love, but the remembrance of all the horrible pain. No, Wallander, I didn\u0027t see on the news about that heart pillow, but I\u0027m going to check it out, ask my cardiologist about it and get his okay on it, then buy me one. Thank you soooo much for letting all of us know about that. Here\u0027s a whole bunch of hugs and a kiss on the cheek.","Hasn\u0027t this pole been here for a month now???","I agree with Pat. Can we please make the next poll a real cool one? Something interesting. Something Fun! Something maybe out-of the ordinary. Something exciting! Something, like Wow! I think it\u0027s time for a change.","I came back to apologise for not having noticed your last posting Pat, and it turns out i\u0027m twice behind now! Thanks for the \u0027keyword\u0027 for Youtube, i\u0027m going to check it out first thing tomorrow when i\u0027ve returned to my PC...i\u0027ve been posting via my mobile. Come to think of it, i should get one of those G1 phones because my mobile is way too out of date to be of any use (or fun) when it comes to the internet. But it is somewhat interesting that your ex\u0027s name started with an \u0027R\u0027 Pat. Men with R names are USUALLY quite independant souls which makes them good in business \u0026 money matters. Anyways i dont mean to sound like i\u0027m analysing someone i dont even know. Btw Pat i saw something on the news today that you might find interesting...infact i would recommend EVERYONE in here to go \u0026 check this out! I know i will because it is such an ingenious little thing, and it can be a tremendous help if you\u0027re feeling stressed or you need to center yourself, or just to bring your heart rate down to a calm \u0026 normal beat. The good thing is that it is in the US. . Anyways if i remember correctly you should Google the words \"my ticking heart\" , but if nothing special turns up, just go in the image section of Google and try to look for the image of heart-shaped pillows that pulsate with the exact speed of one\u0027s own heartbeat. It also has the intelligence which enables it to copy the exact heartbeat \u0026heart-rate of its owner, and when you hold it close to your chest,it will gradually calm you down because you\u0027ll be able to hear your own heartbeat, which is being played in a tone/sound that has a calming effect on you. Anyways something tells me you guys already might know about this pillow but if you should purchase one, i\u0027d love to know how many hearts you guys would give it, out of 6??! Talk later everyone. Love you back Pat.","And something else... I can\u0027t believe the name D*ck was blanked out. It is only a name! But then we can say \"damn\" on here and probably other words that I haven\u0027t tried. WOW!!! I usually will put an asterisk in a letters place. What if some kid is in school now with the name D*ck? Are they going to call him \"blank\" or \"no name\" or sue the parents for giving him that name or take them to court to have his name changed? This is so hilarious, not in a funny way! I mean...come on...","Whoops!!! One huge mistake on sentence, correctly it was meant to be......\"it WASN\u0027T said in front of women and girls. Second mistake...reading instead of ready.","Wallander, I\u0027m laughing, you are so crazy!!! **** is one of the nicknames short for Richard. Others are ****y, Rick, Ricky, and Rich. I know because my ex-hub\u0027s name was Richard, everyone called him Rick mostly. I think the name was really popular from the 1930s-1950s. There wasn\u0027t sexual connotations during that time. If there was, it was said in front of women and girls. I remember ready the **** and Jane books in the first grade. You still got me laughing.","Here is a fun little trivial info from my life...it\u0027s actually something that had me baffled today when it suddenly struck me...i could suddenly remember my first ever English lesson, on the very 1st page of our 3rd grade school [it used to be the 3rd grade back when i was a little kid but i believe the kids today begin their English classes already in the 1st grade of school] but the amazing thing was(\u0026 i\u0027m still amazed when i think about it) that the very 1st sentence that we had to learn was \"This is D!ck\" and right by it, you saw a drawing of a man who was presumably this guy called D!ck... LoL...btw i went to go to a private school from the start of 1st grade until the 4th grade,and i can recall that our English books came from an American publication. I was just wondering today if there was actually a \u0027purpose\u0027 behind the idea of using the word \"D!ck\" in our text books by that American publication company...perhaps aimed at the young female students, so that they\u0027d be familiar with the word?!! LoL...I wouldn\u0027t know,but i think it was actually an ingenious idea...my only regret is that they didn\u0027t have any names like \"Beaverhausen\" for us boys!! :p","Wallander, that\u0027s why I laugh at all these goofy little jokes. To me, they are so funny! I don\u0027t really know what kind of cool poll could be put in here. I\u0027ve gave suggestions, but I guess they aren\u0027t cool enough. Just kidding!! The ones you suggested are good, but who knows what the pollmaster will do! (Aren\u0027t you curious about this person? I know I am. I bet whoever it is, they are one of the people in here. I just have that feeling). It would be nice between now and when the holidays are over, that the polls would be light. After that, we can all growl at each other some.-Ha! Ha! Don\u0027t watch those scary things on youtube, even if it is enticing. Here\u0027s one for you: Type in \"the mean kitty song\". I always watch for new ones. It is about a cat named Sparta. It is so cute. There are different ones to watch. Let me know what you think. Love ya.","Hahaha...that was cool Pat. i actually enjoy those types of \"DUH jokes\"...:-D...and i agree, it\u0027s about time we had a brand new poll. What would you guys recon, would be an excellent (or \"cool\") topic for a new poll? Something about love, or relationships perhaps?? Or maybe something about Astrology? Maybe the best of poll topics are the ones that aren\u0027t TOO high-flying,\u0026rather something simple \u0026 more down to Earth. I sure could use something trivial myself. I\u0027ve been frightening myself a little too much by watching some really scary clips on Youtube. :p","Poll Master, please give us a new poll, pppllleeaaassseee!!!! Make it a real cool one.","Joe and Wallander, those jokes were so funny! You got me to giggling. It also reminded me about two boys that were sitting next to me at my neice\u0027s play(which by the way she performed superbly.) They were telling each other jokes during a fifteen minute intermission. I heard them and started laughing. I could only remember a few of the jokes on here and I told them and they got \u0027em and laughed. After that, it was \"Ma\u0027am, here\u0027s one...\" and \"Oh, oh, ma\u0027am here\u0027s a good one...\", they told so many and I have never been good at remembering jokes through the years. I remembered a couple of them. \"What\u0027s black and white and black and white and black and white?..........A zebra stuck in a revolving door.\" \"What did the worm say to the other worm when he was late?..........Where in earth have you been?\" That zebra joke reminded me of one I heard years ago. \"What\u0027s black and white and read/red all over?..........A bashful zebra.\" My daughter knows some that a friend of hers told her. I can\u0027t tell the real dirty ones, but there were a few cute ones. I\u0027ll write them down tonight if I don\u0027t forget by the time I get home. By the way, where in the world is Milkshake and Bam Bam? You two are always right in here a lot! Can you not tell that this poll is over? I read what you two said about the Canadian guys, too. One that my mom always has always loved is Micheal J. Fox. It\u0027s sad he\u0027s sick and can\u0027t perform anymore, because he is a very funny comical actor.","A little boy asked his mother: \"Mummy, why are you white and I am so dark?\"...the mother: \"Dont even ask me that, everytime I remember that party...well, lets just say you\u0027re REALLY lucky you dont bark.\"","What is the difference in a condom and a coffin. !Ans, you come in one and go in the other","Thanks for the kind words Ed. Your honesty has been very moving for me personally, so i felt i had to also give something back. Btw i also wanted to say that i hope you guys do NOT relate the previous comment with any of the things we\u0027ve been saying in here! I just FELT LIKE posting the lyrics of that song, so that anyone who wanted to see the clip with Cocteau Twins, would know what she was singing....in most of CT\u0027s songs, it is only the music \u0026 the singer\u0027s vocal talents that are the most significant! Thanks for understanding. : )","[http://www.youtube.com/watch?v\u003d9PztGDp8L7A] PINK ORANGE RED by Cocteau Twins: He draws his horses/Pretend your anger/And draws his horses/Being chosen also [Repeatx2: Please get up/Fall, please get up/Fall, please get up/Don\u0027t ruin yourself] So see and hear/Sultitan-itan/So see and hear/Plain tiger-iger/In my heart/Set you right up/In my heart/I sing this song/Back you up/How messed I am/Back you up/I consider/So he got up/I must see him/I must see him/And all got up/Sore got he/Apalled got up/Apalled got up/I\u0027m in this song [instrumental bridge] So see and hear/Sultitan-itan/So see and hear/Plain tiger-iger/And my defeat and hope and my defeat and hope and my defeat and hope, And sad and hope and sad and hope and sad and hope, Might not feel down (Don\u0027t listen, now) [Repeat until fade out] --- I think Liz Fraser(the vocalist of Cocteau Twins) is 1 of the loveliest creatures on planet Earth!!! Pat, you\u0027re also very close to that category yourself! ;-))","Good Morning to all! Pat, yes height runs in my family. My father was 6 foot 8 inches before he passed away 10 years ago, and my Mom is 5 feet 10 inches tall and is still kicking. Pat I think we are all past being ghost friends and I would consider it an honor being your friend. You are one terrific lady! Wallander thanks for being a voice out there that cares about his fellow human beings. You both are gifted people. Thanks for caring! You all have a Great Day!","Seems like a great beautiful day so far. Yes, join us, Life Enjoyer. The more, the merrier. Wallander, you did lift a big man up. I thought the same thing when he said his height!!! I could visualize that height above my 5\u0027 4\". Ed, does the 6 foot and over height run in the family? I had to tease you a little bit. So can I stop saying \"ghost friends\" and go to just...friends?","Hi everyone. Thanks for the kind words Pat \u0026 Ed \u0026 Life Enjoyer...btw Life Enjoyer if you happen to be new, welcome! It makes me TWICE as happy to hear that i was able to have a positive impact on someone else\u0027s life. I couldn\u0027t have asked for a better \u0027reward\u0027! On a more comical note though, i feel rather proud of myself for being able to \"lift up\" such a BIG guy...;-D...Dang, i sometimes hate my Mom \u0026 Dad for their genes...LOL...but seriously, i hope the remaining days of 2008 treat you all WELL...we\u0027ll talk again soon....love ya\u0027 all...btw go \u0026 hear this song by Cocteau Twins, and you\u0027ll immediately feel nice \u0026 mellow....the address is here: [http://www.youtube.com/watch?v\u003dK51vZA9PwG4]","It is hard to show emotion sometimes. I am a big man of 6 feet 7 inches and was raised that men do not cry, they are suppose to hold it in, protect the family etc. Reading the comments from Wallander and Pat has really touched me. I will never forget it. Like I said this morning. I really enjoy talking with everyone and I feel proud to know all of you if only it is on this webpage. I only wish all of you the very best and Pat I include you in my prayers every day. I feel that Pat and Wallander and others like Milkshake (You make me laugh) on this website saved me. I know it sounds crazy, but I have not opened up to anyone like this in a long time. It feels good like a weight has been taken off my shoulders. I know I am rambling on, sorry. I guess what I am trying to say is Thank You and God Bless all of you!","Hi, everyone! I hope all is well. Ed, I wrote this little poem for you:\"Even though your heart does ache. You\u0027re strong and it will mend. With this season hard to partake. Love and warmth and peace I send.\" I thought about you over the weekend. I celebrate Christmas and the Winter Solstice(different family members.) Wallander, that was such a strengthening and kind note that you wrote to Ed. Tom, I don\u0027t know if that\u0027s true or a joke, but it was funny. Sorry, if it was true. Ocean, you don\u0027t live in America, so you don\u0027t fully understand the whole picture. I\u0027m glad you are proud to be a Canadian. I, myself, have never thought Canadians were apathetic. But someday Canada, like other neutral countries, will feel the power that lurks the earth to conquer it.(I am talking about the 1% that rule world-wide.) Ken, Canada is beautiful and layed back. To me, that is not boring, but very desirable. Jim, I guess if O\u0027bama didn\u0027t join a secret society, he would end up like Kennedy. Jimbo, what you said was funny, but Milkshake, what you come back with was hilarious. Yes, Claire, we can only wish for a new poll!!!","Dear Obama: Since you are a cigarette smoker, do you think you can lower the price of cigarettes? Sometimes I get this craving to smoke. Oh Bam Bam, I heard Canadian boys are cute too. LOL Take care Ed. Have a Merry Christmas!!","Good Morning Everyone! I hope everyone had a wonderful weekend. I want to thank Pat, Wallander and others for there support. It is really a wonderful thing to be able to talk to people all over and find that people care about each other. I am not use to that and it is a great feeling. I truly am glad I came to this website. I consider all of you my friends. Thanks for the support it really means alot. I don\u0027t know if any of you celebrate Christmas, but I wanted to wish all of you a wonderful Christmas or Holiday Season and lets hope we all have a wonderful new year. We all could use it. Take Care everyone, and especially dear, dear Pat!","Milkshake, Canada is fun and so are Canadian boys!","Hey! Wait a second! Does that mean I have to stay single?","Life is a **** but make sure you dont marry one","I agree with Wallander. You don\u0027t need to sweat the small stuff anymore Ed because you have finally made it to the other side. It\u0027s now time to enjoy life - again.","New poll please.","I here Obama is going to Bohemiam Grove","Hmmmmm. I always thought Canada would be lots of fun!","Canada is such a bore of a country","I am blown away by how fear-based you Americans seem to be. I am thankful to be Canadian (despite that we are labelled as APATHETIC)","To be upfront \u0026 honest with you Ed, i truly admire you for your tremendous progress...you have come a long way my friend!! And this ONLY goes to show, not only a courageous soul, but also a marvelous sense of intelligence \u0026 capability on your part, which ONLY a few ppl are able to do...so you should be INCREDIBLY proud of the amount of progress you\u0027ve made in such a short span of time...it is almost miraculous, if you dont mind my saying. Most ppl(incl. myself) in your situation would have just sunk into the BIG BLACK HOLE that you were initially thrown into, without ever getting out again, or WANTING to get out! They would have become consumed by the sheer RAGE from such a predicament[losing one\u0027s own daughter so senselessly] and feeling as though the WHOLE world was plotting against one self, they would\u0027ve just thrown in the towel \u0026 spent the rest of their darkened existence in that state of limbo!! I can tell you this much...you are TRULY an inspiration, and i am in complete awe of your will power \u0026 character! I think the word \"Hero\" would simply be the most fitting word that comes to my mind, \u0026 NOT AT ALL an unreasonable assumption of your character. And to Pat, have a nice weekend you LOVELY little thing!!! ;-)))","Just to let everyone know Im a student psychiatric nurse and today was my first day on a lock up ward for very ill psychiatric patients. Well been nervious and apprehensive went I arrived on the ward a gentleman cam up to me and asked me if anyone was in room 18 thinking this man was a fellow nurse I went and looked in room 18 I found noone .When I told the gentleman this he said \"Oh good Ive escaped","Talk to everyone Monday! Have a nice weekend!","Joe, hi! That little joke was funny. Of course I laughed. Thanks so much, nut. Ed, I am praying that something really good opens up to you for this time of year that is hard for you. I am praying you don\u0027t have to sell your home! Man, I really feel bad for you. I know you don\u0027t want pity, so it isn\u0027t pity, it is empathy. Happy thoughts! Happy thoughts! Happy thoughts! Know there are people who care. Anger or stress can really affect the body. I\u0027ve had my moments growing up, because my dad was evil, cruel, abusive, vindictive with the world\u0027s most horrid temper. Trust me, it was really bad. I know it isn\u0027t good to keep things inside until you explode. I have taken many years to learn how to control and release any strong anger. There are times though when I get angry and I have to stop and think is it really worth it to my psyche...and it isn\u0027t, friend. Stress has been my big problem and now it has hurt me...but I don\u0027t meditate as much as I did at one time. I meditated as often as I could and at times I could stay in meditation for hours. Wallander, you crazy, crazy nut! I knew you would be the one to see beneath my problem. You tickle the sh** out of me! Yes, the pain and other symptoms were very real and kinda scary, but it upset me that it would disturb me at an inconvenient moment!!! See my dilemma? Now that is crappy. I\u0027m glad you caught the comedy in it! I am laughing so hard it is taking a while to get this in here!!!","I know there was perhaps a more serious undercurrent in your comment from Tuesday 12/03/08, 2:17pm, Pat, but i couldn\u0027t stop laughing at the somewhat comical situation you had to go thru! And i agree with Ed, you always bring a breath of fresh air in here everytime i read your comments! I dont know, maybe my feelings are a little biased because i am a guy, and i may sometimes be subconsciencely influenced by my libido towards attractive women..nevertheless your sense of humor is TOTALLY your own, and i dont believe i\u0027m the only one who\u0027s noticed it by now! ;-D","Hi Pat! You have a wonderful attitude. I try every day to at least do one thing positive and reading this site and reading your thoughts helps alot. With Christmas coming around the corner it gets hard, so I try to put one foot in front of the other and try to keep myself busy. Most days its fine, but some days I don\u0027t even want to get out of bed. Today is a good day! Friends and coworkers tell me to sell my house and move on, but I am not ready for that or they tell me to see a shrink. Sorry I don\u0027t believe in them. I feel I have come a long way. My anger is not as bad as it use to be. I have never been on a website before. This is my first one and I like the chatter between everyone. Alot of the comments are funny and it makes me laugh. I think we have a pretty nice group of people on this site and I enjoy reading their comments everyday. Pat and everyone on this site, have a nice day and take care! Must go to work.","Loopy, that was funny and so cute. I read it to my mom and we both laughed. Every funny little joke that shows up I read it to my mom and sister. Everybody keep them coming. Laughter is medicine and I need all I can get. Thank-you so much. To everyone else, my mom read in a section of the morning paper where we live at that some barbers gave free hair cuts to the homeless, which was nice. But why does everyone wait until this time of season to go out of their way to do so many things and the rest of the year it is to hell with it?","I went to the doctor and told him I believed I was a pair of curtains. The doctor told me to pull myself together","I went to the doctor and told him everyone was ignoring me all the doctor said was \"next\"","Hey, Ed, how are things going for you? I\u0027m glad it was a joke, because I had to laugh! I have my so-so days and my bad days. There are a couple of other things that I enjoyed doing every now and then(one thing some of you know about, by hints), but I had to stop. I started having bad chest pains, felt dizzy and short of breath. The chest pains were the worst. I had to calm myself, slow my breathing and go into meditation, which was hard to do. But later, I was okay. My doctor told me to always call 911 whenever that happens, but I am trying my best to not feel like an invalid and I think it is ridiculous to call 911 everytime I have pains or whatever. Sorry for the complaining. I have to tell somebody, sometimes. I still haven\u0027t told my family everything yet. Amanda, (if you are still in here reading), I am so proud of you! Your website is beautiful! I knew it would be. I will visit you whenever I decide to get set back up at home again. I can\u0027t wait to see what else you come up with. It is nice to have a face to go with the name, also.","Hey Pat! Yes I was trying to make a joke...I was trying to make it lite. Bill was way to serious. Hell we need to give Obama a chance. There is nothing we can do about it but pray he does not screw us. I hope you are feeling better Pat. I look forward to your comments and jokes. Have to run, but Everyone (including Bill) have a Good Day!! :D","I read some of the comments. To those students if you donate your time you donate to charity. When I was a student I volunteer at a church helping students. It paid off because I know I reach at least one student. But when I did come across money I paid my tithes and that is consider charity. So if you give money, time, clothes, etc.... you give to charity.","Milkshake, you and I know people have been preaching the end of time and the anti-christ for centuries. No one knows when anything like that will happen. Even if it is around the corner, in the Great Spirit\u0027s eye, that could be tomorrow, next week, next year, in 500 yrs., in 1,000 yrs., in 3,000 yrs. or more. I don\u0027t believe O\u0027bama is the anti-christ. If that part of the bible is true, it is going to happen no matter who is where ever in this nation or the world. The change has been happening way before O\u0027bama was even born. I don\u0027t believe it will come from this nation though. Talk more tomorrow. Bye.","Sorry Bill. NO! Obama is NOT the anti-christ!! And I don\u0027t believe Americans are that stupid to have an anti-christ president run the white house.","Bill and Pammie, Hi. We just have to wait and see. Whatever happens would happen no matter who got in the White House. I just couldn\u0027t stomach another republican president. Ed, hey buddie. That was funny about the cats and dogs and dead people voting. I\u0027m a very visual person and I could see that picture in my head. Sorry, if you meant it not to be funny. Wallander, you have it in you. Just trust yourself,(your intuition). Drop any barriers that try to hold you back. I feel like we are friends, even if it is \"ghost friends\", so keep me up on how things go. Love ya.","That was really sweet Pat..thanks. I might have higher ambitions with regards to writing in the future, but as of right now i\u0027m still in need of learning more about trusting my own judgments, and eventually about how to seek for new inspiration. Love ya\u0027 : )","Sue, I see you are a nut, also! That was so cute, I had to giggle. Shel, there is nothing wrong with that. I don\u0027t like to be approached, either. Wallander, thank you for the sweet compliment...but don\u0027t think I don\u0027t have my bad days I go through. I\u0027m 53 years old and still learning lessons. We never get finished with life lessons. Some are pretty easy, many are pretty tough. You have been open and shared many of your rough times. I have never thought you were boring, I know my brother isn\u0027t. You are insightful and nice. When you are gone from here for awhile, I want to know if you find someone that can understand your moods and makes you happy, but remember it goes both ways for a relationship to work. I want you to be happy. You can be very romantic and boy are you something with those smooth words! You just have to learn from past mistakes and go on to the next level, Wallander. I\u0027ll tell my sign sometime. Bam Bam, hi! I\u0027m glad you are back. I remember the news and everything concerning jim jones. My son was born in Sept. 1978. All those people died in Nov. of that year. I was 23 years old. It was on nationwide news(probably worldwide too) and was a horrible thing to happen. Most of those people didn\u0027t even have a chance once they got stuck in Guyana. He was a cruel pyschopath. Just think there are many people still out there just like that. Someone always wants to be a glorified God. That\u0027s when that person can be very dangerous to people. To Bill,(I think it was you ), I\u0027ll find that out when I submit this in. I forgot to write your name down. Now...I know you aren\u0027t blaming everyone for thinking that O\u0027bama is a savior or saying that he is like Kennedy. So I\u0027m not fussing when I say that I have never compared him to Kennedy or said he was a savior. I just look back at the last 28 years and 20 of those were under the republican party. I know I have repeated this over and over...but know one has ever given a true statement about what the republicans have done to this nation during all that time. I always hear the democrat party has ruined this nation. Truly, it is all of them that does something to hurt us and we keep letting them. All I know is we didn\u0027t need another republican in. All we can do is watch closely what O\u0027bama does when he gets into the White House. If he is a muslim...well, the people in this nation have already let the muslims have more rights than any other religion that lost rights years ago. One school up north of the U.S. has taken jello out of the lunch, because it has a base ingredient of pork and muslims don\u0027t eat pork. Why was that allowed to happen so easily? Why do they have several prayers a day set aside for them in school when other kids with other different religions don\u0027t? The teachers even cover the windows for them. Why did a school somewhere else in the states take a cross out of their school because it offended the muslims? Why? Why? Why? All of that happened these past several years with bush in the White House. Not mad, just curious.","Who cares anymore who is president!!! If this new jackass can help me save my job and home then let him do it. I am afraid to many people think he can do something for the economy but he won\u0027t. He will fall right into the old grind just like every other president before him. The Black people just voted for him thinking that he is their salvation, that\u0027s funny!!! The young college idiots have no idea what they voted for, they are used to Mommy and Daddy footing the bill so they don\u0027t understand what tax increases are or what it is like to earn a living and keep your head above water. So with all that said, I am going to give this jackass a chance to see if he can help us, but I would not put any money on it. Merry Christmas Everyone! I guess I am politically incorrect for saying that, To Bad!","Bam Bam and Bill it does not matter anymore, because the jerk is going to be the president and there is nothing we can do except pray that the next four years go by fast and that we don\u0027t get screwed to bad that the next president which will be a Republican can straighten out the mess Obama will put us in. So people hang in there it is going to be a very unstable ride for the next four years. Bill you need to control your anger. It doesn\u0027t to any good to get upset. The people who voted and voted twice and sometimes voted three times and also the dogs and cats and even dead people voted, no wonder he won! That\u0027s what I call democratic democracy!!! :P","Bam Bam, I am not ignorant just speaking the truth about a man who\u0027s friends and associates are extremly questionable. He has you all believing that he is the savior, Bull! The man is the Anti-Christ and you will see. America is in big trouble with this Muslum in charge....Yes I said Muslum. Who knows you Obama lover\u0027s keep comparing him to Kennedy and we all know what happened to him. :)","I can\u0027t beleive this poll is still current my goodness. Hope everyone had a great TG! I have to say something Off topic here...I just watched a documentary on Jim Jones and the massacre in Guyana. I just have to say whomever compared the people who followed him to those people who beleive in Obama\u0027s ability to lead the country, I\u0027m just filled with disgust. I\u0027m also sure that the people who survived are aghast as well. There were so many people that didn\u0027t want to die and so many that tried to leave and were shot with a shotgun in the head. This comparison is grossly stated. Whoever made this comparison should be ashamed. The first congressman was murdered, an entire newsteam except for one person, and so many others that weren\u0027t there as a part of the cult. What a sick, sick comparison to make. Thanks I had to say it did anyne else see that documentary? I\u0027m sure they aired because of all the comments and comparisons certain ignorant folks were making.","On Michael Lutin\u0027s internet site[http://www.michaellutin.com/nextweekreview.html] he has put up 2 images next to one another, where in the 1st image you see a man \u0026 a woman in a car, and the woman is telling the husband to \"WAKE UP\", obviously because she is seeing something down the road, while the husband looks like he\u0027s taking a nap behind the wheel.....and on the 2nd image you see the Planet Earth being hit by a gigantic astroid or a meteor...and at the bottom of these 2 images he says \"the meteor has struck Earth, if you get the joke\". So this is basically what Michael Lutin thinks of the new Pluto in Capricorn!! But then again, nearly all Astrologers are notoriously known for their rather dark \u0026 cynical view of the future....lets just hope this statement is also well-fitting with regards to Michael Lutin\u0027s view of the future! Speaking of something totally different, i came across a VERY horrifying Youtube clip last week or so--COMPLETELY by accident, i might add--and ever since having watched only 1/3 of that clip, i\u0027ve been having some TERRIBLE sleepless nights! Please send your prayers my way, so that i can start to sleep better again! And do NOT ask me for the content or the name of that video clip, because no one in the right mind should ever watch such things, even if you happen to be a thrill-seeking enthusiast! I just wished i\u0027d seen that clip with someone else, obviously because it has such awful effects on you when you\u0027re watching it alone. Curiosity \u0026 obsessions can be such terrible things sometimes. Anyways my new motto is EASY \u0026 SHALLOW. ;-)))","Thanks Wallander! Except I was sick yesterday...kind-of funny. Maybe it was pluto? Anyway, I believe Christmas time is a great time to donate to all kinds of charity!","Happy Pluto day Milkish!!! : )))","Today is the DAY!! Finally, Pluto moves out of the sign Sagittarius!!!!!!!! Yippie!","Oh wow Pat, i am so blown away by everything you said in your latest comment! I don\u0027t even feel i can ever re-pay you for all the warmth, love, fun, laughter, encouragement, wisdom \u0026 spreading positive energy, with me \u0026everyone else on this poll!! Girl, you are TRUELY one of a kind! You should let scientists clone you, NOT as a selfish act, on the contrary, it would be a very selfless thing to do! (LoL) But joking aside, i\u0027m going to check out all the keywords you mentioned regarding the Age of Aquarius. I have a few interesting ideas myself regarding the \"historical build up\" of the world\u0026 of mankind, in particular why the timing of Jesus Christ\u0027s arrival on the scene, was so perfect...if i get the chance, i\u0027ll try to put in my 2 Cents on that subject later on. Btw i enjoyed your description of the Cancerian man a lot. The fact that you have a brother who is a Cancer,COULD explain why i took a shine on you from the very moment i started reading your comments!? Mind you though, i personally find both male \u0026 female members of this sign, a bit on the boring side. I\u0027m also VERY curious to know what your sign is, but since you haven\u0027t mentioned it until now, i have taken it as a sign that you\u0027d rather keep it to yourself, which i respect. Anyways i\u0027m going to stick around here in the polls a little longer until i\u0027ve come across a nice local place on the net, but i won\u0027t be here as often as i have done before. Ciao. : )","I donate locally when I want to and am able to. Not when it is a certain season. I dislike being approached. I will make up my own mind, thank you! have a nice day! :)","Help my grannie has run off with a goat","Hey, Wallander, I was out sick yesterday and home most of today. I had a few bad episodes. If you find a new site where you live, don\u0027t forget us. Don\u0027t forget me. I have several Kahlil Gibran books, I love his writings. There are many writers that I love to read though. That saying is really good you typed in. It means there is more than one truth about something(even though I at times have argued the point in the other direction). What you said about your donations was sweet. I found something you can check out about the Ages that can explain better than I could get it out. I found: constellations, precessions, sidereal zodiac, tropical zodiac. About the \"birth envy\", I swear if you had to push a baby out just one time, you wouldn\u0027t envy it anymore. A woman remembers, but don\u0027t quite remember the pain. But then before me and my ex divorced, I always wanted ten kids and live in a huge, old two-story house. Here is something I found in one of my older astrology books. I think you said you were a Cancer,(one of my brothers is also a Cancer), if so, here is something for you. \"It is the nature of Cancer to give birth--in every sense of the word. The most enlightened Cancer makes life a continuous series of births. It gives birth to its visions. It gives birth to its creativity. It gives birth to its dreams and experiences them coming alive.\" Something else it said about a Cancer man,\"He is an enigma who often gets in his own way.\" I think you have said that about yourself a few times. Look at your life--As one door closes, another opens. That\u0027s how I have to do with this sickness. Let me tell you, I have to fight depression off with a ball bat. I want to laugh, be happy, enjoy as much of life as I can. There is so much more than the moody part of you, Wallander. I want you to be cheerful RIGHT NOW! I also know that you love women...you flirt. Ha!Ha!Ha! Now\u0026Here, what you told Wallander was funny. He could either get slapped down or l***. That was naughty, I know, but I had to get it out. When I called you crazy, it wasn\u0027t an insult. I have weird endearing words to people that make me laugh. Happy Birthday, Milkshake. Have fun! My sister\u0027s 50th B-Day is today. Now my mom has all four kids in their 50s. Tom, I love your jokes. As usual, it got me to laughing. I love to laugh. To Mick...Hey, join the crowd. The more, the merrier! Can\u0027t wait to get internet back at home, I miss all of you. Especially now that I can\u0027t do much. I mostly rest as much as I can(doesn\u0027t really help). I won\u0027t be back until Monday. Happy Thanksgiving! Love ya.","I feel like saying shyt in 50 different languages right now! I think i\u0027ll just stick to my fav.-the German version; SCHEIZE!!! Ok my work is done. Bye peeps. Thanks for the dance.","Sorry your nick is not Here\u0026Now...it\u0027s Now\u0026Here! ;-D","Haha...that was very funny Here\u0026Now..i appreciate the saying you came up with, but i wasn\u0027t trying to make any advances on anyone in here, let alone a sexual one. It\u0027s just that i could suddenly see that my words were starting to have ambiguous meanings, which was NOT at all what i\u0027d been meaning to say. It is actually quite spooky sometimes when you suddenly read your own words with your own \"3rd eye\" p.o.v.[or your subconscience mind] and you start seeing yourself as a \u0027loose mouth\u0027, revealing TOO MUCH about yourself! Anyways i\u0027m sounding a little too self-absorbed now(Is that a correct term btw?)... thanks for the humor mate. : )","Wallander next time just remember these few words, they might help: Make awkward sexual advances, not war. Pat I hope your crazy is a compliment. :-)","My friend told me he got a new tatoo of a rabbit on his arm when I went to look at his arm ther was no tatoo there I said this to my friend who said oh dear it must be a hare","Boy today i\u0027m REALLY screwing things up for myself!!! I dont know why my last comment came out like that Milky, but i wasn\u0027t angry with you! Btw i had not read your last comment when i was posting my last...comment! Anyways what difference does it make??! I screwed up BIG TIME...yes i love women...\u0026 i\u0027m frightened by them at the same time...\u0026 the more i love them, the more frightened i am of them!!! Plz someone with a little psychology insight tell me what is wrong with me?? You know i\u0027ve been told once that i may be suffering from a strange case of \"birth envy\" towards the female species for their god-given ability to \u0027create life\u0027, and yet at the same time i am drawn sexually to women just like any other man...my libido is INCREDIBLY strong, but my urge for self-control is EVEN MORE powerful....which often leaves me a nervous wreck! I am being pathetic right now, i know....but somewhere deep inside i feel i\u0027ve just about had enough of regrets! Blah blah blah....anyways, Milkshake i\u0027m sorry if i stepped over your toes in my last comment...i certainly didnt mean to! And Pat, i just hope you\u0027re doing fine! As for me, i think i\u0027m gonna go stick my head in a bucket of cold water for now.... :p","I hope you guys know i wasn\u0027t saying anything in particular today...it\u0027s all a bunch of small-talk. And i ain\u0027t that \"shallow\" anyhow. And Milkshake, that quote, if anything, was posted for myself than anything else, because by nature i am a fanatic or over-obsessive...for better or worse! It\u0027s quite odd sometimes..i feel like i have to be my worst to be my best! I believe Kurt Cobain said something similar, which is NOT at all a good sign!(LOL) Pat i hope you\u0027re doing just fine, and i\u0027m actually missing your laughs sweety! You know in my wildest dreams you are like....umm....better not say it anyways! Gosh, sometimes it\u0027s so hard for me to talk, you\u0027d think my Mercury was going retrograde up in my as$!!! GRRRR...","Wallander, I scrolled down and read the \"Bye Bye pluto party\"! Hee Hee thats funny!! I wonder how my life will change?","Wallander, I really like that quote. Pat, thanks for all your information about astrology. I agree. We are going backwards in time. I am going to celebrate on the 28th......Pluto FINALLY moving out of sign, Sagittarius.","Quote of the day: \"Say not, I have found the truth, but rather, I have found a truth. \" -- Kahlil Gibran","Hi there Pat. Are you by any chance invited to Milkshake\u0027s \"Bye bye Pluto\" party? Not that it matters if you weren\u0027t...America is not exactly a \u0027liliput\u0027 country like overhere. You know the reason i\u0027m not on one of these Esoteric sites in my own native tongue is because practically every single site i\u0027ve seen is CRAP. If i find a nice one, i\u0027ll be very happy because then there is always a possibility to run into a futre good friend or perhaps even a love interest...or as in my case \"shallow love affair for the senses\"! Anyways sorry for the rant...i\u0027m just small-talking. I\u0027d like to make a suggestion: How \u0027bout we all posted what we think would be a really good topic to talk about...i love these sorts of \u0027creative\u0027 competitions. ;-) Btw i agree Now\u0026Here is a funny loonie. So is Michael. Lots of funny \u0026 crazy characters in here...we need more of them-please!","My real name is Mick [Micks no difference]","I got on here and reading Micheal\u0027s and Now and Here\u0027s and Milkshake\u0027s and Tom\u0027s comments and they are funny. Tom that joke is so funny. No, Wallander, you are not insane(a nut, maybe, like the rest of us). You are correct about the planets and the zodiac. That is totally different of what an Age is. I wish I could draw it out, it would be easier to see what I\u0027m talking about. I\u0027ll figure something out. Now and Here, you\u0027re crazy. Be back later.","Nr. D!ck Head you\u0027re not by any chance married to a Ms. Pu.ssy Galore? We know she used to be one of James Bond\u0027s favourite girls but I\u0027m asking because I recon she\u0027d prefer a much more SERIOUS and committed relationship today, and may I say what a lovely match-up you two romantic souls would be making sir. ;-))","Whenever i am donating money to an organization or just handing out some loose change to a homeless person on the street, it is done quite deliberately because i have this rather SELFISH motive...the BEST times to make a wish, is when you are TRULY \u0027humbling\u0027 yourself by giving money to charity. Almost like throwing a coin in a fountain, or a pond...only MUCH better \u0026 more effective! Some of my biggest wishes have been realized, whenever i\u0027ve donated money to charity. So yes, there is a huge cynicism involved whenever i\u0027m giving my money away. Is that a horrible thing?! Is that a devilish thing to do?? I don\u0027t know...all i know, is that it makes both sides satisfied in the end. **shrugs**","Thanks for the explanation Pat \u0026 Bam Bam. So if i\u0027ve understood it correctly from your run-down of what the \"Age of Aquarius\" is all about, it was pretty much an experimental theory that was thrown out there by a few Astrologists sometimes in the 60\u0027s, and it hasn\u0027t been confirmed nor denied, ever since. I mean, there seems to be a great deal of disagreement at least when it comes to when exactly the Aquarian Age began!? My own take in all of this, is a little different. I\u0027ve been trying to look at the \"one year\" cycle of Pluto...which in Earth years is appr. 248 yrs.! And the one thing that makes the current Pluto cycle unique, is the intensified advancement of scientific inventions, innovations, news media(which started with newspapers), the sophistication of intelligence, industry, so on \u0026 so forth....\u0026 all of these things have been felt on a societal level....on an individual level, we humans have become more \u0026 more egotistical for better or worse, as a result of our constant thirst for personal freedom(which in itself is a very positive thing). So all in all i would assume we are in a Leo cycle...meaning Pluto COULD BE in a Leo cycle for the time being, until the next cycle begins sometimes at the beginning of 2070, and then from there we are headed for a Virgo cycle, which is a feminine sign, which means that the women are going to be the \"stronger sex\" in the society in the next couple of Centuries, and the society will be built more \u0026 more around feminine ideals \u0026 values, as opposed to now. This also means that prior to 1822(the time when the latest Pluto cycle began), we were in a feminine cycle as well-- a Cancerian cycle. Anyways i have a lot more to say in this regard, and i\u0027m still looking deeper \u0026 deeper into this, to look for the fine points \u0026 the flaws in this home-made theory of mine. You may say that this is something that i\u0027m just throwing out there, to see if it holds or not, so plz bear with me for now...i promise i\u0027ll be the 1st person to retract the theory, as soon as i\u0027ve encountered major flaws within it. Mind you i\u0027m still keeping the good cards in my hand right now, and i\u0027ll share them later on when the time is perfect for it...these things can be so tricky, because you can easily end up sounding like a total basket-case, if you try to explain them too nonchalantly or too quickly, due to the obscure nature of such \u0027knowledges\u0027. This is something that has occupied my mind the last 4-5 yrs now, in my free time, and apart from perfecting the whole mind-buggling theory, i\u0027m also basically trying to find a relevant \u0026 optimistic angle, to work it thru, so that it makes sense \u0026 it\u0027s easy to understand for others. There is a lot of History research involved as well. Anyways...there you are ppl: i\u0027m officially insane!LOL (if i don\u0027t come back again in this poll, you\u0027ll know why...i\u0027ll be bathing in my own shame \u0026 self-regret why i even posted this comment!!!) LOL","I went to the doctor and told him Id lost my memory He asked me when did it happen I said when did what happen","I guess somebody on this poll needs some charity!","Thankyou Now and Here I just love my new name I cant wait till I get it","Congrats witti your new name Mr. D!ck Head.","Id like to change my name via deedpoll my name is Michael Head Id like to change it to Richard or **** for short","Joe.......that\u0027s the most damn HILARIOUS statement on this poll. I am LMAO!","Joe, if she got the inside...what did you get? The outside ? Or the dog house? I just asked because the way you put it down...I didn\u0027t mean to laugh, but it was still kinda funny. Sorry I laughed, if it wasn\u0027t meant to be funny. Bam Bam, I love how All of you are making me laugh. I needed it this week so bad. What you said about the itch...I\u0027m still laughing!!! Wallander, we are in the end of the transition going backwards(for however many years it has been) from the Age of Pisces(Christianity and Jesus) to the Age of Aquarius(a higher spiritual level, mental level, DNA change, technical level, etc., even though there will be more destruction, because the earth is being slaughtered and the one world government will reign). An age is around 2,000 years old. After that it will be the Age of Capricorn and so on. Will explain more Monday. Blessed Be to all. (I don\u0027t have internet a home, I would never move.) I am thinking of getting it again. I miss all of you.","I think the age of aquarius was simply a facination they had with astrology back in the 60\u0027s and 70\u0027s. The age of awareness and the newness or rather the catching on of astrology. The whole what\u0027s your sign and mystical hippie stuff. But then, I was barely an itch in my daddies pants back in 68. So, I\u0027m only guessing based on what I witnessed back then.","When my wife and I divorced we shared the house 50/50 she got the inside though","Wallander, I swear I am telling you the truth. This is so funny, because I told my doctor and my family and friends that I\u0027m like an older car that needs a complete overhaul! Oh, man, you make me laugh so much! Love Ya. I\u0027ll explain a little about the Age of Aquarius when I finish my work.","Just dropped in to say thanks for your previous comment Pat! You\u0027ll be just fine mon cher chri. It\u0027s just like a \"car maintenance\". You\u0027ll eventually find the right balance between optimal functionality \u0026 flexibility, yet with the LEAST over-burdening[Sorry, my English fails me once in a while....i\u0027m not very familiar with the automobile jargon, but that\u0027s what i was going for]. Anyways i\u0027ll drop by again a little later on, because i wanted to mention something that i found interesting with regards to the whole \u0027Age of Aquarius\u0027 thing? Does anyone by any chance have any knowledge on how the astrologers have come up with the whole concept of \u0027Aquarian Age\u0027?? And if you do, then could you perhaps explain it to me in a layman\u0027s term, so i can understand where they\u0027ve been able to observe this phenomenon? Be back later...","Ginny and Milkshake, there is nothing wrong with helping anyone you see. Honestly. I help some I see, but after being burned once, I never get burned twice(at least in this instance). Besides it isn\u0027t helping them, but then again that is probably the only thing they have to hold on to. So good for you both(I don\u0027t mean that in a sarcastic way, either).","Everyone needs chump change every now \u0026 then.","Just wanted to add a comment about giving to the people on the corners or in the parking lots. I do it when I have the money because I do want to help people. I know how it feels to be in desperate need. If they are \"scamming\" me then the bad Kharma is on their side. My giving is genuine and if once in a while they are buying booze or don\u0027t really need it then it shouldn\u0027t concern me - I was trying to help.","Wallander, everything you said was so sweet. Let\u0027s runaway around the world,(half flirting, half truth), except I don\u0027t fly. You\u0027re right, I have to stay peaceful and calm. Where is Amanda anyway? I miss her and Bam Bam. What you said on your next comment really does make you stop and think. BUT, OH, PLEASE don\u0027t ever shut up!!! I agree, Wallander, what Joe said was sooo funny. Joe, I\u0027m not laughing at the situation, I\u0027m laughing, because I didn\u0027t catch it and now that you explained it, I still can\u0027t stop the giggle while typing this part in. Hey Milkshake. Wow, all of you are good for me. Ed, you haven\u0027t done anything to hurt me. Man, there\u0027s times when my family and I get upset with each other and have words. I just can\u0027t do that anymore(at all). Meditation is still good for me, but I have to do more. I don\u0027t know ALL yet, but I am exploring. I can\u0027t even watch really scary movies now, because of how it affects my heart. I can really get into movies. I laugh so much watching comedies and comedy romances. I cry if a character I like in some movie dies. I really, really cry when a kid or an animal supposedly dies. My family lets me know if a movie is not going to be good for me to watch. I love to watch Ghost Hunters, but that doesn\u0027t scare me, because that has always been normal in our family\u0027s lives. I tried to watch the new show--Estate of Panic, I couldn\u0027t finish, because it WAS making my heart flutter too much and all the other junk that wants to start happening. I can\u0027t do a lot of working with my dumb bells now, I was wondering why 3 or 4 steps up was making me very short winded. The stupid list goes on and on and that is irritating. Tigger, one of our cats\u0027 names is Tigger. And yes, tiger or tigress is cool, just because tigers (and all animals) really are cool. That is going to be one of my next tattoos. I am not letting my heart stop me from getting the rest of my tattoos to go with the others I already have(well...at least I hope, anyway.) One thing I do ask everybody on here is don\u0027t stop debating with me on different polls. If some on here don\u0027t want to discuss something with me, that\u0027s fine. BUT all of you that do have me hooked, please don\u0027t let go. If something is too much, I\u0027ll leave and come back in when it\u0027s not. I will still come in just to say, \"Hey, I\u0027m still here\", so no one will think the worst has happened. I love everyone\u0027s prayers and good spells, I\u0027ll grab as much as everyone wants to send in here or on the wind. Who knows, we all might get to meet someday(and I mean while we are all still alive). I would absolutely love that. if...and I am only meaning a little if...something was to happen...which I am not going to let it...my sister(when I tell her and my family everything) would let all of you know. Oh man, that\u0027s sounds horrible. I love my \"ghost friends.\"","Dear Poll Everyone needs a helping hand sometime in their life. Everyone needs a smile and everyone needs a laugh, but when things get out of hand.........they may need some help FAST.","That was really funny Joe! LMAO","Pat my wife is called Charity I thought yous all wanted to give her money","Dear Pat you are in my prayers. Yes I know I am the man with an attitude, but I do genuinely (hope I spelled that right) care about people but find it hard to express it sometimes. You know men have to be macho. Pat take care of yourself. we all enjoy your comments on this web page. I apologize for any time that I upset you with my previous comments. Hang in there girl. You are a very special person. Hell now I am going to cry. Have a Wonderful Day! :)","Joe, who are you talking about? The wife got everything? Does the asterisks(****)mean bit*h?What does that have to do with charity? Unless some charitable organization helped them out? Just curious. If you don\u0027t want to answer then just ignore my questions.","Give nothing to Charity the **** got my house , my car and the children","One last thought for now: Sadness \u0026 tears are good...infact they are HEALTHY! Fear on the other hand is bad \u0026 VERY unhealthy! So do NOT try to hold yourself back if you feel once in a while consumed by your own sadness Pat. Let the tears out somehow, and feel its healing effects on you right away. It relaxes your breathing \u0026 clears up your lungs \u0026 heart. So don\u0027t be afraid to feel the sadness once in a while, and don\u0027t try to force yourself to laugh out of some kind of panic that you may be doing yourself harm by being sad, or what not! Now i\u0027m going to shut up :p","You know what, i should be the LAST person in here who should be talking about \"taking better care of yourself\"! The TRUTH is that NOBODY is good at this. We ALL sabotage or compromise ourselves one way or another, in our lives. Maybe there is a lesson in that. Can we ever bring ourselves to TRUELY believing that we ALREADY HAVE WHAT WE NEED in our own lives?","To hear you say that it makes you cry to say that little sentence, stings me DEEP in the heart Pat...mostly because of your own sadness! But you need to take it as a warning to you, to be good to yourself, and to try to do ALL the things that agree with your system. No more grief, aggravations, anger, not even envy or jealousy...no more trying to improve something by STERN discipline[at least not for the time being]...ONLY allow yourself to feel peace, happiness \u0026 simple joy! And yes, prayers DO help, because God is VERY REAL! You don\u0027t need to take this literally, but i wished i was somehow living nearby you, so that i could meet you once in a while, and we could just hang out \u0026 have fun, \u0026 watch the stars at night...or whatever that feels right in the moment --even if it\u0027s just something as \"boring\" as sitting on the sofa \u0026 not-talking to each other!!! And allow me to be a little ANGRY with you, because i don\u0027t know who else to be angry at right now..i just feel like punching somebody! LOL (ok, the last part may have been slightly exagerated, but the anger is REAL). You can ask Amanda for my email addr., if you feel i can be of any help Pat?! I will post some more thoughts in that regard later on...","Wallander, you are so rotten! Even in this instance you can make me laugh(rather you are being sarcastic or not). All of my \"ghost friends\", I told my family part of it(my mom and daughter and sister have physical problems, also. I don\u0027t want to add to it). It seems more scarier putting it in here, because the world can read it. I don\u0027t want it to seem so finalized. Do all of you remember when I typed in about not feeling good and that something just didn\u0027t feel right and I was experiencing some different symptoms? It had been happening for awhile, but I just shrugged it off and ignored them, until there was too much going on. Well, my heart is dying. Damn! That little sentence makes me cry! Nothing was wrong with my heart last year(at least what the doctors say. I have my doubts now). I had started Weight Watchers almost a year ago. I was losing weight really good, then all of a sudden, no matter how close I stuck to it, the weight was coming back on. I have weight on me, but not huge or morbid. I got depressed over the gains and quit. I only eat fast food maybe 3 or 4 times a year(a hamburger, not fries), because I really don\u0027t like fast food. I don\u0027t like restaurants. It has always bugged my family(in a cute way), that I would very rarely go out to eat with them. I am a very, very picky eater, always have been since I was a kid. When I finally went to see my doctor, she told me I was gathering fluids and put me on a water pill. My blood pressure was out of control, my doctor kinda took it serious, but not. Even though I know it is serious. Most days it would be between 194/99 all the way to 216/136. Now my heart rate is high and it is having a hard time pumping. I take A LOT of blood pressure meds., too. My trigicerides are good, I have never had high cholesterol. I have been under a lot of stress the past couple of years, but who hasn\u0027t? The doctor believes I have been having tia\u0027s(the tiny strokes), also. I\u0027ll find out about that pretty soon. I don\u0027t want to be put in the hospital, so I told them NO. See, I am just a mess right now and I have to say I am scared to death(ignore the pun). BUT I believe in miracles, I have experienced many miracles my whole life. I refuse to go down without a battle. I believe in prayer and good spells, so send them my way.","Oh well never mind Pat. I didnt mean to stick my nose into other ppl\u0027s privacy. I thought it was something serious. Pewww. :p","Hi Pat Is ok hon, im also a tigress so tiger aint much off. its a compliment. So Thanx pat xoxoxxoxoxox tigger","When you\u0027re done reading this comment Pat, i want you to immediately hit the \"Add Comments\" button , and tell us what it is your Dr. told you!!!?? Thanks! : )","Thanks, Ed. I have typed in and erased dozens of times since yesterday wanting to tell everyone the doctor\u0027s results of one thing wrong with me. But I can\u0027t seem to get it out yet. I\u0027m still in shock.","Hello everyone! Hey Pat-----Welcome back! I don\u0027t donate because most organizations use most of the money for \"administration costs\" What the hell is administration costs.....You paying a salary or two to some people. I believe in taking care of my own first, then investigating a group or groups before I decide to give them any of my hard earned money. Most of the bums on the street live in the streets by choice, and could work if they wanted to. They choose not to because some nice person or persons will come by and take care of them. I never give to a panhandler. I usually tell them to get a job. :)","If someone has a sign \"will work for food\", I don\u0027t see anything wrong with stopping at a store or fast food place and take food back to them. I wouldn\u0027t give them the money, either. I would never bring anyone like that to my house, because many of them are really sick in their minds and you never know if they would come back sometime and steal from you or rape or beat or even kill you. This one guy that I have seen in many different areas has a cooler with ice in it and sells small Gatorades and small Zephyrhills water for $1.00 in the spring and summer(I haven\u0027t seen him around since it has been really chilly or cold). I always buy a water from him. I asked him how much money does he make in one day and he said around $35.00-$40.00. He was an older man and he had a hobble when he walked. He said he was a Viet Nam vet. One day when it was so hot, I gave him a couple of dollars for one water and he very nicely got upset and said he was not bumming. I knew then that I had insulted him. I told him I was sorry and didn\u0027t mean it that way at all. I just wanted to do that for him, because he wasn\u0027t bumming. Now those people that catch you in the parking lot going in a store or coming out and bum for change...NO WAY would I give them money. I can tell by looking at them that they are drunks, drug addicts or whatever. I tell them to get away from me and leave me alone or when I see them coming my way I yell NO. They know and then they go through the parking lot and start hitting other people up. This one man one time was such a practiced con he wore a suit and tie and carried a brief case. I still knew he was just bumming. He gave me this sob story that his wife\u0027s car broke down and she couldn\u0027t pick him up and he needed a taxi to take him home. I told him he was lying to me and go away, he quit talking and I watched him go from person to person. Some fell for it and some didn\u0027t. I refuse to help a drunk or drug addict that needs more booze or drugs. Several years ago I gave a few dollars to this one guy and I told him to go get him something to eat, he said he would. I pulled away and came back around so he wouldn\u0027t see me and he went straight in to a liquor store. Once in a blue moon I will have a strong push to give someone a few bucks and I just know it isn\u0027t being wasted.","LMAO so hard Pat! LOL agree........this is boring. Hey? Does chump change to bum on the streets count as charity?","Is it just me? I know donations are important, but am I the only one that thinks this is boring?","I give whatever I can to charity. Right now I am a stiudent (full time). But once I complete my curriculum and get the job i want, I will donate alot more to charity.","Tigger Bente, sorry I spelled your name Tiger.","Insider, great info. That is why I would never donate to just any charity, because I know a lot goes in the big guy\u0027s pocket. I give my money where I know it\u0027s going for what it says. I still donate a little now and I can\u0027t go to nursing homes now(because of my health). But miracles do happen! Gamo-Pressure, the freemasons and the illuminati have been around for over 200 years. It has been building ever since. It is getting so big world-wide now that people are not afraid to show what they worship(and it\u0027s not the money, either). This planet is fast becoming a one world government. Some still thinks it isn\u0027t real, but that\u0027s okay. Everyone has the right to believe or not believe anything at all. Bam Bam, that was so sweet what you did and you got blessed for it.","I\u0027ve always tried to give what I can. I remember one Christmas I had nothing, broke single mom...I was praying that I would get some money together to buy presents. I was barely making ends meet and took a part time job as a cook at a bar. During the lunch rush I always took my little one with me. I know it sounds bad....but everyone knew us there and it was a upper class neighborhood and my little man sat at watched Nickelodeon while my best friend who managed the bar watched him. Well, when I was a kid I used to put my wishes on those trees at the malls for needy families. So this one year I prayed and said if I could just get the moeny together I would buy a great gift for another child as well. So, a few days before Christmas...all the guys that used to come into the bar during lunch...came in this one night and they all started giving me checks and saying Merry Christmas. I cried in the kitchen behind the shelves I was so touched. I finally had the extra money for Christmas and I went to Toys R Us and found this great little computer learning toy for kids...and IT WAS ON SALE! An extra cool toy and it cost less that day. So, I bought it and put it in the Marines Toys For Tots box. I kept my promise and not only saw God\u0027s grace that year but the Godlieness in men. So, this year although we don\u0027t have much...I donated $10 to an animal shelter and sold Entertainments books for a Golden Retriever Rescue. It wasn\u0027t too bad and we made a little bit of money for them. My husband and I also decided that since the food shelters are running dangerously low on food that we\u0027re going to spend lightly on presents this year and donate more food to needy families. It wasn\u0027t that long ago that we were no different. It\u0027s kind of funny, we drove past a used items store and this god awful couch was for sale. Well, when we moved back to the US we had nothing and the job I came here for fell through. We had to laugh because we were so broke and without furniture for almost a year and I told him if we were still in that boat we be thinking that was the best damn couch we\u0027d every seen! I\u0027ll never forget where I\u0027ve been and never forget that others are still there. Happy Thanksgiving to Everyone!","I give out about 5% of my annual income today. I was once very poor and I know from experience just how crushing it could be to one\u0027s own self esteem when not only you are let down when asking for a tiny contribution from people, but also you and your whole character and your whole being are being judged by them, as if having money somehow qualifies you to judge other people like the God Almighty Himself. I was watching a rather interesting documentary on the youtube about a few of the hottest names in the Hip Hop industry i.e. Jay Z, Kanye West, Naz, Dr. Dre, etc.. and when you look at many of their press photos, you can see how they always like to make the Masonic \"left eye\" pose, which you see in the $1 bills. It is basically meant to symbolize the \"all seeing eye\" from the perspective of power and financial wealth! It is quite a disturbing thought that people today are led to believe that they have the ability to \"see\" life thru the eyes of the God Almighty, only by accumulating wealth. The humanity gets only poorer and poorer if more and more people worshiped the mammon.","I\u0027m broke - I can\u0027t donate. I\u0027m an \u0027insider\u0027 in the charity industry as well: I work for a small graphic design firm (as a designer) owned by a much larger marketing company that markets \u0027campaigns\u0027 (an attempt to gain donations within a window of time) for non-profit \u0026 not-for-profit organizations. These are veterans, law enforcement, firefighters/EMTs, health charities, Jaycees etc organizations. This is when you get telemarketed or directly-mailed brochures \u0026 other info about the organization that asks you to donate. My company is not doing well because people aren\u0027t donating much - thus my hourly wage is next to nothing and barely enough to live off of. I\u0027d love to get a different, better, more stable job or change careers, but the economy is really scary-bad now. ----All I can say is (as an \u0027insider\u0027 per se), if a person wants to consider donating... DO YOUR HOMEWORK. Call your Better Business Bureau and ask if they are in \u0027good standing\u0027. That piece of info is supposed to come FREE because it\u0027s separate from ordering a report. Some charities give way way too much of the money (like 90%) to fund their top officers\u0027 salaries, then do next to nothing to better your local communities or problem-solve. I hate to point fingers, but veterans organizations frequently have this problem, (which is really sad, because as far as I\u0027m concerned our veterans deserve ALL of the donations for the work they\u0027ve done.) The BBB can sometimes get you the percentage rates of how much of that money is given to the charity or how it\u0027s used. ---There is another place you can often go to in your (American) State. Often your State\u0027s Attorney General or Secretary of State\u0027s Office (or some variation of that name) is in charge of that info. Sometimes the info is even free of charge! Some charities are not registered with the State you are living in - which may or may not be required by law in your state. Some states don\u0027t even have an official registry office, while others, like Colorado, are huge sticklers, requiring all info to be easily disclosed in public. So if your state REQUIRES that a charity must be registered with them (ie the charity will have an official state registration number and/or Federal tax ID on file) and if the charity doesn\u0027t have this filed - then don\u0027t give to them. It\u0027s a red flag! They are likely filed as \u0027bad standing\u0027 with BBB too. If the BBB has not heard of the charity you inquire about, then they are automatically given a \u0027bad\u0027 rating until they can send someone to investigate. Lastly, if it means a lot to you, purchasing official reports on the charities you are interested in, although a bit pricey, can also save you future headaches. I hope this insider info can help you all.","Tiger Bente and Nadia, I agree with both of you. When in school, it is hard to give money or donate. Maybe once a week donate yourself at a homeless shelter or something. I have been in poverty before and at one point my kids and I were homeless and travelled with a carnival. Yes, I was a carnie at one time. I have done some really odd jobs to put food on the table. My daughter said she remembers at one time when they were young when I only had enough food to feed them and I never ate. I looked really, really bad. During this time now, I was giving more than 10%. Times have been so tough, I try to give 1%-5%. When I was well, I would give of myself, now I can\u0027t even do that.","My little income does not match my husbands, but I give so much out of my check because, I know how hard life is when you are alone, cold and hungry. Now I have a more disposable income that I don\u0027t need to always just waste on frivolties. Without family,there was a long period in my life where I needed help. So I understand poverty deeply...","As a Student u aint got much to give to charity, so all in all 1% of almost nothing is like a LOT. Consider as student u r mostly a charity case urself."]],"pageTitle":"Poll - Mystic Games","title":"","url":"http://www.mysticgames.com/poll.html/_56_no","hasHeader":false,"headerPosition":"NONE","tableType":"ENTITY","tableNum":11,"s3Link":"common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981460.12/warc/CC-MAIN-20150728002301-00002-ip-10-236-191-2.ec2.internal.warc.gz","recordEndOffset":606323371,"recordOffset":606270273,"tableOrientation":"HORIZONTAL","textBeforeTable":"27% 10% of my yearly income or more 27% About 5% of my yearly income 27% About 1% of my yearly income. 27% Nothing. I don\u0027t give to charity. Total Voters: 1389 My yearly donations to charity amount to: Quick Poll Results Oracle Articles Dreams Names","textAfterTable":"Links| Contact Us| Terms of Use| Privacy Notice Copyright  1998-2007 Mysticgames.com. All rights reserved. Use of our website is subject to the Terms of Use.","hasKeyColumn":false,"keyColumnIndex":-1,"headerRowIndex":-1}