{"relation":[["Issue Date","Feb-2005","Feb-2006","2009","2011","Sep-2005","Jul-2010"],["Title","Menstrual cycle, pregnancy and oral contraceptive use alter attraction to apparent health in faces","Menstrual cycle, trait estrogen level, and masculinity preferences in the human voice","Trade-offs between markers of absolute and relative quality in human facial preferences","Using motion-sensing remote controls with older adults","The voice and face of woman: one ornament that signals quality?","Women\u0027s preferences for masculinity in male faces are highest during reproductive age range and lower around puberty and post-menopause"],["Author(s)","Jones, B. C.; Perrett, D. I.; Little, A. C.; Boothroyd, L.; Cornwell, R. E.; Feinberg, D. R.; Tiddeman, B. P.; Whiten, S.; Pitman, R. M.; Hillier, S. G.; Burt, D. M.; Stirrat, M. R.; Law Smith, M. J.; Moore, Fhionna R.","Feinberg, D. R.; Jones, B. C.; Law Smith, M. J.; Moore, Fhionna R.; DeBruine, Lisa M.; Cornwell, R. E.; Hillier, S. G.; Perrett, D. I.","Saxton, Tamsin K.; Little, Anthony C.; Rowland, Hannah M.; Gao, Ting; Roberts, S. Craig","von Bruhn Hinné, Thomas; Keates, Simeon","Feinberg, David R.; Jones, Benedict C.; DeBruine, Lisa M.; Moore, Fhionna R.; Law Smith, Miriam J.; Cornwell, R. Elisabeth; Tiddeman, Bernard P.; Boothroyd, Lynda G.; Perrett, David I.","Little, Anthony C.; Saxton, Tamsin K.; Roberts, S. Craig; Jones, Benedict C.; DeBruine, Lisa M.; Vukovic, Jovana; Perrett, David I.; Feinberg, David R.; Chenore, Todd"],["Type","Journal Article","Journal Article","Journal Article","Conference Paper","Journal Article","Journal Article"]],"pageTitle":"Abertay Research Collections: Browsing DSpace","title":"","url":"https://repository.abertay.ac.uk/jspui/browse?type\u003dsubject\u0026sort_by\u003d1\u0026order\u003dASC\u0026rpp\u003d20\u0026etal\u003d-1\u0026value\u003dAttractiveness\u0026starts_with\u003dI","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"RELATION","tableNum":7,"s3Link":"common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988650.53/warc/CC-MAIN-20150728002308-00069-ip-10-236-191-2.ec2.internal.warc.gz","recordEndOffset":885725012,"recordOffset":885716810,"tableOrientation":"HORIZONTAL","textBeforeTable":"\u003c previous  Showing results 6 to 11 of 11 All 1 5 10 15 20 25 30 35 40 45 50 5 10 15 20 25 30 35 40 45 50 55 60 65 70 75 80 85 90 95 100 Authors/Record: Ascending Descending Results/Page issue date title submit date In order: Sort by: or enter first few letters:    Jump to: 0-9 A B C D E F G H I J K L M N O P Q R S T U V W X Y Z","textAfterTable":"Showing results 6 to 11 of 11 \u003c previous    DSpace Software Copyright © 2002-2010  Duraspace - Feedback","hasKeyColumn":false,"keyColumnIndex":-1,"headerRowIndex":0}