{"relation":[["Product Type: Flush Mount","Fixture Material: Stainless Steel","Shade Included: Yes Shade Material: Glass","Bulb Voltage: 120 Volts (V)","Bulb Cover Included: No","Number of Lights: 1","Power Source: Hardwired","Country of Manufacture: Imported","Bulb Type (Incandescent Bulb Type): Incandescent"],["Style: Contemporary","Number of Items Included: 1","Bulb Wattage: 40 Watts (W)","Bulb Cover Required: No","Bulb Included: Yes","Room Use: Hallway; Bathroom; Living Room","Eco-Friendly: Yes","Bulb Type (Halogen Bulb Type): Halogen",""]],"pageTitle":"Besa Lighting Mia Interior-Only 1 Light Wall Sconce | AllModern","title":"","url":"http://www.allmodern.com/Besa-Lighting-Mia-Interior-Only-1-Light-Wall-Sconce-1SW-1779-BN1207.html","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"ENTITY","tableNum":0,"s3Link":"common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988650.53/warc/CC-MAIN-20150728002308-00069-ip-10-236-191-2.ec2.internal.warc.gz","recordEndOffset":286943855,"recordOffset":286894900,"tableOrientation":"VERTICAL","TableContextTimeStampAfterTable":"{56395\u003dWayfair LLC, 4 Copley Place, Floor 7, Boston, MA 02116 | Terms of Use | Site Map, 56264\u003dCopyright 2002 - 2015 by AllModern, a division of Wayfair LLC. All rights reserved.}","textBeforeTable":"Features Overall Product Weight: 4lbs Back Plate: 5\" H x 5\" W Shade: 4.5\" H x 5\" W x 5\" D Overall: 8.5\" H x 5\" W x 6\" D Weights \u0026 Dimensions Specifications + More Shade Material: Glass Shade Included Title 24 Compliant: Yes UL Listed: No Number of Lights: 1 Style: Contemporary Bulb Included: Yes Bulb Wattage: 40 Watts (W) Bulb Type (Incandescent Bulb Type): Incandescent Bulb Type (Halogen Bulb Type): Halogen cUL Listed: No Bulb Voltage: 120 Volts (V) Product Details Mia collection One light wall sconce Features Information Back To Top Q\u0026A Reviews","textAfterTable":"Specifications UL Listed: No cUL Listed: No Damp, Dry, or Wet Location Listed: Damp ETL Compliant: Yes Title 24 Compliant: Yes   Style The Mia Interior-Only 1 Light Wall Sconce is a Contemporary style product. Contemporary style bridges the gap between traditional and modern. Pieces feature simple and clean lines with smooth surfaces without any carving or adornment. You can shop for more Contemporary Wall Sconces in the Lighting section of our site. More About This Product When you buy a Besa Lighting Mia Interior-Only 1 Light Wall Sconce online from AllModern, we make it as easy as possible for you to find out when your product will be delivered. You can check on a delivery estimate for the Besa Lighting Part #: 1SW-1779 here. If you have any questions about your purchase or any other Wall Sconces product for sale our customer service representatives are available to help.Whether you just want to buy a Besa Lighting Mia Interior-Only 1 Light Wall Sconce or shop for your entire home, AllModern has all of your design needs covered. + More Shipping","hasKeyColumn":true,"keyColumnIndex":0,"headerRowIndex":0}