{"relation":[["Author","NintyMan","","Author","OdnetninAges","","Author","SheldonRandoms","","Author","TheGreatLord","","Author","NintyMan","","Author","TheGreatLord","","Author","GamecubeMan","","Author","zoroarkrules25","","Author","Orngeblu","","Author","NintyMan","","Author","Orngeblu","","Author","DreamyViridi","","Author","mamp","","Author","LeVideoGamer","","Author","Orngeblu","","Author","LeVideoGamer","","Author","Staff Jazzer94","","Author","TheGreatLord","","Author","LeVideoGamer","","Author","TheGreatLord",""],["Message","3,001. Posted: Tue 5th Nov 2013 01:58 GMT Now let\u0027s move on to Kirby characters. I believe King Dedede will return, and his new final smash without a doubt should be Masked Dedede. He would be twice as powerful in this state, like Wario was twice as powerful as Wario-Man. @zoroarkrules25: What\u0027s the source of those rumors? Edited on Tue 5th November, 2013 @ 02:03 by NintyMan","Miiverse https://miiverse.nintendo.net/users/DestinyMan Vote KIng K. Rool for Super Smash Bros. for Nintendo 3DS and Wii U! Support Yooka-Laylee! Nintendo Network ID: DestinyMan","Message","3,002. Posted: Tue 5th Nov 2013 02:18 GMT @zoroarkrules25 Gee, that sure looked fun, let me try: zoroarkrules25 wrote: There are a few interesting rumors but i can\u0027t post them since the 3DS browser sucks and I\u0027m too busy catching em\u0027 all. Anyway the gist of them is that k rool will be released when tropical freeze is released, kat and ana work as a duo and are a clone of the ice climbers moveset wise, chrom was going to be in the game, but got replaced by reggie fils amie at the last second due to popular demand and that the game comes out april 1st 2013. Your thoughts? lol, just kidding, dude. But seriously, please don\u0027t do that again.","Console Usernames: Rc LOL, RAYMAN \"I\u0027ll destroy the illusion with my right hand!\" Miiverse Profile My Anime List NSLU Playthrough with friends Check out Ninten-Times! The Greatest Work of Fiction ever made I finally got a Wii U for Christmas! Nintendo Network ID: Ages97","Message","3,003. Posted: Tue 5th Nov 2013 02:29 GMT @DestinyMan Daroach should also be added in because............the game needs more mouses.","SUPER SMASH CLASH: A MOBILE MULTIPLAYER PLATFORMER FIGHTING GAME FEATURING MR.RANDOMS AND SOMEBODY HE KNOWS, ZIGGURAT!!!(But he\u0027s coming soon, via an update) http://www.smashclashapp.com/ I like to rev up those fryers, I play games, I make stuff with stick figures named Sheldon and Mr. Randoms. Nintendo Network ID: SheldonRandoms","Message","3,004. Posted: Tue 5th Nov 2013 07:22 GMT SheldonRandoms wrote: @DestinyMan Daroach should also be added in because............the game needs more mouses. I think he has little chance to be able to join","TheGreatLord Nintendo Network ID: BlueMario1998","Message","3,005. Posted: Tue 5th Nov 2013 08:37 GMT \"Photo strip of the day. Plant it, water it, and then timber! It\u0027s high maintenance but totally worth the effort! It needs tactics like never before.\" Edited on Tue 5th November, 2013 @ 08:37 by NintyMan","Miiverse https://miiverse.nintendo.net/users/DestinyMan Vote KIng K. Rool for Super Smash Bros. for Nintendo 3DS and Wii U! Support Yooka-Laylee! Nintendo Network ID: DestinyMan","Message","3,006. Posted: Tue 5th Nov 2013 09:27 GMT DestinyMan wrote: \"Photo strip of the day. Plant it, water it, and then timber! It\u0027s high maintenance but totally worth the effort! It needs tactics like never before.\" so I am guessing the villager will be a strategic type","TheGreatLord Nintendo Network ID: BlueMario1998","Message","3,007. Posted: Tue 5th Nov 2013 13:51 GMT WingedSnagret wrote: FishieFish wrote: Wonder_Mask wrote: Mickey wrote: Wonder_Mask wrote: WingedSnagret wrote: I know his chances are slimmer then average, but I\u0027m gonna be upset if Ike is cut. I will giggle like a little schoolgirl if Ike gets cut. Especially if he gets replaced with Chrom, or some magic user. \u003e:3 I\u0027d just be giddy if, on the next Nintendo Direct, Mr. Iwata said \"Because of the popularity of \u0027Fire Emblem: Awakening\u0027, we have decided to replace [Ike or Marth.] with Lucina.\" Why? Because then the Internet would explode and devolve into the sexist wasteland I know it is. And when all is said and done and the streets are on fire, I\u0027ll be there to say \"I knew it! Even though I\u0027ve seen the Internet act this way several times before, and it really didn\u0027t need reinstatement, I knew the Internet was this bad!\" And then I will laugh. I\u0027d prefer Micaiah to Lucina, because she would literally be the same as Marth. Micaiah at the least is a magic user, and she had more personality than Lucina. u_u Costumes maybe. And they will probably not add Lucina, since the game came out in only 2012 in Japan, and spoilers. What about Robin (aka My Unit) from Awakening? Think about it, he could have options to use either a sword or a magic tome, plus have a gender swap like Wii Fit Trainer. Kill two birds with one stone. u_u However that would just add to the growing list of customizable characters... I saw this one youtube comment on a video for the game\u0027s soundtrack (it has almost been a year and the music still hasnt gotten old for me) and the user suggested that Smash Bros 4 should take the avatar you have saved on file and put that specific My unit and put it in the game. Its a really interesting idea but I doubt it will see the light of day.","Gamecubeloggery Forget the Nintendo seal of approval I only see GC 4.0 happening if I become a English major. Yeah, it is happening now. GC 4.0 will be released in 2020. My Bio by True_Hero Twitter: jazzygcnman","Message","3,008. Posted: Tue 5th Nov 2013 14:22 GMT OdnetninAges wrote: @zoroarkrules25 Gee, that sure looked fun, let me try: zoroarkrules25 wrote: There are a few interesting rumors but i can\u0027t post them since the 3DS browser sucks and I\u0027m too busy catching em\u0027 all. Anyway the gist of them is that k rool will be released when tropical freeze is released, kat and ana work as a duo and are a clone of the ice climbers moveset wise, chrom was going to be in the game, but got replaced by reggie fils amie at the last second due to popular demand and that the game comes out april 1st 2013. Your thoughts? lol, just kidding, dude. But seriously, please don\u0027t do that again. Lol, it took me a minute to realize what happened there. Honestly I wouldn\u0027t mind if what you edited came true. Anyway here are the links: http://www.vgleaks.com/rumor-super-smash-bros-wii-u-3ds-relea... I can\u0027t find the leaks to the rest, I think the person deleted the thread, so they are probably fake.","3ds friend code:3007 8328 5371","Message","3,009. Posted: Tue 5th Nov 2013 16:09 GMT TheGreatGamer wrote: DestinyMan wrote: \"Photo strip of the day. Plant it, water it, and then timber! It\u0027s high maintenance but totally worth the effort! It needs tactics like never before.\" so I am guessing the villager will be a strategic type I think that attack is going to be hard to use effectively, though. Looks like it\u0027ll be easy enough to zone the tree, lol. Hope this doesn\u0027t promote camping either...looks like it can be used as an obstacle to hide behind. x.x So maybe that\u0027s a plus to it\u0027s viability, lol. Edited on Tue 5th November, 2013 @ 16:19 by Orngeblu","Brawl Friend Code: 3395-4738-9505 I also have a 3DS and Wii U. \u003c3 Smash Bros. Nintendo Network ID: Orngeblu","Message","3,010. Posted: Tue 5th Nov 2013 16:15 GMT You can see it in action during the Developer Direct from E3. I think it\u0027s a taunt that also happens to take damage if there\u0027s a fighter standing nearby and gets hit from the fallen tree.","Miiverse https://miiverse.nintendo.net/users/DestinyMan Vote KIng K. Rool for Super Smash Bros. for Nintendo 3DS and Wii U! Support Yooka-Laylee! Nintendo Network ID: DestinyMan","Message","3,011. Posted: Tue 5th Nov 2013 16:20 GMT DestinyMan wrote: You can see it in action during the Developer Direct from E3. I think it\u0027s a taunt that also happens to take damage if there\u0027s a fighter standing nearby and gets hit from the fallen tree. You may be right, because I\u0027m pretty sure Down-B is bowling ball, Neutral B is the slingshot...didn\u0027t we see a pic of him riding a Gyroid once though? Maybe that\u0027s his Side-B?","Brawl Friend Code: 3395-4738-9505 I also have a 3DS and Wii U. \u003c3 Smash Bros. Nintendo Network ID: Orngeblu","Message","3,012. Posted: Tue 5th Nov 2013 16:28 GMT DestinyMan wrote: You can see it in action during the Developer Direct from E3. I think it\u0027s a taunt that also happens to take damage if there\u0027s a fighter standing nearby and gets hit from the fallen tree. I don\u0027t know about that. Animation seems a bit long for just a taunt. Maybe the special (whichever one it is) consists of three parts with the last part being the pay off attack.","Once a LuigiMan, now a Dreamy representation of the Goddess of Nature. Retired Palutena Gem Provider. The Kid Icarus League\u0027s LuigiMan200 - Bio by True_Hero. My YouTube Channel Nintendo Network ID: LuigiMan200","Message","3,013. Posted: Tue 5th Nov 2013 16:43 GMT I wonder what the AC villager\u0027s final smash will be? I wonder if it can top my idea (leaf storm, a bunch of leaves fall from the sky and then \"POOF\" they transform into giant furniture and rain down on everyone).","The cat\u0027s the only cat who knows where it\u0027s at. NNID: Muffin-Gun","Message","3,014. Posted: Tue 5th Nov 2013 17:03 GMT Orngeblu wrote: DestinyMan wrote: You can see it in action during the Developer Direct from E3. I think it\u0027s a taunt that also happens to take damage if there\u0027s a fighter standing nearby and gets hit from the fallen tree. You may be right, because I\u0027m pretty sure Down-B is bowling ball, Neutral B is the slingshot...didn\u0027t we see a pic of him riding a Gyroid once though? Maybe that\u0027s his Side-B? Neutral-B: Seems to be the tree planting move Side-B: Probably the move where he grabs a projectile Up-B: Balloon fighter hat Down-B: Possibly the bowling ball","http://london.craigslist.co.uk/vgm/4237975235.html Wii U owners in London, please check it out!","Message","3,015. Posted: Tue 5th Nov 2013 18:05 GMT LeVideoGamer wrote: Orngeblu wrote: DestinyMan wrote: You can see it in action during the Developer Direct from E3. I think it\u0027s a taunt that also happens to take damage if there\u0027s a fighter standing nearby and gets hit from the fallen tree. You may be right, because I\u0027m pretty sure Down-B is bowling ball, Neutral B is the slingshot...didn\u0027t we see a pic of him riding a Gyroid once though? Maybe that\u0027s his Side-B? Neutral-B: Seems to be the tree planting move Side-B: Probably the move where he grabs a projectile Up-B: Balloon fighter hat Down-B: Possibly the bowling ball Ok, maybe you\u0027re right about Neutral B. We haven\u0027t seen Villager use a grounded, neutral A move, maybe THAT is the slingshot. Might be right about the projectile grab too. It\u0027s actually quite confusing to think which move goes where...because Villagers moveset is pretty odd. Edited on Tue 5th November, 2013 @ 18:09 by Orngeblu","Brawl Friend Code: 3395-4738-9505 I also have a 3DS and Wii U. \u003c3 Smash Bros. Nintendo Network ID: Orngeblu","Message","3,016. Posted: Tue 5th Nov 2013 18:38 GMT Orngeblu wrote: LeVideoGamer wrote: Orngeblu wrote: DestinyMan wrote: You can see it in action during the Developer Direct from E3. I think it\u0027s a taunt that also happens to take damage if there\u0027s a fighter standing nearby and gets hit from the fallen tree. You may be right, because I\u0027m pretty sure Down-B is bowling ball, Neutral B is the slingshot...didn\u0027t we see a pic of him riding a Gyroid once though? Maybe that\u0027s his Side-B? Neutral-B: Seems to be the tree planting move Side-B: Probably the move where he grabs a projectile Up-B: Balloon fighter hat Down-B: Possibly the bowling ball Ok, maybe you\u0027re right about Neutral B. We haven\u0027t seen Villager use a grounded, neutral A move, maybe THAT is the slingshot. Might be right about the projectile grab too. It\u0027s actually quite confusing to think which move goes where...because Villagers moveset is pretty odd. I agree, it\u0027s all quite confusing. I\u0027m thinking the slingshot could be a back air, but it could be anything at this point.","http://london.craigslist.co.uk/vgm/4237975235.html Wii U owners in London, please check it out!","Message","3,017. Posted: Tue 5th Nov 2013 18:43 GMT I\u0027m starting to think AC villager could be absolutely dominant against ledge grabbers with that tree move.","PSN: mangaJman SSBB FC: 1204-1132-2888 The Jazzloggery Once you see you can never unsee Everyone\u0027s favorite videogame character I keep getting this feeling that I should write something down here........................ Nintendo Network ID: Justinius94","Message","3,018. Posted: Tue 5th Nov 2013 18:43 GMT My hype is kind of dying down, but I still really want it, nothing will effect how much I want it.","TheGreatLord Nintendo Network ID: BlueMario1998","Message","3,019. Posted: Tue 5th Nov 2013 18:57 GMT TheGreatGamer wrote: My hype is kind of dying down, but I still really want it, nothing will effect how much I want it. They could try to make the images more interesting, but it\u0027s better they do this than reveal everything at once. Then we\u0027d just be bored for a year.","http://london.craigslist.co.uk/vgm/4237975235.html Wii U owners in London, please check it out!","Message","3,020. Posted: Tue 5th Nov 2013 19:00 GMT LeVideoGamer wrote: TheGreatGamer wrote: My hype is kind of dying down, but I still really want it, nothing will effect how much I want it. They could try to make the images more interesting, but it\u0027s better they do this than reveal everything at once. Then we\u0027d just be bored for a year. When was the last time they announced a character?","TheGreatLord Nintendo Network ID: BlueMario1998"]],"pageTitle":"Super Smash Bros. for Wii U Thread - Wii U Forum - Page 151","title":"","url":"http://www.nintendolife.com/forums/wii-u/super_smash_bros_cafe_thread?start\u003d3000","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"LAYOUT","tableNum":0,"s3Link":"common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988650.53/warc/CC-MAIN-20150728002308-00069-ip-10-236-191-2.ec2.internal.warc.gz","recordEndOffset":618819183,"recordOffset":618758778,"tableOrientation":"HORIZONTAL","TableContextTimeStampAfterTable":"{38873\u003dPSN: mangaJman SSBB FC: 1204-1132-2888 The Jazzloggery Once you see you can never unsee Everyone\u0027s favorite videogame character I keep getting this feeling that I should write something down here........................, 34064\u003dEdited on Tue 5th November, 2013 @ 18:09 by Orngeblu, 17966\u003d3,008. Posted: Tue 5th Nov 2013 14:22 GMT, 38400\u003d3,017. Posted: Tue 5th Nov 2013 18:43 GMT, 30076\u003d3,014. Posted: Tue 5th Nov 2013 17:03 GMT, 16724\u003dGamecubeloggery Forget the Nintendo seal of approval I only see GC 4.0 happening if I become a English major. Yeah, it is happening now. GC 4.0 will be released in 2020. My Bio by True_Hero, 3331\u003dThere are a few interesting rumors but i can\u0027t post them since the 3DS browser sucks and I\u0027m too busy catching em\u0027 all. Anyway the gist of them is that k rool will be released when tropical freeze is released, kat and ana work as a duo and are a clone of the ice climbers moveset wise, chrom was going to be in the game, but got replaced by reggie fils amie at the last second due to popular demand and that the game comes out april 1st 2013. Your thoughts?, 40063\u003d3,018. Posted: Tue 5th Nov 2013 18:43 GMT, 9207\u003d3,005. Posted: Tue 5th Nov 2013 08:37 GMT, 42931\u003d3,020. Posted: Tue 5th Nov 2013 19:00 GMT, 203978\u003d© 2015 Nintendo Life, part of Gamer Network. This site is not affiliated with Nintendo. Hosted at dx.net., 32183\u003d3,015. Posted: Tue 5th Nov 2013 18:05 GMT, 41347\u003d3,019. Posted: Tue 5th Nov 2013 18:57 GMT, 26688\u003d3,012. Posted: Tue 5th Nov 2013 16:28 GMT, 24834\u003d3,011. Posted: Tue 5th Nov 2013 16:20 GMT, 35224\u003d3,016. Posted: Tue 5th Nov 2013 18:38 GMT, 5614\u003d3,003. Posted: Tue 5th Nov 2013 02:29 GMT, 12771\u003d3,007. Posted: Tue 5th Nov 2013 13:51 GMT, 20776\u003d3,009. Posted: Tue 5th Nov 2013 16:09 GMT, 7403\u003d3,004. Posted: Tue 5th Nov 2013 07:22 GMT, 28812\u003d3,013. Posted: Tue 5th Nov 2013 16:43 GMT, 9712\u003dEdited on Tue 5th November, 2013 @ 08:37 by NintyMan, 1394\u003dEdited on Tue 5th November, 2013 @ 02:03 by NintyMan, 2707\u003d3,002. Posted: Tue 5th Nov 2013 02:18 GMT, 23278\u003d3,010. Posted: Tue 5th Nov 2013 16:15 GMT, 11025\u003d3,006. Posted: Tue 5th Nov 2013 09:27 GMT, 597\u003d3,001. Posted: Tue 5th Nov 2013 01:58 GMT, 8442\u003dNintendo Network ID: BlueMario1998, 22135\u003dEdited on Tue 5th November, 2013 @ 16:19 by Orngeblu, 15639\u003dCostumes maybe. And they will probably not add Lucina, since the game came out in only 2012 in Japan, and spoilers.}","textBeforeTable":"Showing 3,001 to 3,020 of 27,151 Topic: Super Smash Bros. for Wii U Thread Super Smash Bros. for Wii U Thread » Wii U » Forums » Home Navigation: Wii U Forum About The Site Off Topic Channels General Discussion Search Forums Wallpapers Cover Gallery Videos Screenshots Media Coming Soon Out Now Games Competitions Podcast Interviews Guides \u0026 FAQs Latest Features Features Reviews Upcoming Releases Nintendo Direct Nintendo Download News E3 2015 Wii Retro DSiWare DSi 3DS eShop","textAfterTable":"« Previous 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 32 33 34 35 36 37 38 39","hasKeyColumn":false,"keyColumnIndex":-1,"headerRowIndex":0}