{"relation":[["1696","1698","1700","1701","1702","1703","1704","1705","1707","1709","1710","1711","1712","1713","1714","1715","1716","1717","1718","1719","1720","1721","1724","1728","1733","1736","1737","1752","1753","1766","1768","1769","1770","1771","1774","1781","1782","1783","1784","1787","1788","1789","1790","1791","1798","1799","1805","1806","1807","1810","1815","1819","1823","1827","1829","1834","1836","1841","1846","1848","1853","1854","1855","1856","1863","1864","1865","1866","1867","1872","1874","1876","1877","1878","1883","1884","1887","1897","1900","1901","1903","1904","1905","1906","1907","1909","1910","1911","1912","1913","1914","1915","1916","1917","1918","1919","1920","1921","1924","1925","1926","1928","1929","1932","1933","1934","1935","1936","1938","1939","1941","1942","1943","1944","1945","1950","1951","1953","1955","1959","1962","1963","1966","1967","1969","1970","1974","1975","1977","1978","1981","1982","1983","1985","1990","1992","1993","1994","1995",""],["- Peter the Great Edict about creation of regular Navy on Azov sea has been approved by Boyar\u0027s Council. The first galley \"Principium\" made on Voronezh shipyard. Seizure of Azov (the Turkish fortress Azak) with the support of galleys - the first fighting formation of Russian Fleet.","- Naval Battle Order was created. There was opened Naval School in Moscow, afterwards it has been moved to Azov.","- Jack (bowsprit ensign) was introduced. The sailing Fleet was separated from rowing Fleet. The North War with Sweden began. Attempt of Swedish squadron to seize Arkhangelsk was repelled.","- The Navigation School was founded in Moscow.","- The first ships for Baltic Fleet were laid (the shipyard on the Syas River). Notteburg (Oreshek) was seized, afterwards it was renamed into Schlisselburg (and from 1944 - Petrokrepost).","- Russian Fleet gained the first victory in the North War. The first warship for Baltic Fleet \"Schtandart\" has been built. There was built fortress Kronschlot on the Kotlin Island. Admiral School was opened in Voronezh. The first medal for victory \"In memory of seizure of two Swedish vessels in Neva estuary\" was instituted.","- Kronschtadt was founded. Building of Admiralty\u0027s shipyard started in St.Petersburg.","- Peter the Great issued an Edict about foundation of naval regiment (starting of marines). The Navy defended St.Petersburg in the North War.","- Handing Navy sovereignty to Admiral Feodor Apraksin the Admiralty President and vice-admiral Korneli Kruis the Admiralty vice-President took place.","- The first battle ship \"Poltava\" (designed by Peter the Great and Feodosy Sklyaev) was laid on Admiralty\u0027s shipyard. The model-camera - the first Russian Navy Museum attached to the Admiralty was founded (now it is called Central Navy Museum).","- Seizing Viborg. Admiral-General Fedor Apraksin got the first order of St. Apostole Andrei Pervozvanny.","- Gun-casting yard was founded in St.Petersburg. Admiralty\u0027s school was opened in Arkhangelsk.","- Galley yard was founded in St.Petersburg. Navy and Admiralty Orders were abolished due to establishing of the Navy Office. The first battle ship \"Poltava\" was launched.","- Alexei Burtsev - master of Petersburg Civil shipyard - suggested the project of building wheeled vessels.","- Rowing Fleet gained the first great victory in Navy history over the Swedish vessel squadron near Gangut peninsula (now Hanko). The Gold medal for officers and Silver medal for sailors \"For the battle of Gangut\" were instituted.","- There was founded Admiralty Hospital in St.Petersburg (now the First Naval Hospital).","- There was founded Naval Academy in St.Petersburg (Academy of Saval Guards). Naval Regulations were introduced (the ranks were put into the system).","- The Supreme Body for Navy managing - Admiralties Board - was founded.","- Fedor Apraksin was appointed the first President of Admiralties Board. Peter the Great got a petition from a peasant E.Nikonov about building \"secret vessel\" - a prototype of submarine.","- The first naval victory without boarding was gained (N.A. Sinyavin the 2nd rank captain took by storm the Swedish vessel detachment near the Azel island).","- Galley Navy commanded by General M.M. Golitsyn won a victory over Swedish squadron near the Grengam island. The first Naval Regulations worked out by Peter the Great was published.","- The North War was finished. Nischtadt peace was made and Russia got predominance in Baltic Sea. There was founded rowing port in St.Petersburg.","- The Navy Archives attached to Admiralties Board was founded. The Nikonov\u0027s \"secret vessel\" has been tested.","- Naval Cadet company attached to Naval Academy was founded at St.Petersburg.","- Don (Azov) Flotilla was founded.","- Azov was seized with support of Don Flotilla.","- Dnestr Flotilla was founded.","- Gentry College was founded Attached to Naval Academy at St.Petersburg.","- Navigation College was founded in Irkutsk.","- Naval Assembly for naval officers\u0027 studies was founded in Revel.","- Russian-Turkish War began (1768-1774).","- The Order \"St.George\" of four degrees was instituted.","- The Chesmen Victory. The medal \"For taking part in Chesmen battle\" was instituted (for rewarding officers and sailors of Baltic Navy).","- Foundation of Dunai rowing flotilla took place.","- Kuchuk-Kainardzhansky peace was established - the end of Russian-Turkish War.","- The first Russian Nautical college was opened in Kholmogory.","- Naval College was opened in Kherson (trained gentry as naval officers and raznochinets as navigators and ship-builders). The Order of \"St.Vladimir\" (of four degrees) was instituted.","- The Navy Forces in the South of Russia were named as the Black Sea Navy. Sevastopol was founded.","- The \"water-driving\" school was opened in St.Petersburg.","- Beginning of Russian-Turkish War for Crimea (1787-1791)","- The medal \"For courage in the Ochakov waters\" was instituted in honor of victory of Russian rowing flotilla of Ochakov.","- The medal \"For victory over Sweden in the Finnish waters\" on the Saint George Ribbon was instituted (for other ranks of Baltic rowing Navy).","- Rear-admiral F.F. Ushakov was appointed the commander of Black Sea Navy. The medal \"For making peace with Sweden\" on Saint Vladimir Ribbon was instituted (for other ranks).","- The end of the Russian-Turkish war. Yass\u0027s peace. Joining Crimea and Kuban to Russia was confirmed.","- The school of naval architecture was opened in St.Petersburg.","- Korfu island was gained by joined Russian-Turkish Navy commanded by F.Ushakov.","- The Central Naval Library was founded.","- The beginning of Russian-Turkish war (1806-1812).","- \"Decoration of Military order\" was instituted (other ranks were awarded for military feat, since 1913 it has been named \"George Cross\").","- The 2nd Baltic naval carriage was formed as a coastal part of Baltic Navy.","- The first Russian steamship \"Elizaveta\" was built in St.Petersburg.","-The George Ensign was instituted, it was designed on the basis of Saint Andrew Ensign. The launches \"Peaceful\" and \"East\" commanded by M.P.Lazarev and F.F.Bellinsgauzen went out of Kronstadt for the first Antarctic Expedition (ended in 1821).","- The first Russian steam battleship \"Meteor\" was laid. (Some sources of information says that the first was \"Vesuvius\" launched in 1820).","- The battle of Navarin. (Joined Russian-English-French Navy defeated Turkish-Egypt Navy). The hydrographic service was founded.","- The medal \"For Turkish War\" was instituted. The legendary battle between brig \"Mercury\" (commanded by A.I. Kozarsky) and two Turkish battleships took place.","- The first in the world all-metal submarine was built in St.Petersburg, it was designed by K.A.Shilder and set going by rowers. The explorer of Arctic Pavel Pavlovich Kruzenstern was born.","- 28-gun wheeled steam frigate \"Bogatyr\" was launched.","- The medal \"For zeal\" on Annen ribbon was instituted (for awarding other ranks, who served 22 years in Guards carriage and 25 years in the Navy).","- Steamship \"Courage\" designed by K.A. Shilder was built - a prototype of destroyer. Frigate \"Archimedes\" - the first Russian battleship moved by screw - was laid (engineer I.A.Amosov).","- Frigate \"Archimedes\" was launched. Publishing of periodic naval magazine \"Naval collection\".","- Beginning of the Crimea War (1853-1856). The Sinop battle - everlasting glory of P.S. Nakhimov, the finale of Sailing Navy operations. The first naval battle of steamships (steam frigate \"Vladimir\" and Turkish steam frigate \"Pervas-Bakhri\".","- Beginning of heroic defence of Sevastopol during the Crimea War.","- The medal \"For Sevastopol\u0027s defence\" was instituted.","- The medal \"In memory of the war 1853-1856\" was instituted.","- Squadron of Russian Navy made the first friendly visit to USA.","- The first in the world ice-breaker \"Pilot\" was built (M.O.Britnev)","- I.F.Alexandrovsky created the first self-propelled mine-torpedo.","- A submarine with compressed air engine designed by I.F.Alexandrovsky was built.","- A.A.Popov developed a project of the nautical armored battleship.","- The first parapet-turret battleship \"Peter the Great\" was launched.","- The first Russian mine-layer \"Galvaner\" was built.","- S.K.Dzhevetsky developed a project of a small submarine.","- Russian-Turkish War (1877-1878) began. The first utilization of mine-torpedo weapon. There was launched the first world nautical torpedo-boat \"Explosion\" in St.Petersburg.","- The medal \"In memory of Russian-Turkish War 1877-1878\" was instituted. For other ranks there was instituted the medal \"For courage\" (since 1913 this medal was named George\u0027s). The first successful utilization of torpedo weapon from motor torpedo boat.","- The hydraulic drive of rudder was tested on the torpedo-boat \"Explosion\".","- The first in the world submarine with electric engine with storage battery has been launched (S.K.Dzhevetsky was the author of the project).","- The first mine cruiser \"Lieutenant Il\u0027in\" was built in St.Petersburg. Amur Flotilla was founded.","- S.K.Dzhevetsky invented pipeless torpedo apparatus for submarines.","- Cruiser \"Aurora\" was launched (K.M.Tokarevsky was the author of the project).","- The first battle submarine \"Dolphin\" was developed after I.G.Bubnov\u0027s project.","- The first in the world diesel-electric ship was made on the Sormov plant.","- Russian-Japan War (1904-1905) began. The heroic battle cruiser \"Varyag\" and gunboat \"Korean\" with Japan squadron. The first battle submarine \"Dolphin\" was built on the Baltic Plant in St.Petersburg. Ironclad \"Potyomkin\" was put into operation. The medal \"For battle of Chemulpo for \"Varyag\" and \"Korean\" on Andreev ribbon was instituted.","- Tsusim Battle during which Russia lost 12 iron-clads.","- The first Russian training detachment of submarine navigation was founded in Libava (Liepaya).","- After S.K.Dzhevetsky\u0027s project there was built submarine \"Pochtovy\" with one engine for above and under water motion. Squadron iron-clads were renamed into battleships. The medal \"In memory of Russian-Japan War\" on Alexander-George ribbon was instituted.","- Battle ships as \"Sevastopol\" were laid in St.Petersburg (I.G.Bubnov, A.N.Krylov). There was built a submarine \"Minoga\" (lamprey) (I.G.Bubnov) where reversing diesel engines were used first in the world.","- N.N.Kuteinikov developed the project of diesel battle cruiser. The first anti-torpedo ship \"Minrep\" (type M) was put into operation.","- For the first time there was carried out the raid of submarine from airplane (pilot V.V.Dybovsky). There was formed the first detachment of naval pilots in Sevastopol. Battle ships (type \"Sevastopol\") were put into operation.","- Naval Aircraft was founded in Baltic Navy. The first in the world submarine mine-layer \"Crab\" was launched ( M.P.Naletov was the author of the project).","- Destroyer \"Novik\" was put into operation. It was the first Russian turbine ship set up the world record of speed for battle ships (37,7 knots).","- The first home dreadnouts were created. Utilization of naval aviation in Extreme North conditions began (lieutenant I.Nagursky searched disappeared G.Sedov\u0027s expedition on his airplane \"Farman\"). The first bombing attack was put into practice by naval aviation under Sevastopol (against German battle ship \"Geben\").","- The mine-layer \"Crab\" was launched. Submarines type \"Bars\" formed part of Baltic Navy. Gotland Battle (attempt of German Fleet to enter Riga\u0027s Gulf was repelled).","- Flotilla of Extreme North Ocean was founded.","- Provisional Government abolished shoulder-strapsan and epolete. October Revolution in Petrograd. Andreev\u0027s Flag was substituted for International one - red cloth without emblems and inscriptions.","- V.I.Lenin signed the Decree about foundation of the Workers\u0027 and Peasants\u0027 Red Fleet. The Baltic Navy made an ice-trip from Revel to Kronschtadt. Considerable part of Black Sea Navy was scuttled (battle ship \"Free Russia\", 5 destroyers, 3 torpedo boats). Azov, Chudskaya, Volzhskaya, Onezhskaya Flotillas and Navy of Astrakhan Krai were founded.","- Mutiny in forts \"Krasnaya Gorka\" (Red Hill) and \"Seraya Loshad\" (Grey Horse). The first victory of Republic submarine forces - submarine \"Pantera\" scuttled English destroyer \"Victory\". Don and Dnestr Flotilla were founded.","- The White Sea Flotilla was founded.","- Kronschtadt mutiny.","- The Workers\u0027 and Peasants\u0027 Red Fleet (WPRF) made their first cruise abroad.","- The first Regulations of naval service WPRF were put in force.","- The first series of submarines such as \"Dekabrist\" (designer B.M. Malinin) was laid. The first Soviet motor torpedo-boat \"Pervenets\" ANT-3 (the main constructor A.N. Toupolev) was tested. The series of patrol ships such as \"Uragan\" was laid.","- Serial motor torpedo-boat ANT-4 was launched.","- The first Battle Regulations of Naval Forces WPRA (BR-30) was put in force. Submarines of series \"Dekabrist\" were used instead of \"Bars\".","- The Pacific Ocean Navy was founded. Ship Regulations of WPRA (SR-32) was in force.","- The North Fleet was founded. Submarine \"Schuka\" - leading middle class \"Sch\" of IIId series designed by B.M.Malinin and submarine \"Leninets\" - leading class \"L\" of IInd series mine layer were put into service.","- Submarine \"Malutka\" - leading submarine class \"M\" of VIth series was put into the service (main constructor B.M.Malinin).","- Naval Ensign of USSR was instituted. The first in the world ship on the air-cushion was tested (main constructor V.I.Levkov). The \"Table of Ranks\" was put in force.","- The destroyer \"Gnevny\" - leading of Ist series class 7 was launched.","- The light cruiser \"Kirov\" was put into service - the first Soviet cruiser. The small submarine-chaser class \"SC-4\" was put into operation.","- The Ladoga Navy Flotilla was founded. The submarine \"K-1\" - leading cruiser class \"K\" of XIV series was put into operation.(main constructor M.A.Rudnitsky). Marines was officially registered as an arm of Navy Forces.","- The Great Patriotic War began. Heroic defending of Lispai. Heroic defending of Khanko. Defending of Trans-Polar Land. The first artillery battle during the defence of Riga\u0027s Gulf. The sailors took part in Leningrad Battle. Defending of Tallinn - the main naval base of Red Banner Baltic Navy. Defending of Odessa. The ships of Red Banner Baltic Navy have broken through from Tallinn to Kronschtadt. The birth of Soviet Guard. Defending of Sevastopol - the main naval base of Black Sea Navy. Kerch-Feodosy\u0027s landing operation.","- As a part of land units sailors took part in the battle of Stalingrad. Defence of Novorossijsk. The attack of heavy cruiser \"Admiral Sheer\" on the port Dixon was repelled. The defence of Tuapse.","- The Blockade of Leningrad was broken. Shoulder-straps for personnel staff of Navy were introduced. the leading small base trawler \"T-351\" of 253-L project (\"Stotonnik\") was laid. Nakhimov Naval Colleges were formed. Novorossiisk landing operation. Battle for Caucasus ended. Kerch-Feodosy landing operation.","- Landing of Nikolaev troops during Odessa operation. Vyborg offensive operation. Narva offensive operation. Baltic strategic offensive operation .Moonsoond landing operation. Petsamo-Kirkeness operation.","- Liner \"Wilgelm Gustav\" and large transport \"General fon Shtoimen\" were scuttled by submarine S-13 commanded by A.I.Marinesko. Capitulation of Germany. Victory Parade in Moscow. Navy was represented by composite regiment. Manchzuria strategic offensive operation. Sungar offensive operation - a part of Manchzuria strategic operation. Sasin landing operation. Kuril landing operation (the last operation of the Great Patriotic War)","- Light cruisers class \"Sverdlov\" were put into operation. The Navy Ministry was formed in the USSR.","- The leading cruiser \"Sverdlov\" formed a part of Naval Forces.","- Beginning of building atomic rockets and multi-purposes submarines, ships of the second post-was generation. Cruiser \"Sverdlov\" made his first post-war cruise abroad (to England).","- The first ballistic missile from Soviet submarine was started.","- First in the world atomic ice-breaker \"Lenin\" was put into service.","- The atomic submarine \"Leninsky Komsomol\" reached North Pole.","- Navigating under ice and surfacing in the geographical point of North Pole by submarine.","- The first group of Soviet submarines commanded by counter-admiral A.I.Sorokin made around the world cruise.","- A leading ship of new class - anti-submarine cruiser (ASC) \"Moscow\" formed part of the Navy.","- The second anti-submarine cruiser \"Leningrad\" formed part of the Navy.","- maneuvers \"Ocean\" of Soviet Navy took place on the Atlantic, Pacific, Arctic oceans and bordering seas.","- Mine-sweeping Suez Bag by ships of Navy.","- Cruiser \"Dmitry Pozharsky\" was on the island Mauritius for helping people. The first Soviet aircraft cruiser \"Kirov\" was put into service.","- The atomic ice-breaker \"Arctica\" reached the North Pole.","- The first group sailing under ice was made by atomic submarines in the Arctic Ocean.","- The atomic rocket cruiser \"Kirov\" formed a part of the North Fleet. Training \"West-81\" took place in the Baltic Sea.","- Antarctic Expedition on oceanographic vessels \"Admiral Vladimirsky\" and \"Faddei Bellinsgauzen repeated the route of the first Russian Antarctic Expedition made by F.F.Bellinsgauzen and M.P.Lazarev. The submarine group of the North Fleet accomplished 47-day under-ice sailing.","- Rocket cruisers of class \"Slava\" were put into service.","- Heavy aircraft carrying cruiser \"Soviet Navy Admiral Kuznetsov\" was launched.","- The first visit of Soviet battle ship to Malasia was made for participating in the naval review of 60 battle ship from 20 countries.","- Andreevsky Naval Ensign was re-instituted. An atomic missile carrier commanded by captain Lebedev was under ice without surfacing in the Arctic Ocean more than two months.","- Russian battle ships visited USA and Canada. Russian battle ships visited ports of 11 countries.","- Joint training of Russian Navy and Naval Forces of USA, England and French \"Ganfex-22\" took place in the Persian Gulf. For the first time Russian Navy took part in NATO naval training \"Pomor-94\" in Norway. Destroyer \"Besstrashny\" (project 956) was launched in St.Petersburg. Atomic submarines K-18 and B-414 surfaced in the geographical point of the North Pole and raised the Russian Flag and Andreev Naval Ensign there.","- The main Naval Review devoted to 50-years of Great Victory took place in St.Petersburg. The jubilee Review was commanded by Commander-in-Chief of Navy Admiral F.Gromov. Battle ships from countries-victors in the II World War: mine-sweepers \"Gladiator\" and \"Defender\" (USA), frigates \"Chatem\" (Great Britain), \"Akonit\" (France), \"De-Ruister\" (Holland), mine-sweeper \"Nartsiss\" (Belgium) and 22 battle ships of all 4 Russian Naval Fleets took part in it.","The Andreev Ensign was hoisted on the multi aim submarine \"Dragon\" (TOF). Destroyer \"Besstrashny\" took part in the training \"Baltic Operation - 95\" for Naval Forces of Baltic countries."]],"pageTitle":"Chronology","title":"","url":"http://www.neva.ru/EXPO96/hrono.en.html","hasHeader":false,"headerPosition":"NONE","tableType":"ENTITY","tableNum":0,"s3Link":"common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981969.11/warc/CC-MAIN-20150728002301-00077-ip-10-236-191-2.ec2.internal.warc.gz","recordEndOffset":605063067,"recordOffset":605053728,"tableOrientation":"HORIZONTAL","lastModified":"Thu, 28 Oct 1999 20:10:09 GMT","textBeforeTable":"Chronology","textAfterTable":"","hasKeyColumn":false,"keyColumnIndex":-1,"headerRowIndex":-1}