{"relation":[["","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""],["Units deploying for less than ______ hours are not required to submit a COMMSHIFT, except to Navy facilities.","PROFORMA stands for what?","How many types of COMMSHIFTS are there?","Used to shift communications guards.","Used to establish a permanent or temporary fleet/mobile unit Plan Language Address.","Used to disestablish a permanent or temporary fleet/mobile unit PLA.","Used to change a permanent or temporary fleet/mobile unit PLA.","Used to cancel a previously submitted COMMSHIFT of any kind.","This COMMSHIFT precedence becomes effective in less than 24 hours.","This COMMSHIFT precedence required within 24 to 48 hours.","This COMMSHIFT precedence is required after 48 hours but less than 14 days.","Who do you address COMMSHIFT messages to?","COMMSHIFTs are limited to what classifications?","What is the SSIC for a COMMSHIFT?","What is the CIC for a COMMSHIFT?","Submitted by all cutters whenever unusual communication difficulties are encountered.","When are COMSPOT reports required?","If radio systems are not restored in ____ hrs, a CASREP must be issued.","What manual do you refer to for CASREPS?","What does COMTAC stand for?","What is the central control point for the administration and maintenance of COMTAC publications within a command?","True/False CG publications not applicable to the Navy are part of the COMTAC system.","All classified material shall be controlled and handled in accordance with what manuals?","A web-integrated database centrally managed by TISCOM that displays information applicable to your specific account.","What three ways can COMTAC publications be prepared?","Responsible for the day-to-day administration of the library and report to the PCO for all matters relating tot he CPL.","A MS Acess database developed by TISCOM to automate the accounting and reporting functions needed to maintain a CPL.","The designated location of library publications that are not under the control of a holder/user and are available for issure, if needed.","Relief/designation letter are retained for how long?","Destruction reports for Unclassified and classified materials are retained for how long?","T/S and Secret destruction reports are retained for how long?","When do you perfom a page check on a pub?","When would a classified pub be considered compromised?","What are reasons that publications might be destroyed?","Unclassified materials must be inventoried...","Confidential materials must be inventoried...","Secret materials must be inventoried...","Top secret materials must be inventoried...","What are the 4 types of inventory reports?","Paper issue requests maybe placed by?","The official notification that a publication has been implemented into the Armed Forces by the Joint Chiefs of Staff.","Indicated any changed/corrections or special handling required.","NATO approved publications are under the control of who?","What are the 4 general objectives of the SAR program?","What are the different phases of SAR?","What are the stages of SAR?","Responsible for coordinating SAR operations within assigned search and rescue regions.","Established in areas where the RCC is not capable of exercising effective control of SAR facilities and operations.","CG command and control facilities responsible for mission and coordination and tactical control of Search Rescue Units within assigned AORs.","What are some examples of external partners in SAR?","When an emergancy mandates responses in additions to SAR, emergency responses are managed within what?","Tasks include: 1. Prepare and execure SAR plans. 2. Collect, evaluate, and disseminate information. 3. Inform other Command Center of SAR. 4. Conduct interviews and gather SAR data. 5. Develop case folder. 6. Document actions. 7. Use QRCs.","Tasks include: 1. Assist OU in collecting, evaluating, and disseminating information. 2. Monitor situations that could potentially develop into a SAR case. 3. Track, evaluate, and communicate the potential weather impact on a SAR case. 4. Identify and evaluate additional resources that may be used as an SRU.","Tasks include: 1. Receive and copy initial and potential distress information. 2. Replay voice message recordings 3. Issue broadcasts 4. Maintain comms 5. Coordinate comms.","What does GMDSS stand for?","Satallite communications that allow the continuous exchange of comms and tactical info between suitably equipped CG ships and aircraft","An automated infomation system designed to support operational planning through flexible data transfer capabilities and tools for the analysis of tactical data","Designed for use as a client workstation connected to a network with a track data gateway.","A suite of computer based tools used to aid the search planner in developing an optimal search plan.","Used to support the agency\u0027s capability to monitor distress calls and coordinate response activites.","A CG sponsored, computer-based global ship reporting system used worldwide by SAR authorites to coordinate assistance to people in distress.","A shipboard VHF maritime broadcast system that continuously send and receives vessel identification data.","Detects and relays signals from emergency beacons to the appropriate Rescue Coordination Center.","Enable info sharing and situational awareness among SAR decision makers.","MISLE cases should be opened within how long?","The case file in MISLE should be validated within ____ hours of completion.","Provide relevant and up-to-date info about the progress of a specific SAR operation.","Messages and after-action reports provide a detailed summary of events, actions, and assets employed during a specific operation.","How long is a SAR case maintained on-site?","How long are SAR case folders archived for?","What are the Coast Guard missions at a sector?","Program developed to control radiation hazards to crew.","Program developed to protect fueling operations from radiation hazards.","Program developed to protect ordance from radiation hazards.","Authorized to enforce compliance with mandated security measures and actions.","What MARSEC infomation is communicated to facilities, vessels and stakeholders?","When a general threat of possible terrorist activity exists but only warrents routine security measures.","When there is a general yet unpredictable threat of possible terrorist activity and the circumstances do not justify the full implementation of higher level force protection measures.","When an increased and more predictable threat of terrorist activity exists.","When a terrorist incident occurs or intelligence indicated that terrorist action against units and personnel is imminent.","Applies in the immediate area where a terrorist attack has occured or when intelligence warnings of an attack against a specific location have been received.","Guidelines set forth by higher authority that specify the conditions under which armed forces will initiate or continue combat engagement with enemy forces.","Vessels owned, operated, or chartered by countries which present a risk to security if permitted to enter a U.S. port","Vessels listed on the Maritime Operational Threat Response Plan which are allowed to enter U.S. water with an Advance Notice of Arrival.","Landside or waterside assets which may include waterfront facilities, commercial vessels or naval vessels.","Vessels whose cargo, activites, or persons on board pose a defined security threat.","Vessels or persons on board who may be engaged in activities which pose threats to security","Vessels or persons on board associated with an entity engaged in activity posing a potential security threat, but intellegence does not indicate direct involvement or intent.","How does the CG identify Vessels of Interest?","Sources of HIV targeting information.","Designated when information is received that the cargo of a vessel, activites of a vessel, or of a person onboard pose a defined security risk.","An intelligence term of reference; it designates key structures, systems, assets, or services which have been associated with potential safety or security risks.","A water area within a defined boundary for which regulations governing the activities of vessels navigating within the area have been established under CFR 33","A 500 yard regulated area of water established around naval vessels to provide for their safety and security.","In a NVPZ no vessel or person is allowed with in _____ yards of a large naval vessel without authorization from the senior naval officer present afloat, CG, or official escort patrol.","Has the authority to publish special local regulations to promote safety during scheduled marine events and control access to the area where the event is being held.","Info proccessing activities which support planning and execution of CG missions.","The gathering and processing of tactical information from all sources to provide a common picture of maritime activities within areas of operations.","An accurate and complete display of relevant tactical data that integrates info from multiple sensors and sources.","A display of relevant tactical information shared by more than one command to facilitate situational awareness of at all command levels.","Responsible for the production and management of the Common Operational Picture within their AOR.","What annotates in template form those sets available for COMMSHIFT messages?","When SAR objective is determined, what is the minimum time that initial action must take place?","The release of the appropriate broadcast must take place with in ____ minutes of initial notification.","From the time of inital notification, provide a SAR Action Plan within ____ hour on scene response time.","GMDSS coverage area within line-of-sight radiotelephone coverage of at least one VHF-FM system with continuous DSC channel 70 and channel 16 monitoring services.","GMDSS coastal regions to approximately 200nm offshore.","Major or Minor Involves loss of life or property, lives saved, property saved or unaccounted for lives or property.","Major or Minor? Requires SAROPS to compute a drifted datum.","Major or Minor? Has high media or political interest","Major or Minor? Involves a shift of SMC to a higher level of command.","Major or Minor? False alarm","Major or Minor? Cases with only assistance to lives or property.","Major or Minor? Cases that resolve on their own.","Major or Minor? Cases where the only CG involvement is a communication schedule.","How many parts are in a Search Action Plan?","Monitor MARSEC levels and security Alerts.","Categorize contacts for exchange in the COP","Maintain asset readiness database","Monitor status of database","What IFF systems are military only?","What IFF mode secures identification of friendly air/surface contacts?","What is the IFF code for a hijack or unlawful interference with ops?","What is the IFF code for communications failure?","What is the IFF code for an emergency?","An air search RADAR providing two-dimensional target detection and tracking capabilities for long-range surveillance, self-defense, and targeting designation in the ship\u0027s integrated air detection and tracking system.","What is the air RADAR for new national security cutters?","What is the preferred method to communicate MARSEC levels?","What does SCI stand for?","What is the Actual Frequency for a 406mhz EPIRB?","What type of investigation corresponds with a secret clearance? Top secret?","How many angles of a vessel should you photograph?","Who do you contact if you have excess property?","What does Semper Paratus mean?","What is the secondary frequency for non-commercial vessels?","What does the proword \"FROM\" mean when spoken on VHF?","How many letters are in a diagraph code?","What does the first letter mean in a diagraph code?","What does the second letter mean in a diagraph code?","What does FCS stand for?","What does FLIR stand for?","What are the 3 stages of crypto?","How often do you get fixed wing positions? Rotary winged?","What is the minimum classification of any intel message?","What number precedes an IIR Message?","What is the intel HUB for the Coast Guard?","How often do EKMS accounts get inspected by A\u0026A teams?","What is the form for a safe combo?","How many Headquarters Units report directly to Headquarters?","What type of command is responsible for providing services such as civil engineering, health and safety, legal and finance to all operational units within its area?","What rank head up districts?","What rank leads the Atlantic and Pacific Areas?","In what war did cutter capture 18 prizes unaided?","In what war is a Coast Guard cutter credited for firing the first naval shots?","During what war was the Coast Guard entirely transfered over to the Navy?","During what war did the CGC McCulloch serve as both the escort and dispatch with Commodore George Dewey\u0027s squadron?","During this war, the Coast Guard\u0027s mission was primarily support.","True or False The first time the Coast Guard augmented the Navy with shallow-draft craft was in WWI?","What operations in Greenland was the Coast Guard responsible for during WWII?","During what war did ocean-going cutters aument Navy and Coast Guard surveillance forces?","The Coast Guard was under Navy command during Operation Eagle?","After WWII, members of what organization were given rates and ratings, uniforms, and insignias?","Drug smuggling in the 1960s gave what mission increased signifigance?","What event sparked the creation of the International Ice Patrol?","The Refuse Act of 1899 was the catalyst for what CG mission?","When was the Federal Lifesaving service initiated?","What is the location of the only Coast Guard manned light station in the U.S. today?","She was one of the first uniformed women to serve in the Coast Guard.","What year were women integrated into active duty and reserve?","This man saved more then 600 lives, earned 2 gold medals, 3 silver, plus other awards.","What year were all officer career fields and enlisted ratings open to women?","Who is the only Coast Guard member to be awarded the Medal of Honor?","What year was the first Master Chief Petty Officer of the Coast Guard created?","In order to qualify for Officer Candidate School you must have qualifying scores on what exams?","This program allows you to continue civilian employment while serving on active duty (officer).","In order to qualify for this program you must be at least E-6.","In order to receive this you must have special training and skills in specific fields that meet the Coast Guard\u0027s needs.","This program allows you to attend college on a full-time basis for up to 2 years and you still receive full pay and allowances.","True or false In the Coast Guard, your supervisor maybe a civilian?","Supporting documentation is required with evals for what marks?","PRs for construction requests are limited to?","The PR limit for ordering supplies is what?","A next of kin must be notified if a SAR case has no development within what time frame?","What is the DTG for a COMMSHIFT?","What is the SSIC for a COMMSHIFT?","What is the time frame requirement for a COMMSHIFT?","How long do you have to act on an immediate message?","What freq. does NAVTEX broadcast on?","What term means the Coast Guard is allowed to do a bonafide rescue in foreign seas?","What units have Family Advicacy Specialists?","What branch of the military does not have CWOs?","What types of vessels are not covered by commercial fishing regulations in a certain pub?","What does SCI stand for?","What is the actual freguency for a 406 MHZ EPIRB?","What type of investigation corresponds with a secret clearance? Top secret?","How many angles of a vessel should you photograph?","Who do you contact if you have excess property?","What does Semper Paratus mean?","At a land unit, how long should the emergency generator last for?","What is the secondary frequencies for non-commercial vessels?","What does the proword \"from\" mean when spoken on VHF radio?","How many letters are in a diagraph code?","What does the first letter mean in a diagraph code?","What does the second letter mean in a diagraph code?","What does FCS stand for?","What does FLIR stand for?","What are the 3 stages of crypto?","What is the minimum classification of any intel msg?","What does RADAR stand for?","What is the intel hub for the coast guard?","How often do EKMS accounts get inspected by A\u0026A teams?","How long must you retain EKMS records of destruction?","Who cannot fly the commisioning pennant?","How many stripes are on the USCG ensign?","How long must a member be in the USCG in order to get discharged for a drug incident?","How high must windows be in a secure space?","What is the form for a security container checksheet?","What is the form for a safe combo?","What form number is the Enlisted Performance Evaluation Employee Review Support Form?","Regarding Employee Reviews, it is the supervisors responsibility to ensure that \"bullets\" are submitted no later than how many days?","Employee Reviews must be submitted no later than how many days to the Marking Official?","Routing for a complete employee review to Approving Offical must happen with in how many days after the marking period ends?","You have how long to appeal an employee review?","What two forms are required when requesting travel orders?","To receive reimbursement for PCS, what form must you complete?","What is form CG-2070?","When traveling TDY, members are required to submit travel claim within how many days?","TDY travel claims are completed and processed using what?","What are the three roles of the Coast Guard?","What two primary missions are performed within the realm of Maritime Safety?","What are the 4 primary missions performed within the realm of Maritime Security?","What are the 5 primary missions performed in the realm of Maritime Safety?","These members of the Coast Guard consist of individuals available for immediate recall to active duty.","Made up of former active duty members, and is designated as essential to inital contingency requirements having priority over all other Reserve elements.","A manpower pool principally consisting of individuals who have had training and have previously served in the active forces or in the Selected Reserve.","The uniformed volunteer component of the Coast Guard.","When was the Homeland Security Act signed into law?","On what date was the Coast Guard transferred from the DOT to the DHS?","An E-2 in the Coast Guard is equivilant to what in the.... 1. Army 2. Navy 3. Marine Corp 4. Air Force","An E-3 in the Coast Guard is equivilant to what in the.... 1. Army 2. Navy 3. Marine Corp 4. Air Force","An E-4 in the Coast Guard is equivilant to what in the.... 1. Army 2. Navy 3. Marine Corp 4. Air Force","An E-5 in the Coast Guard is equivilant to what in the.... 1. Army 2. Navy 3. Marine Corp 4. Air Force","An E-6 in the Coast Guard is equivilant to what in the.... 1. Army 2. Navy 3. Marine Corp 4. Air Force","An E-7 in the Coast Guard is equivilant to what in the.... 1. Army 2. Navy 3. Marine Corp 4. Air Force","An E-8 in the Coast Guard is equivilant to what in the.... 1. Army 2. Navy 3. Marine Corp 4. Air Force","An E-9 in the Coast Guard is equivilant to what in the.... 1. Army 2. Navy 3. Marine Corp 4. Air Force","What is the equilvant of MCPOCG to the other branches of the US military? 1. Army 2. Navy 3. Marines 4. Air Force","What military branch does not have Warrant Officers?","An O-1 in the Coast Guard is equivilant to what in the.... 1. Army 2. Navy 3. Marine Corp 4. Air Force","An O-2 in the Coast Guard is equivilant to what in the.... 1. Army 2. Navy 3. Marine Corp 4. Air Force","An O-3 in the Coast Guard is equivilant to what in the.... 1. Army 2. Navy 3. Marine Corp 4. Air Force","An O-4 in the Coast Guard is equivilant to what in the.... 1. Army 2. Navy 3. Marine Corp 4. Air Force","An O-5 in the Coast Guard is equivilant to what in the.... 1. Army 2. Navy 3. Marine Corp 4. Air Force","An O-6 in the Coast Guard is equivilant to what in the.... 1. Army 2. Navy 3. Marine Corp 4. Air Force","An O-7 in the Coast Guard is equivilant to what in the.... 1. Army 2. Navy 3. Marine Corp 4. Air Force","An O-8 in the Coast Guard is equivilant to what in the.... 1. Army 2. Navy 3. Marine Corp 4. Air Force","An O-9 in the Coast Guard is equivilant to what in the.... 1. Army 2. Navy 3. Marine Corp 4. Air Force","An O-10 in the Coast Guard is equivilant to what in the.... 1. Army 2. Navy 3. Marine Corp 4. Air Force","What service does not have a 5 star officer?","What year did the rate of Petty Officer become official?","What year was the Chief Petty Officer rate established?","During what war did the Coast Guard rates become the same as those in the Navy?","What is UCMJ article 91?","What is UCMJ article 7?","What is UCMJ Article 92?","What gives the Coast Guard its law enforcement authority and establishes who may exercise that authority?","According to 14 USC 89, Petty Officers have the authority to do what?","Where is the Coast Guard Academy located?","An O-1 in the Coast Guard is equivilant to what in the.... 1. Army 2. Navy 3. Marine Corp 4. Air Force","An O-2 in the Coast Guard is equivilant to what in the.... 1. Army 2. Navy 3. Marine Corp 4. Air Force","An O-3 in the Coast Guard is equivilant to what in the.... 1. Army 2. Navy 3. Marine Corp 4. Air Force","An O-4 in the Coast Guard is equivilant to what in the.... 1. Army 2. Navy 3. Marine Corp 4. Air Force","An O-5 in the Coast Guard is equivilant to what in the.... 1. Army 2. Navy 3. Marine Corp 4. Air Force","An O-6 in the Coast Guard is equivilant to what in the.... 1. Army 2. Navy 3. Marine Corp 4. Air Force","An O-7 in the Coast Guard is equivilant to what in the.... 1. Army 2. Navy 3. Marine Corp 4. Air Force","An O-8 in the Coast Guard is equivilant to what in the.... 1. Army 2. Navy 3. Marine Corp 4. Air Force","An O-9 in the Coast Guard is equivilant to what in the.... 1. Army 2. Navy 3. Marine Corp 4. Air Force","An O-10 in the Coast Guard is equivilant to what in the.... 1. Army 2. Navy 3. Marine Corp 4. Air Force","True or False You may attend political meetings in uniform.","EMI is a form of punishment. True or False?","What UCMJ article gives you the right to remain silent during a courts-martial?","What article gives Commanding officers the ability to impose NJP?","An NJP appeal must be submitted within how many calander days?"],["72","Pre-formatted Message","5","COMMSHIFT","Establish COMMSHIFT","Disestablish COMMSHIFT","Rename COMMSHIFT","Cancel COMMSHIFT","Immediate","Priority","Routine","Gaining and losing communications facilities, Master Update Authority, NCTAMS","Secret and below","N02325","ZYUW","COMSPOT","Within 30 min of outage, every hour or upon significant changes in status","48","Joint Force Maintenance Manual","Communications Tactical","CPL","False","COMDTINST M5510.23 series, COMDTINST M 5500.19 series, and COMDTINST M2600.1 series","Online Publication Library (OPL)","Paper, CD-ROM, web-based","Publication Control Clerk (PCC)","Coast Guard Publications Control Software (CGPC)","Publication Stock Center","2 years","2 years","5 years","Upon initial receipt, after a page change or correction, disassembling of a pub, prior to distruction (T/S or secret), during inventory (T/S), and upon relief of CO/PCO (T/S and Secret)","Missing pages, Misplaced or whereabouts unknown, Loss of control, found in the hands of anyone without proper clearance, destroyed by accident.","Excess, Superseded, Cancelled, Authorized by ISIC","Annually","Annually","Annually","Bi-Annually","Annual, Relief, Unit, Holder","Naval Logistic Library (NLL), MILSTRIP message, Stock Numbers","Letter of Promulgation","Letter of Instructions","NCO","Minimize loss of life, injury, property, and damage to environment/minimize crew risk/optomize resources in SAR/maintain a world leadership in maritime SAR","Uncertainty, distress, alert","Awareness, Initial Action, Planning, Operations, Conclusion","Rescue Coordination Centers (RCC)","Rescue-Sub-Centers (RSO)","Sector Command Centers (SCC)","Local port and industry organizations, state and local agencies, USN, DHS, etc...","Incident Command System (ICS)","OU","SU","CU","Global Maritime Distress and Safety System","SATCOM","GMDSS","Command and Control Personal Computer (C2PC)","SAROPS","Rescue 21","Automated Mutual Assistance Vessel Rescue System (AMVER)","Automatic Identification System (AIS)","SARSAT","MISLE","15 min","12","SITREP","Operational Summaries","3 years","10 Years","1. Sar 2. Marine Safety 3. ATON 4. Ice Operations 5. Living Marine Resources Protection","HERP","HERF","HERO","Captain of the Port (COTP)","1. Type of threat 2. Expected duration of threat 3. Location impact 4. Potential Targets 5. Actions required to minimize risks","FPCON Normal","FPCON Alpha","FPCON Bravo","FPCON Charlie","FPCON Delta","Rules of Engagment (ROE)","Special Interest Vessels","Restricted Vessels","High Value Assets (HVA)","High Potential Threats","Medium Potential Threats","Low Potential Threat","1. Characteristics 2. History of compliance with domestic and interational security regulations. 3. Intelligence data 4. Arrival Information","Port State Control (PSC) Matrix","Cargo of interest (COI)","Facility of Interest (FIO)","Regulated Navigation Area (RNA)","Naval Vessel Protection Zone (NVPZ)","100","District Commander","Command and Control","Situational Awareness","Common Tactical Picture (CTP)","Common Operational Picture (COP)","Area Command Centers","NTP 4 SUPP-2","5 minutes","15","2","Sea Area A1","Sea Area A2","Major","Major","Major","Major","Minor","Minor","Minor","Minor","6","Waterways Management","Maritime Doman Awareness","Resource Management","Response Operations","Modes 1, 2, and 4","Mode 4","7500","7600","7700","SPS-40","TRS-3D","Electronic","Secure Compartmentalized Information","406.025","Secret: NACLC Top Secret: SSBI","8","Property Officer","Always Ready","VHF-FM ch. 9 (156.450mhz)","Beginning Time","2","# of segments","supercession rate","Fire Control System","Forward looking infrared","Reserve, Effective, Superceded","ops every 30 min/position every 60 min; ops every 15 min/position every 30 min","FOUO","4, indicates the USCG","ICC","Every 18 months","SF-700","35","Maintenance and Logistics Commands","Rear Admirals","Vice Admirals","Quasi-War","Civil War","World War I","Spanish-American War","Korean War","False","Cold-weather","Vietnam","No","Coast Guard Auxiliary","Law Enforcement","Titanic","Environmental Protection","1848","Boston Harbor","Lucille Baker","1973","Joshua James","1978","Douglas Munro","1969","SAT, ACT or ASVAB","Selective Reserve Direct Commission Program","Warrent Officer","Direct Commission Program","Pre Commissioning Program","True","1, 3, or 7","$2,000","$2,500","At least one day prior to stopping efforts.","0000Z/0001Z","N02325","24 to 48 hours","30 min","518 KHZ","Force Majeur","ISCs","Air Force","Recreational fishing vessels","Secure Compartmentalized Information","406.025","NACLC/SSBI","8","Property Officer","Always Ready","72 hours","8, 9, 81, 83A","Beginning time","2","How many segments are in the cannister.","Supercession rate","Fire Control System","Forward looking infrared","Reserve, Effective, Superceded","FOUO","Radio detection and ranging","ICC","every 18 months","3 yrs","Enlisted Personnel","16","Any time, there is Zero tolerance","18 ft high, 14 ft from other buildings","SF-702","SF-700","CG 3788G","14 days","9 days","5 days","15 calander days","PCS Departing/Separation Worksheet (CG-2000) and Departing TDY or PCS/Temduins to \"A\" school worksheet (CG-2001)","DD Form 1351-2","TDY Travel Request Worksheet","3 Days","T-PAX","Maritime Safety Maritime Security Maritime Stewardship","Marine Safety Search and Rescue","Illegal Drug Interdiction Undocumented Migrant Interdiction Defense Readiness Ports, Waterways and Coastal Security","Living Marine Resources Marine Environmental Protection Fisheries Aids to Navigation Ice Operations","Ready Reserve","Select Reserves","Individual Ready Reserve","Coast Guard Auxiliary","November 25, 2002","March 1, 2003","1. Private 2. Seaman Apprentice 3. Private First Class 4. Airman","1. Private First Class 2. Seaman 3. Lance Corporal 4. Airman FIrst Class","1. Corporal 2. Petty Officer 3rd Class 3. Corporal 4. Senior Airman","1. Sergeant 2. Petty Officer 2nd Class 3. Sergeant 4. Staff Sergeant","1. Staff Sergeant 2. Petty Officer 1st Class 3. Staff Sergeant 4. Technical Sergeant","1. Sergeant 1st class 2. Cheif Petty Officer 3. Gunnery Sergeant 4. Master Sergeant or First Sergeant","1. Master Sergeant or First Sergeant 2. Senior Chief 3. Master Sergeant or First Sergeant 4. Senior Master Sergeant or First Sergeant","1. Sergeant Major or Command Sergeant Major 2. Master Chief 3. Sergeant Major or Master Gunnery Sergeant 4. Chief Master Sergeant or First Sergeant or Command Chief Master Sergeant","1. Sergeant Major of the Army 2. Master Chief Petty Officer of the Navy 3. Sergeant Major of the Marine Corp 4. Chief Master Sergeant of the Air Force","Air Force","1. 2nd Lieutenant 2. Ensign 3. 2nd Lieutenant 4. 2nd Lieutenant","1. 1st Lieutenant 2. Ensign 3. 1st Lieutenant 4. 1st Lieutenant","1. Captain 2. Lieutenant 3. Captain 4. Captain","1. Major 2. Lieutenant Commander 3. Major 4. Major","1. Lieutenant Colonel 2. Commander 3. Lieutenant Colonel 4. Lieutenant Colonel","1. Colonel 2. Captain 3. Colonel 4. Colonel","1. Brigadier General 2. Rear Admiral Lower Half 3. Brigadier General 4. Brigadier General","1. Major General 2. Rear Admiral Upper Half 3. Major General 4. Major General","1. Lieutenant General 2. Vice Admrial 3. Lieutenant General 4. Lieutenant General","1. General 2. Admrial 3. General 4. General","Marine Corp","1808","1893","World War I","Insubordinate Conduct Toward an Officer","Apprehension","Failure to Obey Order or Regulation","14 USC 89","Search Examine Arrest Seize Inspect Inquire (remember S.E.A.S.I.I.)","New London, Connecticut","1. 2nd Lieutenant 2. Ensign 3. 2nd Lieutenant 4. 2nd Lieutenant","1. 1st Lieutenant 2. Ensign 3. 1st Lieutenant 4. 1st Lieutenant","1. Captain 2. Lieutenant 3. Captain 4. Captain","1. Major 2. Lieutenant Commander 3. Major 4. Major","1. Lieutenant Colonel 2. Commander 3. Lieutenant Colonel 4. Lieutenant Colonel","1. Colonel 2. Captain 3. Colonel 4. Colonel","1. Brigadier General 2. Rear Admiral Lower Half 3. Brigadier General 4. Brigadier General","1. Major General 2. Rear Admiral Upper Half 3. Major General 4. Major General","1. Lieutenant General 2. Vice Admrial 3. Lieutenant General 4. Lieutenant General","1. General 2. Admrial 3. General 4. General","False","False","Article 31","UCMJ Article 15","5 days"]],"pageTitle":"OS2 SWE/EOCT Flashcards - Cram.com","title":"","url":"http://www.cram.com/flashcards/os2-sweeoct-2091619","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"ENTITY","tableNum":0,"s3Link":"common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988650.53/warc/CC-MAIN-20150728002308-00069-ip-10-236-191-2.ec2.internal.warc.gz","recordEndOffset":388057711,"recordOffset":387986046,"tableOrientation":"HORIZONTAL","TableContextTimeStampBeforeTable":"{12669\u003dby RDUHLIR, Feb. 2012}","textBeforeTable":"Back Front 283 Cards in this Set Clone Export Print Share through Card Range To Study Click or Press Spacebar to Begin » Click to flip 1/283 Progress Play button Play button A key: Read text to speech.a key H key: Show hint (3rd side).h key Up/Down arrow keys: Flip the card between the front and back.down keyup key Right/Left arrow keys: Navigate between flashcards.right arrow keyleft arrow key How to","textAfterTable":"","hasKeyColumn":false,"keyColumnIndex":-1,"headerRowIndex":0}