{"relation":[["\\(f\\), \\(Hz\\)","\\(x\\), \\(m\\)","\\(2x\\), \\(m\\)","\\(u_zr\\), \\(m/s\\)","\\(u_zr^2\\), \\((m/s)^2\\)"],["1 000 000","0","","0",""],["998 789","0,1","","0,4",""],["997 582","0,4","","0,8",""],["996 377","0,9","","1,2",""],["995 175","1,6","","1,6",""],["993 976","2,5","","2,0",""]],"pageTitle":"Matura z fizyki: Efekt Dopplera.","title":"","url":"http://www.filoma.org/zadania/efekt_dopplera/","hasHeader":false,"headerPosition":"NONE","tableType":"MATRIX","tableNum":1,"s3Link":"common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042991019.80/warc/CC-MAIN-20150728002311-00090-ip-10-236-191-2.ec2.internal.warc.gz","recordEndOffset":444177136,"recordOffset":444164077,"tableOrientation":"MIXED","textBeforeTable":"W tabeli przedstawiono wyniki pomiarów częstotliwości odbieranej przez odbiornik, położenia oraz wartości prędkości dla poruszającego się wózka, dokonanych za pomocą automatycznego układu pomiarowego. Przyjmij, że wartość prędkości ultradźwięków w powietrzu wynosi \\(330 \\ m/s\\). b) (3 pkt) Napisz, jakim ruchem i w którą stronę powinien poruszać się nieinercjalny układ odniesienia, aby opisywany w tym układzie wózek pozostawał w spoczynku. a) (2 pkt) Wózek z nadajnikiem fal ultradźwiękowych, spoczywający w chwili \\(t \u003d 0\\), zaczyna oddalać się od nieruchomego odbiornika ruchem jednostajnie przyspieszonym. frf101 - Wózek (12 pkt) MAJ 2007 / A2 Zaloguj się aby obejrzeć film bez limitów. bezpłatne a wszystkie treści video są dostępne Dzięki Tobie jesteśmy w stanie nieustannie udoskonalać funkcjonalność naszej strony. Aby to jednak było możliwe musisz być zalogowany. Logowanie jest Samochód i motocykl poruszają się na przeciw siebie. Samochód z szybkością \\(15 \\ m/s\\), a motocykl z szybkością \\(30 \\ m/s\\). Kierowca samochodu użył klaksonu, który emituje dźwięk o częstotliwości \\(500 \\ Hz\\). Jaka będzie częstotliwość dźwięku słyszanego przez motocyklistę? fpf123 - Efekt Dopplera","textAfterTable":"993 976 \\(x\\), \\(m\\) 0 0,1 0,4 0,9 1,6 2,5 \\(2x\\), \\(m\\) \\(u_zr\\), \\(m/s\\) 0 0,4 0,8 1,2 1,6 2,0 \\(u_zr^2\\), \\((m/s)^2\\) d) (2 pkt) Wyprowadź zależność matematyczną pozwalającą obliczyć wartość przyspieszenia wózka. Przyjmij, że dane są tylko położenie \\(x\\) i prędkość \\(u_{zr}\\) wózka. e) (2 pkt) Oblicz wartość przyspieszenia wózka. Film wkrótce dostępny Polityka prywatności Regulamin Kontakt O nas FAQ Copyright © 2011-2013 filoma Designed \u0026 Created by filoma Rejestracja Podaj poprawny adres e-mail. Wyślemy Ci link aktywujący Twoje konto. Wypełniając formularz i klikając przycisk Utwórz konto, akceptujesz nasz regulamin","hasKeyColumn":false,"keyColumnIndex":-1,"headerRowIndex":-1}