{"relation":[["1","","2","","3","","4","","5"],["Death toll rises to 43 in China highway explosion","","18 killed in series of car bomb attacks in Baghdad","","Gunmen kill 21 soldiers in Egypt desert","","Rammasun incurs huge economic losses in China","","China\u0027s Sany ready to act on U.S. gov\u0027t move"]],"pageTitle":"News Analysis: Why U.S. court sides with Chinese company in dispute with Obama? - Xinhua | English.news.cn","title":"","url":"http://news.xinhuanet.com/english/indepth/2014-07/21/c_133499513.htm","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"ENTITY","tableNum":101,"s3Link":"common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988650.53/warc/CC-MAIN-20150728002308-00069-ip-10-236-191-2.ec2.internal.warc.gz","recordEndOffset":177050879,"recordOffset":177034485,"tableOrientation":"HORIZONTAL","TableContextTimeStampAfterTable":"{35705\u003dThe most eye-catching case is China National Offshore Oil Corporation\u0027s failed attempt to bid for Union Oil Company of California in 2005., 33703\u003dIn 2012, the intended deal by Ralls Corp., a subsidiary of China\u0027s machinery conglomerate Sanyi Group, was blocked by Obama and CFIUS because the wind farms were too close to a military facility. Ralls Corp. sued Obama and CFIUS, an inter-agency committee that assesses national security implications of mergers, for exceeding constitutional rights and failed to provide detailed evidence., 32942\u003dWASHINGTON, July 20 (Xinhua) -- The Chinese-owned Ralls Corp. has hardly expected it could win an appeal against the Obama administration over an investment dispute recently.}","lastModified":"Mon, 21 Jul 2014 06:25:35 GMT","textBeforeTable":"  English Forum Most Popular             Home \u003e\u003e In-depth","textAfterTable":"1 Shanghai meat supplier for McDonald, KFC suspended for safety concerns 2 Chinese submersible takes Youth Olympics torch to deep sea 3 Vera Wang\u0027s series of autumn and winter 2014 4 George Benson performs during 50th Carthage Int\u0027l Festival in Tunisia 5 Britain\u0027s autistic artist draws panorama of Singapore in shopping centre","hasKeyColumn":false,"keyColumnIndex":-1,"headerRowIndex":0}