{"relation":[["","Overall score","Would you do it again?","","Details:","Scenery","PB potential","Atmosphere","Organisation","Value","Beginner-friendliness"],["","","","","","","","","","",""],["","40%","Yes","","","80%","80%","60%","60%","40%","60%"]],"pageTitle":"Brighton Half Marathon - Event Ratings - Runner\u0027s World","title":"","url":"http://www.runnersworld.co.uk/events/ratingsall.asp?P\u003d14\u0026ugn\u003d9740\u0026en\u003d71178\u0026year\u003d0\u0026v\u003d2\u0026sp\u003d","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"ENTITY","tableNum":29,"s3Link":"common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989178.64/warc/CC-MAIN-20150728002309-00273-ip-10-236-191-2.ec2.internal.warc.gz","recordEndOffset":692624575,"recordOffset":692608649,"tableOrientation":"HORIZONTAL","TableContextTimeStampAfterTable":"{48299\u003dIn short: A PB so happy! In full: Goody bag wasn\u0027t great but it is a charity race so would rather forego the bag! Water and a banana is fine! If it is over measured that\u0027s disappointing as I would have smashed pb by more! Date of review: February 19, 2012, 29327\u003dIn short: They got the distance wrong!!! In full: The start was poorly organised and shambolic, but I could live with that. What is unforgivable was that they measured the course wrong, robbing me and loads of others of their personal best. This could be such a good race, but I am not ever going back. I am absolutely fuming. Come on.. I mean, measuring the course wrong by almost half a mile? Would you go back? The organisers already have form for this... 2011 was too short!! Sorry guys. You should have made sure this year. Date of review: February 19, 2012, 15930\u003dIn short: Happy with my PB - especially as it was over 13.5 miles In full: I think that a new cone putter outer should be recruited next year as the turn on Marine Drive was a lot further than last year - the main cause of the extra distance (my GPS read 13.5 miles). I didn\u0027t pick up a \"goody\" bag but perhaps the money had gone on all those extra cones judging from the other comments? A shame really as this could be a fantastic race. It\u0027s pretty much flat as a pancake so I still managed a PB and enjoyed the day. Date of review: February 19, 2012, 38725\u003dIn short: Great race normally - Organisers overstretched themselves this year In full: This is the 4th time I\u0027ve run this race, 2010 was terrible, 2011 was excellent but today\u0027s was a return to the organisational frailties that dogged the 2010 run. The course was overmeasured by about 1/3 mile (500m), the baggage area was poorly managed and too far away, in fact it was in the area most people use for warm-up, the toilets were insufficent for the numbers on the day and the goody bag idea - well this should have been ignored, great medal though. I think this year the organisers wanted to have a bigger race and this overstretched their resources, hopefully next year they\u0027ll reduce the size of the event and it will be more successful, not sure that I\u0027ll run it though - depends what the organisers say about their performance this year. Date of review: February 19, 2012, 11176\u003dIn short: The extra 0.4 miles didn\u0027t bother me, BUT In full: Perhaps because I\u0027ve had prior experience with non-exact distances (Berlin 2011, Nike GPS clocked it at 26.75 miles - come on, this is one of the 5 marathon majors!), a race measuring exactly 13.1 miles would have been surprising. What I do have problems with, however, is amateur organization. With race # having failed to materialize, had to queue for good 20-25 mins to get replacement, barely making it to start, all the way at the back, and then having to weave through hundreds of runners for first 2-3 miles. Sign-postings were inadequate, bag collection woefully under-manned. Hard to believe over 2 decades of history. For future races, suggest reducing both # of runners and $$$ by 30%. Date of review: February 19, 2012, 33859\u003dIn short: Credit crunch service for top dollar cost In full: Hmmm, beautiful weather and I love running in Brighton but the start was lacking in atmosphere, amateur PA. I think they\u0027re really trying to milk it without outting in the organisational effort/investment. I booked so long ago that I forgot it was £29, which is a lot for not a lot. The fact that they were still appealing for volunteer marshalls the night before the race speaks volumes. The extra distance is truly unforgiveable. For evidence of how to organise a large race [to which the organisers aspire] they need to look at places like Reading. All things can be resolved with investment [toilets can be brought in]. I didn\u0027t even know there was [not that I wanted it havng read about it] a \u0027goody\u0027 bag!! The run was lovely, the crowds lovely, the organisers were amateurs.\u0027Nuff said Date of review: February 19, 2012, 43574\u003dIn short: Thought I was going mad In full: Thought my Garmin was having a funny turn when the miles started getting out of sync. Twisted my ankle at mile 5 due to a runner discarding a bottle in front of me and had to play catch up to try my hardest to make up the lost time and achieve my goal of cracking 1.40 for the first time ever. Seeing as I ended up at 1.40.52 for 13.5 miles, I suppose I can say that I did it, although the kudos of sub 1.40 being recorded as my finish time will now not happen. Completely mystified that the organisers can measure a course so inaccurately and that so many runners were left wondering at the end of what should have been a great finish. Date of review: February 19, 2012, 5184\u003dIn short: Should do better In full: The organisers that is. The crowds were brilliant. This event raises valuable funds for a great charity, takes place in a great town and is perfect tune up for London. I\u0027d like to make a few constructive suggestions. 1) the start area is too congested. Either make the race smaller or put facilities nearer to where people actually start, then they might spread themselves out a bit, 2) seeded start pens and starting in waves would make for a better event for all runners, 3) there is no excuse for having two markers for the same mile 50 yards apart, 3) there is no excuse for doing it at two different places on the course, 4) please try and put the markers in roughly the right place. Markers for 3 and 4 miles weren\u0027t in the right county and 5) I really don\u0027t mind about a goody bag or tshirt. But if you are going to give me a bag then please put something in it. Date of review: February 19, 2012, 20491\u003dIn short: Probably one of the most beautiful runs in the country but needs to be better organised In full: Stunning scenery make this a gorgeous run, especially when the wind has your back! The views alone make this one of my favourite runs. However... Expensive entry fee for what you get though (I think a T-shirt should be par when the entry is £30 - goody bag was 2 leaflets in a bag). Lots of bottle-necks make PBs testing unless you\u0027re superfast and ahead of the pack. Incorrect route measurement (extra 0.5 mile) is shameful for an established event such as this. Really nice medals this year. Thanks. Date of review: February 19, 2012, 25135\u003dIn short: Poor layout - zero loos - all local ones closed - youth races rushed and not secure despite wrist bands - a pb course that they measured wrong and long - very expensive for adults for very little Date of review: February 19, 2012}","textBeforeTable":"Page: First | -10 | 11  12  13  14  15  16  17  18  19  20  | +10 | Last 131 to 140 of 244 ratings Here\u0027s how RW members rated this race in the past (244 votes). Brighton Half Marathon denotes You are looking at: Home : EVENTS : Events EVENTS subscriptionNonMemberMsg\"\u003eSubscriber-only content | //--\u003e } } document.getElementById(Element).value \u003d TextToRestore; if (document.getElementById(Element).value \u003d\u003d \u0027\u0027) { function RestoreText(Element, TextToRestore) { } } document.getElementById(Element).value \u003d \u0027\u0027; if (document.getElementById(Element).value \u003d\u003d TextToClear) { function ClearText(Element, TextToClear) {","textAfterTable":"Report this rating to the moderator Or view by year 2015 2014 2013 2012 2011 0   2012 race reviewed by: Atanarjuat Overall score   40% Would you do it again?   Maybe   Details: Scenery   80% PB potential   80% Atmosphere   60% Organisation   40% Value   20% Beginner-friendliness   60% In short: The extra 0.4 miles didn\u0027t bother me, BUT In full: Perhaps because I\u0027ve had prior experience with non-exact","hasKeyColumn":true,"keyColumnIndex":0,"headerRowIndex":0}