{"relation":[["Shipping Method","Standard Shipping","2 day air","Overnight"],["Charge","Free","$25.00","$48.00"]],"pageTitle":"EWAIT - Microfiber Nappa Stretch Slip On Loafer - donaldjpliner.com","title":"","url":"http://www.donaldjpliner.com/product/microfiber_nappa_stretch_slip_on_loafer_ewait-3030.do?sortby\u003dourPicks","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"RELATION","tableNum":1,"s3Link":"common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042991019.80/warc/CC-MAIN-20150728002311-00090-ip-10-236-191-2.ec2.internal.warc.gz","recordEndOffset":406577807,"recordOffset":406561148,"tableOrientation":"HORIZONTAL","textBeforeTable":"Shipping Rates *50% will be taken off the lowest price of sale-priced handbags at DonaldJPliner.com or any Donald J Pliner retail store. This offer cannot be combined with any other promotion or discount, applied to past purchases, redeemed for cash equivalent, used to purchase gift cards, or used as payment on an account. Donald J Pliner reserves the right to cancel this offer at any time, and to cancel orders arising from pricing, technical, or other errors. All returns are subject to Donald J Pliner’s Return and Exchange Policy guidelines. Usage is subject to credit approval and product availability. This offer is valid through 8/04/15 and shall have no redeemable value thereafter. Save An Extra 50% On Sale Handbags Close X See details. SAVE 50% ON SALE HANDBAGS WITH CODE CARRY50*. }); }); directionNav: false controlNav: false, pauseOnAction: false, animationSpeed: 800, //Integer: Set the speed of animations, in milliseconds slideshowSpeed: 4000, //Integer: Set the speed of the slideshow cycling, in milliseconds namespace: \"kicker-flex-\", //{NEW} String: Prefix string attached to the class of every element generated by the plugin $(\u0027.kickerflexslider\u0027).flexslider({ $(document).ready(function() {","textAfterTable":"Orders shipping to Hawaii or Alaska must ship via 2 Day Air. Unfortunately, ground and overnight shipping is not available to these destinations. We are happy to ship to APO/FPO locations. However due to the complex nature of these distribution points we cannot guarantee expedited shipping. Please allow additional delivery time for orders shipping to these locations. FREE SHIPPING. ANY TIME*. See details. Close X Save An Extra 50% On Sale Handbags *50% will be taken off the lowest price of sale-priced handbags at DonaldJPliner.com or any Donald J Pliner retail store. This offer cannot be combined with any other promotion or discount, applied to past purchases, redeemed for cash equivalent, used to purchase gift cards, or used as payment on an account. Donald J Pliner reserves the right to cancel this offer at any time, and to cancel orders arising from pricing, technical, or other errors. All returns are subject to Donald J Pliner’s Return and Exchange Policy guidelines. Usage is subject to credit approval and product availability. This offer is valid through 8/04/15 and shall have no redeemable value thereafter. Shipping Rates Shipping Method Charge Standard Shipping Free","hasKeyColumn":true,"keyColumnIndex":0,"headerRowIndex":0}