{"relation":[["Form and Size of Riser","Sphere: 6-inch diameter","Cylinder: 4-1/4 inches by 8 inches","Square: 3-5/8 inches by 3-5/8 inches by 8-5/8 inches","Plate: 2-1/4 inches by 6-1/4 inches by 8 inches","Plate: 1-25/64 inches by 10-5/32 inches by 8 inches"],["Volume, cu inch","113","113","113","113","113"],["Weight, lb","32","32","32","32","32"],["Area, sq inch","100","120","135","160","220"],["Amount Solidified in 1 Minute, lb/cu inch","42.7","51.2","57.5","68.4","93.8"],["Time to Completely Solidify, minutes","7.2","4.7","3.6","2.7","1.5"],["A/V","0.884","1.062","1.194","1.416","1.947"]],"pageTitle":"Foundry Manual - Part 2","title":"","url":"http://www.maritime.org/doc/foundry/part2.htm","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"MATRIX","tableNum":7,"s3Link":"common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988312.76/warc/CC-MAIN-20150728002308-00321-ip-10-236-191-2.ec2.internal.warc.gz","recordEndOffset":580258135,"recordOffset":580194712,"tableOrientation":"MIXED","TableContextTimeStampAfterTable":"{62063\u003d452605 0-58-7, 225348\u003dCopyright © 2013, Maritime Park Association. All Rights Reserved. Legal Notices and Privacy Policy Version 3.00, 216901\u003d452605 0-58-10, 87031\u003dAn example of the use of gating ratio can be made with figure 112. Aluminum was used to make this flat plate casting, and one of the gating ratios that has proven successful for this type of casting is a 1:3:3 ratio. The first number refers to the cross-sectional area of the sprue base, the second number refers to the total cross section of all the runners from that sprue, and the third number refers to the total cross-sectional area of the ingates. In other words, the area of the sprue base is 1/3 that of the total area of the runners, and the total cross-sectional area of the runners equals the total cross-sectional area of the ingates., 47126\u003d452605 0-58-6, 109105\u003d452605 0-58-8, 152307\u003d452605 0-58-9}","textBeforeTable":"when molten metal is poured into the mold. It is buoyed up by a force equal to the weight of the displaced molten metal. A core with dimensions of 12 inches by 12 inches by 12 inches, or one cubic foot, will weigh approximately 100 pounds. Immersed in molten gray iron, which weighs 450 pounds per cubic foot, the core will tend to remain in place until it has displaced 100 pounds of iron, and then it will tend to float. In order to keep it submerged (displacing 450 pounds of cast iron) it will be necessary to exert 350 pounds of force on it (450 - 100 \u003d 350). It takes no more force to keep it submerged at greater depths than just below the surface. A greater head does not increase the lifting effect, although it does increase the pressure on the core. The ratio of 100 to 350, or 1 to 3.5, holds good for cores of any size, so we can make the rule that the force resulting from the tendency of a sand core to lift in cast iron is roughly 3.5 times its weight; for steel, 3.9 times; for copper, 4.5 times; etc. Where chaplets are used on large cores with extensive surface areas exposed to the metal, the usual practice is to use ordinary chaplets in the drag (since they are only required to hold the core in place until the metal is poured around them) and to","textAfterTable":"board and the ram-up board and turned over. The ram-up board (which is now on top) is removed and the mold face cleaned and slicked. Figure 82 shows the drag of the mold ready for the cope. A parting material is sprinkled over the mold joint and pattern. The parting material prevents the sand in the cope from sticking to the sand in the drag when the cope is rammed up. The parting material for large castings is usually fine silica sand. For medium and small castings, finely ground powders (such as talc or silica flour) are used. The cope of the flask is set on the drag and seated firmly with the aid of the flask pins. The cope pattern, riser forms, and any other parts of the gating system are set in their proper positions. Figure 83 shows the mold with the cope pattern, sprue, whirl-gate, and cross-gate pieces set. The facing sand is riddled into the cope and hand packed around corners and in deep pockets. At this point, any gaggers which are necessary are placed. Care should be taken not to set the gaggers too close to the pattern risers or parts of the gating system. Gaggers set too close to the mold surface will cause undesired chilling of the metal. Any mold showing exposed gagger s in the cope after the cope pattern has been drawn, should be shaken out and made over. The number of gaggers and supporting","hasKeyColumn":false,"keyColumnIndex":-1,"headerRowIndex":0}