{"relation":[["","Master Bedroom","Master Bathroom","Bedroom 2","Bathroom 2","Bedroom 3","Bathroom 3","Bedroom 4","Bathroom 4","Living/Dining Room","Kitchen","Open-Air Lounge","Sala","Pool","Outdoor Toliet","Outdoor Veranda","Walkways","Parking","Entrace","Garden Shower","Beach Access","Ceiling Fans","Air Conditioning","Villa General Specifications","Estate General Specifications"],["","Teak floors, fixed headboards with custom artwork and wall mounted reading lamps, walk-in closets, make-up/writing desk, TV with DVD and satellite connection.","Marble floors, marble counter to vanities, W/C, single vanity with built-in cabinet below, indoor \u0026 open-air showers","Teak floors, fixed headboards with custom artwork and wall lamps, walk-in closets","Marble floors, marble counter to vanities, W/C, single vanity with built-in cabinet below, indoor \u0026 open-air showers","Teak floors, fixed headboards with custom artwork and wall lamps, walk-in closets.","Marble floors, marble counter to vanities, W/C, single vanity with built-in cabinet below, indoor \u0026 open-air showers","Teak floors, fixed headboards with custom artwork and wall lamps, walk-in closets.","Marble floors, marble counter to vanities, W/C, single vanity with built-in cabinet below, indoor \u0026 open-air showers","Marble floors, exposed timber ceilings, teak fretwork to wall with built-in consoles/shelves, adjoining powder room with WC and vanity. 50 inch LCD TV with DVD and satellite connection","Fantastical appointed European style kitchen with full Siemens appliances","Marble floors, exposed timber ceilings, built-in bar counter with sink and electrical for under-counter fridge","Thai style sala (gazebo) with loose furniture and diner seating for six ceiling mounted fans with massage day bed","In-ground pool, sandstone coping over surround overflow drain, steps and pedestal at shallow end, salt water chlorination, depth 900mm to 1600mm","Direct access from garden, WC and vanity","Adjacent to living area with bar fridge, sink and stereo system with ceiling mounted speakers IPOD and laptop compatible","Terra-cotta sand wash walkways under exposed timber ceiling","Private parking for one vehicle at villa entrance","Double antique style hardwood doors","Outdoor garden shower on stone wall adjacent to beach access","Stone beach wall frontage with direct beach access","To all bedrooms, living room, open-air lounge and sala","To all bedrooms, kitchen, dining room and living room","Bathroom amenities. 100% cotton robes and slippers, mini safes, large golf umbrellas, international electrical adapters, hair dryer and torch.","Uninterrupted free wireless internet service. 100% Generator back up with automated switch over. Motion sensor infra-red cameras on all external boundaries. Monitored 24/7. Evening guard patrol from 7:00pm ? 7:00am."]],"pageTitle":"Villa Bougainvillea | Miskawaan","title":"","url":"http://www.miskawaan.com/villas/bougainvillea.php?v_id\u003d2\u0026a_date\u003d20/10/2012\u0026rnd\u003d51542a61440f2","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"ENTITY","tableNum":0,"s3Link":"common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990217.27/warc/CC-MAIN-20150728002310-00299-ip-10-236-191-2.ec2.internal.warc.gz","recordEndOffset":579012520,"recordOffset":579004318,"tableOrientation":"HORIZONTAL","TableContextTimeStampAfterTable":"{23196\u003d2015 © Miskawaan | Website hand crafted by Dulay Seymour, 14527\u003dAugust 2015 - September 2015}","textBeforeTable":"Specifications Gallery Floor Plan  A colourful tropical garden and ornamental pond form the stunning centrepiece of this four-bedroom haven, where two pavilions either side of the garden create a feeling of real privacy. On the right is an L-shaped pavilion housing one double and two twin bedrooms, all with en-suite bathrooms as well as indoor and outdoor showers. The left-hand pavilion is home to a fully-fitted kitchen, dining area and lounge. The villa\u0027s third pavilion houses the spacious Master Bedroom. Beach frontage at Bougainvillea is 14m, with a lawn at the property\u0027s front and a spectacular blue-tiled swimming pool extending right into the villa itself. Sleeps: Eight   Bathrooms: Five Villa Bougainvillea Wayu Sila Baan Tamarind Hibiscus Gardenia Frangipani Waterlily Lotus Champak Bougainvillea Acacia Villa Select Next Slide Previous Slide Close Gallery Contact Booking Location News Weddings Promotions Experiences Villas About Home Navigation","textAfterTable":"2015 Rates Season 2 Br/Sleeps 4 4 Br/Sleeps 8 Intermediate Published 15 May 2015 - 30 June 2015 01 September 2015 - 14 December 2015 2 Br/Sleeps 4  $950.00 ++ 4 Br/Sleeps 8  $1270.00 ++ $950.00 ++ $1270.00 ++ High Published 11 January 2015 - 12 February 2015 28 February 2015 - 26 March 2015 13 April 2015 - 14 May 2015 01 July 2015 - 31 August 2015 2 Br/Sleeps 4  $1170.00 ++ 4 Br/Sleeps 8  $1430.00 ++ $1170.00 ++ $1430.00 ++ Prime Published 13 February 2015 - 27 February 2015 27 March 2015 - 12 April 2015 2 Br/Sleeps 4  $1650.00 ++ 4 Br/Sleeps 8  $1650.00 ++ $1650.00 ++ $1650.00 ++ Xmas / New Year 15 December 2015 - 10 January 2016 2 Br/Sleeps 4  $2050.00 ++ 4 Br/Sleeps 8  $2050.00 ++ $2050.00 ++ $2050.00 ++ ++ Daily rates in US Dollars and are subject to","hasKeyColumn":true,"keyColumnIndex":0,"headerRowIndex":0}