{"relation":[["","U.S. Classification","International Classification","Cooperative Classification","European Classification"],["","439/475, 439/164, 439/15","H01R35/04, B60R16/02, B62D1/04, B60R16/027, H02G11/00","H02G11/00, B60R16/027","H02G11/00, B60R16/027"]],"pageTitle":"Patent US5286219 - Cutter-less rotary connector - Google Patents","title":"","url":"http://www.google.com/patents/US5286219?dq\u003d5,966,702","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"ENTITY","tableNum":7,"s3Link":"common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988312.76/warc/CC-MAIN-20150728002308-00321-ip-10-236-191-2.ec2.internal.warc.gz","recordEndOffset":485620055,"recordOffset":485601286,"tableOrientation":"HORIZONTAL","textBeforeTable":"Patent Citations In connecting the flat cable 20 and the external wire 31 across the wire terminals 14e by welding, moreover, each terminal 14e may be provided with a breakable notched portion R, as shown in FIG. 17, so that the junction between the cable 20 and the external wire 31 can be fractured under a torque of about 1 to 3 N.m. According to this arrangement, when the flat cable 20 shown in FIG. 1, which is provided with the joint mold 21 at each terminal for ease of assembly, is used in the rotary connector, the wire terminals 14e, which connect the cable 20 and the external wire 31 in the connecting post 14, are fractured, so that the wire 31 can be easily disengaged from the post 14. If the flat cable 20 and the external wire 31 are connected by means of pressfit terminals 19, which are adapted to be connected individually to conductors 20b projected from the inner end portion 20a of the cable 20 by press fitting, as shown in FIG. 18, the material and size of the terminals 19 are selected so that the terminals 19 can be disengaged by means of a tensile force of about 0.15 to 0.6N. The rotary connector 1 may be also arranged in the manner shown in FIG. 15 with the same result. In this arrangement, the flange portion 11b of the rotating case 11","textAfterTable":"US4522458 * May 11, 1983 Jun 11, 1985 Allied Corporation Electrical connector assembly having a force actuated releasing arrangement US4750380 * Aug 28, 1986 Jun 14, 1988 Cycles Peugeot Anti-theft device for the steering column of a motor vehicle US4824396 * Mar 17, 1988 Apr 25, 1989 Alps Electric Co., Ltd. Electrical connection apparatus US4863397 * Apr 22, 1988 Sep 5, 1989 Hatch Jr William K Expendable frangible electrical connector US4881423 * May 9, 1988 Nov 21, 1989 Thomas Troiano Cable actuating assembly US4975063 * Oct 25, 1989 Dec 4, 1990 Alps Electric Co., Ltd. Flat cable for steering CH221406A * Title not available * Cited by examiner Referenced by","hasKeyColumn":true,"keyColumnIndex":0,"headerRowIndex":0}