{"relation":[["Part Number","6165-1000","6165-1000"],["Description","1 inch (25 mm) dividers","2 inch (50 mm) dividers"],["Price (per 100)","$22.50","$30.00"]],"pageTitle":"Warping Tools","title":"","url":"http://www.camillavalleyfarm.com/weave/warp.htm","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"MATRIX","tableNum":11,"s3Link":"common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042991019.80/warc/CC-MAIN-20150728002311-00090-ip-10-236-191-2.ec2.internal.warc.gz","recordEndOffset":347239210,"recordOffset":347231008,"tableOrientation":"MIXED","lastModified":"Mon, 27 Apr 2015 15:31:43 GMT","textBeforeTable":"These warping boards are sturdily constructed out of Maple hardwood and are easily knocked down for storage. They can be used flat on a table or hung on a wall. The pegs are strong and are well recessed in the frame to prevent bending but can be easily removed to remove a tightly wound warp. (Note: Click on the picture to see a larger version.) Warping Boards $690.00 Floor Warping Mill 6340-4000 $262.00 Table Warping Mill 6340-2000 Price Description Part Number The Floor Model (shown at left) gives 4 yards (3.7 metres) per rotation and can warp up to 50 yards. (Height: 68 inches (173 cm), Width: 59 inches (150 cm). The Table Model (shown at right) gives 2 yards (1.8 metres) per rotation and can warp up to 22 yards long. (Height: 38 inches (96 cm), Width: 26 \u0026 1/4 inches (67 cm).","textAfterTable":"6.5 yards (6 metres) $90.00 6345-1000 Medium Warping Board 22 inches (56 cm) 40 inches (102 cm) 13 yards (12 metres) $118.00 6345-5000 Large Warping Board 22 inches (56 cm) 64 inches (163 cm) 21 yards (19 metres) $145.00 Note: As well as being a very flexible Inkle loom, the Leclerc Cendrel Loom can also be used as a tabletop warping board and is an alternative to those weavers looking for a multi-functional piece of weaving equipment. Warping Pegs These provide 2 pegs and a clamp for the side of the table and are used to make warps using the table width. A pair of Warping Pegs are provided. (Note: Click on the picture to see a larger version.)","hasKeyColumn":false,"keyColumnIndex":-1,"headerRowIndex":0}