{"relation":[["Latitude:","Longitude:","Initial heading:","Final heading:"],["41° 47\u0027","129° 47\u0027","272.4°","268.1°"],["North","East","West","West"]],"pageTitle":"Distance between Chongjin and Shenyang","title":"","url":"http://www.timeanddate.com/worldclock/distanceresult.html?p1\u003d3574\u0026p2\u003d1935","hasHeader":false,"headerPosition":"NONE","tableType":"OTHER","tableNum":0,"s3Link":"common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981969.11/warc/CC-MAIN-20150728002301-00077-ip-10-236-191-2.ec2.internal.warc.gz","recordEndOffset":760682333,"recordOffset":760674131,"tableOrientation":"HORIZONTAL","TableContextTimeStampAfterTable":"{5858\u003dCopyright © Time and Date AS 1995–2015. All rights reserved.}","textBeforeTable":"Heading from Chongjin The map is using a projection that makes land and oceans much wider near the south and north poles. The heading/course/bearing during a flight varies in most cases. Map based on image from NASA. Location for Shenyang Location for Chongjin Map – Shortest path between Chongjin and Shenyang The distance is the theoretical air distance (great circle distance). Flying between the two locations\u0027 airports can be a different distance, depending on airport location and actual route chosen. Distance is 528 kilometers or 328 miles or 285 nautical miles Distance from Chongjin to Shenyang Distance Calculator \u003e Results Calculators \u003e Home \u003e Week Number Weekday Travel Time Distance Dialing Codes","textAfterTable":"See other cities near Chongjin Calculate distance from Chongjin to another location Heading from Shenyang Latitude: 41° 48\u0027  North Longitude: 123° 26\u0027  East Initial heading: 88.1° East Final heading: 92.4° East See other cities near Shenyang Calculate distance from Shenyang to another location Find distance between other locations Find distance between two other locations Modify From or To location Local time comparison Location Local time Chongjin (North Korea) Wednesday, July 29, 2015 at 1:23:53 AM Shenyang (China - Liaoning) Wednesday, July 29, 2015 at 12:23:53 AM Other time conversions Convert time between Chongjin and Shenyang Find suitable time to call between Chongjin and Shenyang Advertising","hasKeyColumn":true,"keyColumnIndex":0,"headerRowIndex":-1}