{"relation":[["Grade","1","1","1","2","4","4","4","5","K","K-3","K-3"],["Number","SC-1.311","SC-1.314","SC-1.316","SC-2.316","SC-4.316","SC-4.317","SC-4.318","SC-5.317","SC-K.301","GEO K-3","HIS K-3"],["Standard","recognize that in addition to common basic needs, organisms also have specific needs such as type of water, range of temperature, type of food.","sort and group plants and animals based on their physical properties or behavioral characteristics.","sort and group solids based on physical properties such as color, shape, ability to roll or stack, hardness, magnetic attraction, or whether they sink or float in water.","identify and describe specific features of an organism that help it survive in its environment.","recognize the role that plants play in curbing erosion and run off and determine the degree to and manner in which Delawareans are working to preserve natural areas such as wetlands, forest, sand dunes.","structures in living organisms (plants and animals) that enable them to reproduce, grow, and survive in their environment.","develop simple classification systems (properties of germination, territorial behavior) based on similarities and differences in the structures or behavior of living organisms.","changes to a particular ecosystem from either natural or human-made events and explain whether the changes are beneficial or harmful.","observe and describe the properties of a variety of living and non-living things using the 5 senses.","concepts of place and region to explain simple patterns places across the country and the world.","use clocks, calendars, schedules, and written records to record or locate events in time."]],"pageTitle":"Standards for DE","title":"","url":"http://www.arbordalepublishing.com/Standards_by_title.php?state\u003dDE\u0026t\u003d22","hasHeader":true,"headerPosition":"FIRST_ROW","tableType":"RELATION","tableNum":4,"s3Link":"common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988312.76/warc/CC-MAIN-20150728002308-00321-ip-10-236-191-2.ec2.internal.warc.gz","recordEndOffset":303670134,"recordOffset":303661932,"tableOrientation":"HORIZONTAL","textBeforeTable":"Alignment to Standards for DE Contact Us Submissions Media Center Signings / Events Authors / Illustrators How to Order Online Store Home  ","textAfterTable":"Back to Standards Page home  |  catalog  |  privacy policy  |  contact us","hasKeyColumn":false,"keyColumnIndex":-1,"headerRowIndex":0}